///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Определяет список модулей библиотек и конфигурации, которые предоставляют
// основные сведения о себе: имя, версия, список обработчиков обновления
// а также зависимости от других библиотек.
//
// Состав обязательных процедур такого модуля см. в общем модуле ОбновлениеИнформационнойБазыБСП
// (область ПрограммныйИнтерфейс).
// При этом сам модуль Библиотеки стандартных подсистем ОбновлениеИнформационнойБазыБСП
// не требуется явно добавлять в массив МодулиПодсистем.
//
// Параметры:
//  МодулиПодсистем - Массив - имена серверных общих модулей библиотек и конфигурации.
//                             Например: "ОбновлениеИнформационнойБазыБРО" - библиотека,
//                                       "ОбновлениеИнформационнойБазыБП"  - конфигурация.
//                    
Процедура ПриДобавленииПодсистем(МодулиПодсистем) Экспорт
	
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыРТ");
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыБПО");
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыБЭД");
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыЕГАИС");
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыГИСМ");
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыВЕТИС");
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыИСМП");
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыЗЕРНО");
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыГосИС");
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыУправлениеМП");
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыРМК");
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыСерверЛояльности");
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыWebKassa");
	
	//ИнтеграцияИСМПТК
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыИСМПТК");
	//Конец ИнтеграцияИСМПТК
	
	//Криптография
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыКриптография");
	//Конец Криптография

	
КонецПроцедуры

#КонецОбласти
