#Область ПрограммныйИнтерфейс

// Заполняет признак использования торговых объектов для контрагентов.
//
// Параметры:
//  Использовать - Булево - признак использования торговых объектов.
Процедура ИспользоватьТорговыеОбъектыКонтрагентов(Использовать) Экспорт
	
	Использовать = Ложь;
	
КонецПроцедуры

// Заполняет торговый объект из контрагента.
//
// Параметры:
//  ТорговыйОбъект - ОпределяемыйТип.ТорговыйОбъектЕГАИС        - Торговый объект.
//  Контрагент     - ОпределяемыйТип.ОрганизацияКонтрагентГосИС - Контрагент, для которого необходимо получить торговый объект.
Процедура ТорговыйОбъектКонтрагента(ТорговыйОбъект, Контрагент) Экспорт
	
	ИнтеграцияЕГАИСРТ.ТорговыйОбъектКонтрагента(ТорговыйОбъект, Контрагент);
	
КонецПроцедуры

// Заполняет контрагента из торгового объекта.
//
// Параметры:
//  Контрагент     - ОпределяемыйТип.ОрганизацияКонтрагентГосИС - контрагент торгового объекта.
//  ТорговыйОбъект - ОпределяемыйТип.ТорговыйОбъектЕГАИС - Торговый объект, для которого необходимо получить контрагента.
Процедура КонтрагентТорговогоОбъекта(Контрагент, ТорговыйОбъект) Экспорт
	
	ИнтеграцияЕГАИСРТ.КонтрагентТорговогоОбъекта(Контрагент, ТорговыйОбъект);
	
КонецПроцедуры

// Поиск контрагента и торгового объекта контрагента (партнера) по ИНН и/или КПП.
//
// Параметры:
//  ВозвращаемоеЗначение - Неопределено - результат поиска (не найден),
//                       - Структура    - результат поиска:
//   * Контрагент     - ОпределяемыйТип.ОрганизацияКонтрагентГосИС - найденный контрагент,
//   * ТорговыйОбъект - ОпределяемыйТип.ТорговыйОбъектЕГАИС        - найденный торговый объект контрагента (партнер).
//  ИНН                  - Строка       - ИНН искомого контрагента,
//  КПП                  - Строка       - КПП искомого контрагента.
Процедура КонтрагентТорговыйОбъектПоИННКПП(ВозвращаемоеЗначение, ИНН, КПП) Экспорт
	
	ИнтеграцияЕГАИСРТ.КонтрагентТорговыйОбъектПоИННКПП(ВозвращаемоеЗначение, ИНН, КПП);
	
КонецПроцедуры

#КонецОбласти
