
#Область СлужебныеПроцедурыИФункции

Функция ВерсияКомпонентыНЦАВБазе() Экспорт
	
	Возврат "5.32";
	
КонецФункции

Функция НовыйКриптопровайдерWSSocket(УникальныйИдентификаторФормыКлиента = Неопределено, РежимТишины = Ложь, ТолькоПодключение = Ложь) Экспорт

	Возврат КриптографияКлиентСервер.НовыйКриптопровайдерWSSocket(УникальныйИдентификаторФормыКлиента, РежимТишины, ТолькоПодключение);
	
КонецФункции

Функция ПолучитьСписокДляОтбораМаркируемойПродукции() Экспорт
	
	ОсобенностьУчетаСписок = Новый Массив();
	ОсобенностьУчетаСписок.Добавить(ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.ТабачнаяПродукция"));
	ОсобенностьУчетаСписок.Добавить(ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.ОбувнаяПродукция"));
	ОсобенностьУчетаСписок.Добавить(ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.МолочнаяПродукцияПодконтрольнаяВЕТИС"));
	ОсобенностьУчетаСписок.Добавить(ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.ЛекарственныеПрепараты"));
	
	Возврат ОсобенностьУчетаСписок;
	
КонецФункции

#КонецОбласти