#Область ПеременныеМодуля

// НА ПЕРИОД ПЕРЕХОДА

Перем глОбщиеЗначения Экспорт; // Переменная, хранящая кеш общих значений.

// КОНЕЦ НА ПЕРИОД ПЕРЕХОДА

// ПодключаемоеОборудование
Перем глПодключаемоеОборудование Экспорт; // для кэширования на клиенте

// ИнтеграцияГОСИС
Перем глПодключаемоеОборудованиеСобытиеОбработано Экспорт;
Перем глПодключаемоеОборудованиеСобытиеОбработаноДанные Экспорт; // для предотвращения повторной обработки события
// Конец ИнтеграцияГОСИС

// СтандартныеПодсистемы

// Хранилище глобальных переменных.
//
// ПараметрыПриложения - Соответствие - хранилище переменных, где:
//   * Ключ - Строка - имя переменной в формате "ИмяБиблиотеки.ИмяПеременной";
//   * Значение - Произвольный - значение переменной.
//
// Инициализация (на примере СообщенияДляЖурналаРегистрации):
//   ИмяПараметра = "СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации";
//   Если ПараметрыПриложения[ИмяПараметра] = Неопределено Тогда
//     ПараметрыПриложения.Вставить(ИмяПараметра, Новый СписокЗначений);
//   КонецЕсли;
//  
// Использование (на примере СообщенияДляЖурналаРегистрации):
//   ПараметрыПриложения["СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации"].Добавить(...);
//   ПараметрыПриложения["СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации"] = ...;
Перем ПараметрыПриложения Экспорт; // Общая переменная

// Конец СтандартныеПодсистемы

// МаркетинговыеАкции
Перем ПорядковыйНомерПродажи Экспорт; // Используется для вычисления скидок по кратности номера продаж.
// Конец МаркетинговыеАкции

Перем НомерДокументаКассыККМ Экспорт; // Нумератор выданных документов (чеков) покупателю.

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередНачаломРаботыСистемы(Отказ) 
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыКлиент.ПередНачаломРаботыСистемы();
	// Конец СтандартныеПодсистемы
	
	// СтандартныеПодсистемы.ОценкаПроизводительности
	ИмяПараметра = "СтандартныеПодсистемы.ОценкаПроизводительности.ТекущееВремяНачалаГлобальнойОперации";
	ПараметрыПриложения.Вставить(ИмяПараметра, ТекущаяУниверсальнаяДатаВМиллисекундах());
    // Конец СтандартныеПодсистемы.ОценкаПроизводительности
	
	//БРМК
	ОбщегоНазначенияРМККлиент.ПередНачаломРаботыСистемы();
	//БРМК 
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.ПередНачаломРаботыСистемы();
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

Процедура ПриНачалеРаботыСистемы()
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыКлиент.ПриНачалеРаботыСистемы();
	// Конец СтандартныеПодсистемы
	
	// МаркетинговыеАкции
	ПорядковыйНомерПродажи = 1;
	// Конец МаркетинговыеАкции
	
	НомерДокументаКассыККМ = Новый Соответствие;
	
КонецПроцедуры

Процедура ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения)
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыКлиент.ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения);
	// Конец СтандартныеПодсистемы
	
	Если НЕ Отказ Тогда
		// ПодключаемоеОборудование
		МенеджерОборудованияКлиент.ПередЗавершениемРаботыСистемы();
		// Конец ПодключаемоеОборудование		
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаВнешнегоСобытия(Источник, Событие, Данные)
	
	// ИнтеграцияГОСИС
	Если глПодключаемоеОборудованиеСобытиеОбработаноДанные <> Неопределено
		И глПодключаемоеОборудованиеСобытиеОбработаноДанные[Данные] <> Неопределено Тогда
		глПодключаемоеОборудованиеСобытиеОбработаноДанные.Удалить(Данные);
		Возврат;
	КонецЕсли;
	// Конец ИнтеграцияГОСИС
	
	// ПодключаемоеОборудование
	МенеджерОборудованияРМККлиент.ОбработкаВнешнегоСобытия(Источник, Событие, Данные);
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Функция возвращает значение экспортных переменных модуля.
//
// Параметры:
//  Имя - строка, содержит имя переменной целиком.
//
// Возвращаемое значение:
//   значение соответствующей экспортной переменной
Функция глЗначениеПеременной(Имя) Экспорт

	Возврат ОбщегоНазначенияРТКлиент.ПолучитьЗначениеПеременной(Имя, глОбщиеЗначения);
	
КонецФункции

// Процедура установки значения экспортных переменных модуля приложения.
//
// Параметры:
//  Имя - строка, содержит имя переменной целиком.
// 	Значение - значение переменной.
//
Процедура глЗначениеПеременнойУстановить(Имя, Значение, ОбновлятьВоВсехКэшах = Ложь) Экспорт
	
	ОбщегоНазначенияРТВызовСервера.УстановитьЗначениеПеременной(Имя, глОбщиеЗначения, Значение, ОбновлятьВоВсехКэшах);
	
КонецПроцедуры

// Процедура открывает меню РМК.
//
Процедура ОткрытьМенюРМКУправляемыйРежимПриЗапуске() Экспорт
	
	ПараметрыОткрытияРМК = ОбщегоНазначенияРТВызовСервера.ОткрыватьРМКПриЗапускеПрограммы();
	Если ПараметрыОткрытияРМК.Свойство("ОткрыватьРМК") И ПараметрыОткрытияРМК.ОткрыватьРМК Тогда
		ОбщегоНазначенияРТКлиент.ОткрытьМенюРМКУправляемыйРежим();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Инициализация

// ИнтеграцияЕГАИС
глПодключаемоеОборудованиеСобытиеОбработано = Истина;
// Конец ИнтеграцияЕГАИС

#КонецОбласти
