
&Вместо("ОбработкаПроверкиЗаполнения")
Процедура EF_00_00060826_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	Если ИспользоватьБезПодключенияОборудования Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ТипОборудования");
		МассивНепроверяемыхРеквизитов.Добавить("ПодключаемоеОборудование");
	Иначе
		Если ЭтотОбъект.ТипКассы = Перечисления.ТипыКассККМ.СетевоеОборудование Тогда
			МассивНепроверяемыхРеквизитов.Добавить("РабочееМесто");
			МассивНепроверяемыхРеквизитов.Добавить("Магазин");
		КонецЕсли;
		
		Если ТипКассы = Перечисления.ТипыКассККМ.ФискальныйРегистратор Тогда
			ПроверяемыеРеквизиты.Добавить("ПодключаемоеОборудование");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПодключаемоеОборудование) Тогда
			Если ЗначениеЗаполнено(ТипОборудования) Тогда
				Если ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ
					ИЛИ ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ПринтерЧеков Тогда
					УправлениеШаблонами.ПроверитьТипШаблона(ЭтотОбъект, "ШаблонЧекаККМ", Перечисления.ТипыШаблонов.ЧекККТ, Отказ);
					УправлениеШаблонами.ПроверитьТипШаблона(ЭтотОбъект, "ШаблонЧекаККМВозврат", Перечисления.ТипыШаблонов.ЧекККТ, Отказ);
				ИначеЕсли ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ФискальныйРегистратор Тогда
					УправлениеШаблонами.ПроверитьТипШаблона(ЭтотОбъект, "ШаблонЧекаККМ", Перечисления.ТипыШаблонов.ФискальныйЧек, Отказ);
					УправлениеШаблонами.ПроверитьТипШаблона(ЭтотОбъект, "ШаблонЧекаККМВозврат", Перечисления.ТипыШаблонов.ФискальныйЧек, Отказ);
				КонецЕсли;
			Иначе
				ТекстСообщения = НСтр("ru = 'У выбранного оборудования не определен тип'");
				ОбщегоНазначения.СообщитьПользователю(
					ТекстСообщения,
					ЭтотОбъект,
					"ПодключаемоеОборудование",
					"Объект",
					Отказ);
			КонецЕсли;
		Иначе
			МассивНепроверяемыхРеквизитов.Добавить("ТипОборудования");
		КонецЕсли;
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры
