////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
// Процедура - обработчик события ПриСозданииНаСервере.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Ставка.Видимость = НЕ Объект.ДляОсвобожденногоОборота;
	
КонецПроцедуры // ПриСозданииНаСервере()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ФОРМЫ

&НаКлиенте
// Процедура - обработчик события ПриИзменении поля ввода НеОблагается.
//
Процедура ДляОсвобожденногоОборотаПриИзменении(Элемент)
	
	Если Объект.ДляОсвобожденногоОборота Тогда
		Объект.Ставка = 0;
		Элементы.Ставка.Видимость = Ложь;
	Иначе
		Элементы.Ставка.Видимость = Истина;
	КонецЕсли;
		
КонецПроцедуры // НеОблагаетсяПриИзменении()
