////////////////////////////////////////////////////////////////////////////////
// ОбработкаТабличнойЧастиТоварыСерверПовтИсп содержит процедуры и функции 
// для работы с табличными частями товаров документов.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает числовое значение ставки НДС по значению перечисления.
//
// Параметры:
//  СтавкаНДС - ПеречислениеСсылка.СтавкиНДС - значение перечисления СтавкиНДС.
//
// Возвращаемое значение:
//  Число - ставка ндс.
//
Функция СтавкаНДСЧислом(Знач СтавкаНДС) Экспорт
	
	Если СтавкаНДС = Неопределено Тогда
		Возврат 0;
	КонецЕсли;
	
	Возврат ?(СтавкаНДС.Ставка = 0, 0, СтавкаНДС.Ставка / 100);
	
КонецФункции

#КонецОбласти
