#Область ПрограммныйИнтерфейс

// Возвращает фактический адрес торгового объекта для чека ЕГАИС.
//
// Параметры:
//  Адрес          - Строка                              - адрес торгового объекта.
//  ТорговыйОбъект - ОпределяемыйТип.ТорговыйОбъектЕГАИС - ссылка на торговый объект для определения адреса.
Процедура АдресТорговогоОбъекта(Адрес, ТорговыйОбъект) Экспорт
	
	ИнтеграцияЕГАИСРТ.АдресТорговогоОбъекта(Адрес, ТорговыйОбъект);
	
КонецПроцедуры

// В функции нужно определить значения по умолчанию, которые будут подставляться в
// реквизиты не сопоставленных элементов справочника.
//
// Параметры:
//  СобственнаяОрганизация - ОпределяемыйТип.ОрганизацияКонтрагентГосИС - значение по умолчанию для собственной организации,
//  СобственныйТорговыйОбъект - ОпределяемыйТип.ТорговыйОбъектЕГАИС - значение по умолчанию для собственного торгового объекта,
//  СторонняяОрганизация - ОпределяемыйТип.ОрганизацияКонтрагентГосИС - значение по умолчанию для сторонней организации,
//  СтороннийТорговыйОбъект - ОпределяемыйТип.ТорговыйОбъектЕГАИС - значение по умолчанию для стороннего торгового объекта.
Процедура ЗначенияПоУмолчаниюНеСопоставленныхОбъектов(
		СобственнаяОрганизация,
		СобственныйТорговыйОбъект,
		СторонняяОрганизация      = Неопределено,
		СтороннийТорговыйОбъект   = Неопределено) Экспорт
	
	ИнтеграцияЕГАИСРТ.ЗначенияПоУмолчаниюНеСопоставленныхОбъектов(
		СобственнаяОрганизация,
		СобственныйТорговыйОбъект,
		СторонняяОрганизация,
		СтороннийТорговыйОбъект);
	
КонецПроцедуры

// Процедура вызывается перед записью организации в базу.
//
// Параметры:
//  Организация - СправочникОбъект.КлассификаторОрганизацийЕГАИС - загружаемая организация.
Процедура ПриЗагрузкеОрганизации(Организация) Экспорт
	
	ИнтеграцияЕГАИСРТ.ПриЗагрузкеОрганизации(Организация);
	
КонецПроцедуры

#КонецОбласти
