 
 &НаКлиенте
 Процедура РасшВыемка_СоздатьВыемкуДСПосле(Команда)
	    СсылкаНаВыемку = ПроверкаНаПрисутсвиеВСписке();
	 Если ЗначениеЗаполнено(СсылкаНаВыемку) тогда
		 Сообщение = Новый СообщениеПользователю;
		 Сообщение.Текст = "На основании данного документа уже существует документ: "+ СсылкаНаВыемку+ " со статусом ""Проведен"". Для продолжения отмените проведение документа.";
		 Сообщение.Сообщить();
		 Возврат;	 
	 КонецЕСли;
	 
	 СуммаБезналичных = Объект.ОплатаПлатежнымиКартами.Итог("Сумма");  
	 Если Объект.СуммаДокумента - СуммаБезналичных <> Объект.СуммаОплатыНаличных Тогда
		 Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопрос", ЭтотОбъект);  
		 СтрокаВопроса = СтрШаблон("Сумма наличных не совпадает с разницей между суммой документа и суммой безналичной оплаты,
		 |Сумма безналичных: %1,
		 |Сумма документа: %2,
		 |Сумма наличных из документа: %3,
		 |Сумма наличных должна быть: %2 - %1 = %4,
		 |Заменить сумму наличных в документе на корректную?"
		 ,СуммаБезналичных, Объект.СуммаДокумента, Объект.СуммаОплатыНаличных
		 , Объект.СуммаДокумента - СуммаБезналичных);
		 ПоказатьВопрос(Оповещение, СтрокаВопроса,   		 
		 РежимДиалогаВопрос.ДаНетОтмена,		 
		 0,  		 
		 КодВозвратаДиалога.Да );
	 Иначе
		 ОткрытьВыемкуДС()
	 КонецЕсли;
	 
 КонецПроцедуры
 
 &НаСервере
 Функция ПроверкаНаПрисутсвиеВСписке()
	 ДокументыПрисутсвуют = Документы.ВыемкаДенежныхСредствИзКассыККМ.ПустаяСсылка();	 
	 МассивСсылок = КритерииОтбора.СвязанныеДокументы.Найти(Объект.Ссылка);
	 Для Каждого Ссылка Из МассивСсылок Цикл
		 Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ВыемкаДенежныхСредствИзКассыККМ") 
			 И Ссылка.Проведен тогда
			 ДокументыПрисутсвуют = Ссылка;
		 КонецЕСли;
	 КонецЦикла; 
	 Возврат ДокументыПрисутсвуют;
 КонецФункции
 
 
 &НаКлиенте	 
 Процедура ПослеОтветаНаВопрос(Результат, Параметры) Экспорт  		 
	 Если Результат = КодВозвратаДиалога.Да Тогда
		 Объект.СуммаОплатыНаличных = Объект.СуммаДокумента - Объект.ОплатаПлатежнымиКартами.Итог("Сумма"); 
		 ЭтотОбъект.Записать();
		 ОткрытьВыемкуДС();            		 
	 КонецЕсли;                
 КонецПроцедуры
 
 
 &НаКлиенте	 
 Процедура ОткрытьВыемкуДС()
	 
	 Если Объект.СуммаОплатыНаличных <= 0 тогда
		 Сообщение = Новый СообщениеПользователю;
		 Сообщение.Текст = "Сумма наличных не может быть отрицательна или равна 0. ("+Объект.СуммаОплатыНаличных+")";
		 Сообщение.Сообщить();
		 Возврат;
	 КонецЕСли;
	 	 
	 ПараметрыФормы = Новый Структура("Основание", Объект.Ссылка);
	 ОткрытьФорму("Документ.ВыемкаДенежныхСредствИзКассыККМ.ФормаОбъекта", ПараметрыФормы);    
 КонецПроцедуры
 
 
 