
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Заполняет исходные данные для программного формирования элементов плиточного интерфейса формы подбора
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - ПлиточныйИнтерфейсВыбораТоваров
//
Процедура ЗаполнитьОпорныеДанныеПанелиПлиточногоИнтерфейса(Форма) Экспорт
	
	Форма.ОпорныеДанные.Очистить();
	УникальныйИдентификаторФормы = Форма.УникальныйИдентификатор;
	
	ТаблицаИерархическогоСоставаПалитры = СформироватьСоставПалитрыСУчетомВложенныхПалитр(Форма);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПалитраТоваровРМКСостав.НомерСтроки КАК НомерСтроки,
	|	ПалитраТоваровРМКСостав.Номенклатура КАК Номенклатура,
	|	ПалитраТоваровРМКСостав.Характеристика КАК Характеристика,
	|	ПалитраТоваровРМКСостав.НомерКатегории КАК НомерКатегории,
	|	ПалитраТоваровРМКСостав.НомерКатегорииРазмещения КАК НомерКатегорииРазмещения,
	|	ПалитраТоваровРМКСостав.ИндексПозиции КАК ИндексПозиции,
	|	ПалитраТоваровРМКСостав.ЦветШрифта КАК ЦветШрифта,
	|	ПалитраТоваровРМКСостав.ЦветФона КАК ЦветФона,
	|	ПалитраТоваровРМКСостав.ЭтоКатегория КАК ЭтоКатегория,
	|	ПалитраТоваровРМКСостав.ИмяЭлемента КАК ИмяЭлемента,
	|	ПалитраТоваровРМКСостав.ИзображениеЭлемента КАК ИзображениеЭлемента,
	|	ПалитраТоваровРМКСостав.ВидМодификатора КАК ВидМодификатора,
	|	ПалитраТоваровРМКСостав.ИмеетсяВложенность КАК ИмеетсяВложенность,
	|	ПалитраТоваровРМКСостав.ИсточникПалитры КАК ИсточникПалитры,
	|	ПалитраТоваровРМКСостав.Упаковка КАК Упаковка,
	|	ПалитраТоваровРМКСостав.СкрыватьОстаток КАК СкрыватьОстаток
	|ПОМЕСТИТЬ ПалитраТоваровРМКСостав
	|ИЗ
	|	&ТаблицаСоставаПалитры КАК ПалитраТоваровРМКСостав
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПалитраТоваровРМКСостав.НомерКатегории КАК НомерКатегории,
	|	ПалитраТоваровРМКСостав.НомерКатегорииРазмещения КАК НомерКатегорииРазмещения,
	|	ПалитраТоваровРМКСостав.ИндексПозиции КАК ИндексПозиции,
	|	ВложенныйЗапрос.НомерСтроки КАК НомерСтрокиМодификатора,
	|	ПалитраТоваровРМКСостав.ИсточникПалитры КАК ИсточникПалитры
	|ПОМЕСТИТЬ ВТГрупповыеМодификаторы
	|ИЗ
	|	ПалитраТоваровРМКСостав КАК ПалитраТоваровРМКСостав
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ПалитраТоваровРМКСостав.НомерКатегорииРазмещения КАК НомерКатегорииРазмещения,
	|			ПалитраТоваровРМКСостав.НомерСтроки КАК НомерСтроки,
	|			ПалитраТоваровРМКСостав.ИсточникПалитры КАК ИсточникПалитры
	|		ИЗ
	|			ПалитраТоваровРМКСостав КАК ПалитраТоваровРМКСостав
	|		ГДЕ
	|			ПалитраТоваровРМКСостав.НомерКатегорииРазмещения > 0
	|			И НЕ ПалитраТоваровРМКСостав.ВидМодификатора = ЗНАЧЕНИЕ(Перечисление.ВидыМодификаторовРМК.ПустаяСсылка)) КАК ВложенныйЗапрос
	|		ПО ПалитраТоваровРМКСостав.НомерКатегорииРазмещения = ВложенныйЗапрос.НомерКатегорииРазмещения
	|			И ПалитраТоваровРМКСостав.ИсточникПалитры = ВложенныйЗапрос.ИсточникПалитры И Не ПалитраТоваровРМКСостав.ЭтоКатегория
	|ГДЕ
	|	ПалитраТоваровРМКСостав.ВидМодификатора = ЗНАЧЕНИЕ(Перечисление.ВидыМодификаторовРМК.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПалитраТоваровРМКСостав.НомерСтроки КАК НомерСтроки,
	|	ПалитраТоваровРМКСостав.НомерКатегории КАК НомерКатегории,
	|	ПалитраТоваровРМКСостав.НомерКатегорииРазмещения КАК НомерКатегорииРазмещения,
	|	ПалитраТоваровРМКСостав.ИндексПозиции КАК ИндексПозиции,
	|	ПалитраТоваровРМКСостав.ЭтоКатегория КАК ЭтоКатегория,
	|	ПалитраТоваровРМКСостав.ИмеетсяВложенность КАК ИмеетсяВложенность,
	|	ПалитраТоваровРМКСостав.ИсточникПалитры КАК ИсточникПалитры
	|ПОМЕСТИТЬ СтруктураПалитрыБезМодификаторов
	|ИЗ
	|	ПалитраТоваровРМКСостав КАК ПалитраТоваровРМКСостав
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГрупповыеМодификаторы КАК ВТГрупповыеМодификаторы
	|		ПО ПалитраТоваровРМКСостав.НомерСтроки = ВТГрупповыеМодификаторы.НомерСтрокиМодификатора
	|			И ПалитраТоваровРМКСостав.ИсточникПалитры = ВТГрупповыеМодификаторы.ИсточникПалитры
	|ГДЕ
	|	ВТГрупповыеМодификаторы.НомерСтрокиМодификатора ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПалитраТоваровРМКСостав.НомерСтроки КАК НомерСтроки,
	|	ПалитраТоваровРМКСостав.НомерКатегории КАК НомерКатегории,
	|	СтруктураПалитрыБезМодификаторов.НомерКатегории КАК НомерКатегорииРазмещения,
	|	ПалитраТоваровРМКСостав.ЭтоКатегория КАК ЭтоКатегория,
	|	ЛОЖЬ КАК ИмеетсяВложенность,
	|	ПалитраТоваровРМКСостав.ИндексПозиции КАК ИндексПозиции,
	|	ПалитраТоваровРМКСостав.ИсточникПалитры КАК ИсточникПалитры
	|ПОМЕСТИТЬ СтруктураПалитрыМодификаторов
	|ИЗ
	|	СтруктураПалитрыБезМодификаторов КАК СтруктураПалитрыБезМодификаторов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТГрупповыеМодификаторы КАК ВТГрупповыеМодификаторы
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПалитраТоваровРМКСостав КАК ПалитраТоваровРМКСостав
	|			ПО ВТГрупповыеМодификаторы.НомерСтрокиМодификатора = ПалитраТоваровРМКСостав.НомерСтроки
	|				И ВТГрупповыеМодификаторы.ИсточникПалитры = ПалитраТоваровРМКСостав.ИсточникПалитры
	|		ПО СтруктураПалитрыБезМодификаторов.НомерКатегории = ВТГрупповыеМодификаторы.НомерКатегории
	|			И СтруктураПалитрыБезМодификаторов.НомерКатегорииРазмещения = ВТГрупповыеМодификаторы.НомерКатегорииРазмещения
	|			И СтруктураПалитрыБезМодификаторов.ИндексПозиции = ВТГрупповыеМодификаторы.ИндексПозиции
	|			И СтруктураПалитрыБезМодификаторов.ИсточникПалитры = ВТГрупповыеМодификаторы.ИсточникПалитры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПалитраТоваровРМКСостав.НомерСтроки КАК НомерСтроки,
	|	0 КАК НомерКатегории,
	|	ПалитраТоваровРМКСостав.НомерКатегории КАК НомерКатегорииРазмещенияЭлемента,
	|	1 КАК ИндексПозицииВКатегории,
	|	ПалитраТоваровРМКСостав.ЭтоКатегория КАК ЭтоКатегория,
	|	ПалитраТоваровРМКСостав.ИмеетсяВложенность КАК ИмеетсяВложенность,
	|	ИСТИНА КАК ЭтоТекущаяКатегория,
	|	1 КАК ПорядокВидов,
	|	ПалитраТоваровРМКСостав.ИсточникПалитры КАК ИсточникПлитки
	|ПОМЕСТИТЬ ИтоговаяСтруктура
	|ИЗ
	|	ПалитраТоваровРМКСостав КАК ПалитраТоваровРМКСостав
	|ГДЕ
	|	ПалитраТоваровРМКСостав.НомерКатегории > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтруктураПалитрыМодификаторов.НомерСтроки,
	|	СтруктураПалитрыМодификаторов.НомерКатегории,
	|	СтруктураПалитрыМодификаторов.НомерКатегорииРазмещения,
	|	СтруктураПалитрыМодификаторов.ИндексПозиции,
	|	СтруктураПалитрыМодификаторов.ЭтоКатегория,
	|	СтруктураПалитрыМодификаторов.ИмеетсяВложенность,
	|	ЛОЖЬ,
	|	ВЫБОР
	|		КОГДА СтруктураПалитрыБезМодификаторов.ИндексПозиции > СтруктураПалитрыМодификаторов.ИндексПозиции
	|			ТОГДА 2
	|		ИНАЧЕ 4
	|	КОНЕЦ,
	|	СтруктураПалитрыМодификаторов.ИсточникПалитры
	|ИЗ
	|	СтруктураПалитрыМодификаторов КАК СтруктураПалитрыМодификаторов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтруктураПалитрыБезМодификаторов КАК СтруктураПалитрыБезМодификаторов
	|		ПО СтруктураПалитрыМодификаторов.НомерКатегорииРазмещения = СтруктураПалитрыБезМодификаторов.НомерКатегории
	|			И СтруктураПалитрыМодификаторов.ИсточникПалитры = СтруктураПалитрыБезМодификаторов.ИсточникПалитры
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтруктураПалитрыБезМодификаторов.НомерСтроки,
	|	СтруктураПалитрыБезМодификаторов.НомерКатегории,
	|	СтруктураПалитрыБезМодификаторов.НомерКатегорииРазмещения,
	|	СтруктураПалитрыБезМодификаторов.ИндексПозиции,
	|	СтруктураПалитрыБезМодификаторов.ЭтоКатегория,
	|	СтруктураПалитрыБезМодификаторов.ИмеетсяВложенность,
	|	ЛОЖЬ,
	|	3,
	|	СтруктураПалитрыБезМодификаторов.ИсточникПалитры
	|ИЗ
	|	СтруктураПалитрыБезМодификаторов КАК СтруктураПалитрыБезМодификаторов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтоговаяСтруктура.ИсточникПлитки КАК ИсточникПлитки,
	|	ИтоговаяСтруктура.НомерСтроки КАК НомерСтроки,
	|	ИтоговаяСтруктура.НомерКатегорииРазмещенияЭлемента КАК НомерКатегорииРазмещенияЭлемента,
	|	ИтоговаяСтруктура.ПорядокВидов КАК ПорядокВидов,
	|	ИтоговаяСтруктура.ИндексПозицииВКатегории КАК ИндексПозицииВКатегории,
	|	ИтоговаяСтруктура.НомерКатегории КАК НомерКатегории,
	|	ИтоговаяСтруктура.ИмеетсяВложенность КАК ИмеетсяВложенность,
	|	ИтоговаяСтруктура.ЭтоКатегория КАК ЭтоКатегория,
	|	ИтоговаяСтруктура.ЭтоТекущаяКатегория КАК ЭтоТекущаяКатегория,
	|	ПалитраТоваровРМКСостав.ИмяЭлемента КАК ИмяЭлемента,
	|	ПалитраТоваровРМКСостав.ВидМодификатора КАК ВидМодификатора,
	|	ПалитраТоваровРМКСостав.Номенклатура КАК Номенклатура,
	|	ПалитраТоваровРМКСостав.Характеристика КАК Характеристика,
	|	ПалитраТоваровРМКСостав.ЦветШрифта КАК ЦветШрифта,
	|	ПалитраТоваровРМКСостав.ЦветФона КАК ЦветФона,
	|	ПалитраТоваровРМКСостав.ИзображениеЭлемента КАК ИзображениеЭлемента,
	|	ПалитраТоваровРМКСостав.Упаковка КАК Упаковка,
	|	ПалитраТоваровРМКСостав.СкрыватьОстаток КАК СкрыватьОстаток
	|ИЗ
	|	ИтоговаяСтруктура КАК ИтоговаяСтруктура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПалитраТоваровРМКСостав КАК ПалитраТоваровРМКСостав
	|		ПО ИтоговаяСтруктура.НомерСтроки = ПалитраТоваровРМКСостав.НомерСтроки
	|			И ИтоговаяСтруктура.ИсточникПлитки = ПалитраТоваровРМКСостав.ИсточникПалитры
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИсточникПлитки,
	|	НомерКатегорииРазмещенияЭлемента,
	|	ПорядокВидов,
	|	ИндексПозицииВКатегории");
	
	ПалитраПлитки = Неопределено;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "СтруктураПлиточногоИнтерфейсаПодбора") Тогда
		ПалитраПлитки = Форма.СтруктураПлиточногоИнтерфейсаПодбора;
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "СтруктураПлиточногоИнтерфейса") Тогда
		ПалитраПлитки = Форма.СтруктураПлиточногоИнтерфейса;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТаблицаСоставаПалитры", ТаблицаИерархическогоСоставаПалитры);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЗаполнитьОпорныеДанныеСтрокамиПалитры(Форма, Выборка, ПалитраПлитки);
	
КонецПроцедуры

// Заполняет исходные данные для программного формирования элементов плиточного интерфейса формы подбора
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - ПлиточныйИнтерфейсВыбораТоваров
//  ТоварыДляУстройств - Таблица значений с колонками:
//		*Номенклатура - ОпределяемыйТип.НоменклатураРМК,
//		*Характеристика - ОпределяемыйТип.ХарактеристикаРМК,
//		*Весовой - Булево,
//		*SKU - Число.
//
Процедура ЗаполнитьОпорныеДанныеПлиточногоИнтерфейсаДляУстройствРаспознавания(Форма, ТоварыДляУстройств) Экспорт
	
	Форма.ОпорныеДанные.Очистить();
	ПалитраПлитки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Форма.ТекущаяНастройкаРМК,
		"СтруктураПлиточногоИнтерфейсаПодбора");
	Если ЗначениеЗаполнено(ПалитраПлитки) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапросаТоваровДляУстройствИзПалитры();
		Запрос.УстановитьПараметр("ТоварыУстройств", ТоварыДляУстройств);
		Запрос.УстановитьПараметр("ПалитраТоваров", ПалитраПлитки);
		
		Выборка = Запрос.Выполнить().Выбрать();
		ЗаполнитьОпорныеДанныеСтрокамиПалитры(Форма, Выборка, ПалитраПлитки);
		ДополнительныеПараметры = Новый Структура();
		ДополнительныеПараметры.Вставить("МаксимальныйНомерКатегории", 0);
		ДополнительныеПараметры.Вставить("МаксимальныйИндексПозицииВНулевойКатегории", 0);
		ТаблицаТоваровПалитры = ПолучитьТаблицуТоваровОпорныхДанных(Форма.ОпорныеДанные, ДополнительныеПараметры);
		Если ТаблицаТоваровПалитры.Количество() = 0 Тогда
			ДобавитьВОпорныеДанныеТоварыНеИзПалитры(Форма, ТоварыДляУстройств, Ложь);
		Иначе
			ТоварыНеИзПалитры = ВыделитьНеПопавшиеВПалитруТовары(ТоварыДляУстройств, ТаблицаТоваровПалитры);
			Если ТоварыНеИзПалитры.Количество() > 0 Тогда
				ДобавитьВОпорныеДанныеТоварыНеИзПалитры(Форма, ТоварыНеИзПалитры, Истина, ДополнительныеПараметры);
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		НастроитьКоличествоЭлементовПлитки(Форма);
		ДобавитьВОпорныеДанныеТоварыНеИзПалитры(Форма, ТоварыДляУстройств, Ложь);
	КонецЕсли;
	ДобавитьСлужебныеГруппыВесовогоТовараВОпорныеДанные(Форма);
	
КонецПроцедуры

Процедура ЗаполнитьИерархиюПалитрыТоваров(ИерархияТоваров, ИсходныеДанные) Экспорт
	
	ЦветаФормы = ОбщегоНазначенияРМК.ЦветаФормыРМК();
	
	ЭлементыДерева = ИерархияТоваров.ПолучитьЭлементы();
	
	Корень = ЭлементыДерева.Добавить();
	Корень.ИмяЭлемента = НСтр("ru = 'Первый уровень'", ОбщегоНазначения.КодОсновногоЯзыка());
	Корень.ЭтоКатегория = Истина;
	Корень.НомерИзображения = 0;
	
	НумерацияКатегорий = Новый Соответствие;
	НумерацияКатегорий.Вставить(0, Корень);
	
	Если ЗначениеЗаполнено(ИсходныеДанные) Тогда

		ТекстЗапросаПостроенияДерева = 
		"ВЫБРАТЬ
		|	СтруктураПлиточногоИнтерфейсаПодбораРМКСостав.Ссылка КАК Ссылка,
		|	СтруктураПлиточногоИнтерфейсаПодбораРМКСостав.НомерСтроки КАК НомерСтроки,
		|	СтруктураПлиточногоИнтерфейсаПодбораРМКСостав.Номенклатура КАК Номенклатура,
		|	СтруктураПлиточногоИнтерфейсаПодбораРМКСостав.Характеристика КАК Характеристика,
		|	СтруктураПлиточногоИнтерфейсаПодбораРМКСостав.ЗаголовокЭлемента КАК ЗаголовокЭлемента,
		|	СтруктураПлиточногоИнтерфейсаПодбораРМКСостав.НомерКатегории КАК НомерКатегории,
		|	СтруктураПлиточногоИнтерфейсаПодбораРМКСостав.ИндексПозиции КАК ИндексПозиции,
		|	СтруктураПлиточногоИнтерфейсаПодбораРМКСостав.НомерКатегорииРазмещения КАК НомерКатегорииРазмещения,
		|	СтруктураПлиточногоИнтерфейсаПодбораРМКСостав.Шрифт КАК Шрифт,
		|	СтруктураПлиточногоИнтерфейсаПодбораРМКСостав.ЦветШрифта КАК ЦветШрифта,
		|	СтруктураПлиточногоИнтерфейсаПодбораРМКСостав.ЦветФона КАК ЦветФона,
		|	СтруктураПлиточногоИнтерфейсаПодбораРМКСостав.ЭтоКатегория КАК ЭтоКатегория,
		|	СтруктураПлиточногоИнтерфейсаПодбораРМКСостав.ИмяЭлемента КАК Наименование,
		|	СтруктураПлиточногоИнтерфейсаПодбораРМКСостав.ИмяЭлемента КАК ИмяЭлемента,
		|	СтруктураПлиточногоИнтерфейсаПодбораРМКСостав.ИзображениеЭлемента КАК ИзображениеЭлемента,
		|	СтруктураПлиточногоИнтерфейсаПодбораРМКСостав.ХарактеристикиИспользуются КАК ХарактеристикиИспользуются,
		|	СтруктураПлиточногоИнтерфейсаПодбораРМКСостав.КатегорияРазмещения КАК КатегорияРазмещения,
		|	СтруктураПлиточногоИнтерфейсаПодбораРМКСостав.ВидМодификатора КАК ВидМодификатора,
		|	СтруктураПлиточногоИнтерфейсаПодбораРМКСостав.Упаковка КАК Упаковка,
		|	СтруктураПлиточногоИнтерфейсаПодбораРМКСостав.СкрыватьОстаток КАК СкрыватьОстаток,
		|	СтруктураПлиточногоИнтерфейсаПодбораРМКСостав.Палитра КАК Палитра
		|ПОМЕСТИТЬ ПалитраТоваровРМКСостав
		|ИЗ
		|	Справочник.ПалитраТоваровРМК.Состав КАК СтруктураПлиточногоИнтерфейсаПодбораРМКСостав
		|ГДЕ
		|	СтруктураПлиточногоИнтерфейсаПодбораРМКСостав.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПалитраТоваровРМКСостав.НомерКатегорииРазмещения КАК НомерКатегорииРазмещения
		|ПОМЕСТИТЬ ВТНомераКатегорийРазмещения
		|ИЗ
		|	ПалитраТоваровРМКСостав КАК ПалитраТоваровРМКСостав
		|ГДЕ
		|	ПалитраТоваровРМКСостав.НомерКатегорииРазмещения > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПалитраТоваровРМКСостав.НомерКатегории КАК НомерКатегории,
		|	ПалитраТоваровРМКСостав.НомерКатегорииРазмещения КАК НомерКатегорииРазмещения,
		|	ПалитраТоваровРМКСостав.ИндексПозиции КАК ИндексПозиции
		|ПОМЕСТИТЬ ВТГрупповыеМодификаторы
		|ИЗ
		|	ПалитраТоваровРМКСостав КАК ПалитраТоваровРМКСостав
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ПалитраТоваровРМКСостав.НомерКатегорииРазмещения КАК НомерКатегорииРазмещения
		|		ИЗ
		|			ПалитраТоваровРМКСостав КАК ПалитраТоваровРМКСостав
		|		ГДЕ
		|			ПалитраТоваровРМКСостав.НомерКатегорииРазмещения > 0
		|			И НЕ ПалитраТоваровРМКСостав.ВидМодификатора = ЗНАЧЕНИЕ(Перечисление.ВидыМодификаторовРМК.ПустаяСсылка)) КАК ВложенныйЗапрос
		|		ПО ПалитраТоваровРМКСостав.НомерКатегорииРазмещения = ВложенныйЗапрос.НомерКатегорииРазмещения
		|ГДЕ
		|	ПалитраТоваровРМКСостав.ВидМодификатора = ЗНАЧЕНИЕ(Перечисление.ВидыМодификаторовРМК.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПалитраТоваровРМКСостав.Ссылка КАК Ссылка,
		|	ПалитраТоваровРМКСостав.НомерСтроки КАК НомерСтроки,
		|	ПалитраТоваровРМКСостав.ЭтоКатегория КАК ЭтоКатегория,
		|	ВТНомераКатегорийРазмещения.НомерКатегорииРазмещения ЕСТЬ НЕ NULL 
		|		ИЛИ ВТГрупповыеМодификаторы.НомерКатегорииРазмещения ЕСТЬ НЕ NULL  КАК ИмеетсяВложенность,
		|	ПалитраТоваровРМКСостав.НомерКатегории КАК НомерКатегории,
		|	ПалитраТоваровРМКСостав.НомерКатегорииРазмещения КАК НомерКатегорииРазмещения,
		|	ПалитраТоваровРМКСостав.ИндексПозиции КАК ИндексПозиции,
		|	ПалитраТоваровРМКСостав.ИмяЭлемента КАК ИмяЭлемента,
		|	ПалитраТоваровРМКСостав.Номенклатура КАК Номенклатура,
		|	ПалитраТоваровРМКСостав.Характеристика КАК Характеристика,
		|	ПалитраТоваровРМКСостав.ЗаголовокЭлемента КАК ЗаголовокЭлемента,
		|	ПалитраТоваровРМКСостав.ИзображениеЭлемента КАК ИзображениеЭлемента,
		|	ПалитраТоваровРМКСостав.ХарактеристикиИспользуются КАК ХарактеристикиИспользуются,
		|	ПалитраТоваровРМКСостав.Шрифт КАК Шрифт,
		|	ПалитраТоваровРМКСостав.ЦветШрифта КАК ЦветШрифта,
		|	ПалитраТоваровРМКСостав.ЦветФона КАК ЦветФона,
		|	ПалитраТоваровРМКСостав.ВидМодификатора КАК ВидМодификатора,
		|	ВЫБОР
		|		КОГДА ПалитраТоваровРМКСостав.ЭтоКатегория
		|			ТОГДА 1
		|		КОГДА НЕ ПалитраТоваровРМКСостав.Палитра = ЗНАЧЕНИЕ(Справочник.ПалитраТоваровРМК.ПустаяСсылка)
		|			ТОГДА 5
		|		КОГДА ПалитраТоваровРМКСостав.ВидМодификатора = ЗНАЧЕНИЕ(Перечисление.ВидыМодификаторовРМК.ВключатьВЧек)
		|			ТОГДА 3
		|		КОГДА ПалитраТоваровРМКСостав.ВидМодификатора = ЗНАЧЕНИЕ(Перечисление.ВидыМодификаторовРМК.НеВключатьВЧек)
		|			ТОГДА 4
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК НомерИзображения,
		|	ПалитраТоваровРМКСостав.КатегорияРазмещения КАК КатегорияРазмещения,
		|	ПалитраТоваровРМКСостав.Упаковка КАК Упаковка,
		|	ПалитраТоваровРМКСостав.СкрыватьОстаток КАК СкрыватьОстаток,
		|	ПалитраТоваровРМКСостав.Палитра КАК Палитра
		|ИЗ
		|	ПалитраТоваровРМКСостав КАК ПалитраТоваровРМКСостав
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНомераКатегорийРазмещения КАК ВТНомераКатегорийРазмещения
		|		ПО ПалитраТоваровРМКСостав.НомерКатегории = ВТНомераКатегорийРазмещения.НомерКатегорииРазмещения
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГрупповыеМодификаторы КАК ВТГрупповыеМодификаторы
		|		ПО ПалитраТоваровРМКСостав.НомерКатегорииРазмещения = ВТГрупповыеМодификаторы.НомерКатегорииРазмещения
		|			И ПалитраТоваровРМКСостав.ИндексПозиции = ВТГрупповыеМодификаторы.ИндексПозиции
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерКатегорииРазмещения,
		|	КатегорияРазмещения,
		|	ИндексПозиции
		|ИТОГИ ПО
		|	НомерКатегорииРазмещения";
		
		Запрос = Новый Запрос(ТекстЗапросаПостроенияДерева);
		Запрос.УстановитьПараметр("Ссылка", ИсходныеДанные);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока Выборка.Следующий() Цикл
		
			ВыборкаПоКатегории = Выборка.Выбрать();
			РодительскийЭлемент = НумерацияКатегорий.Получить(Выборка.НомерКатегорииРазмещения).ПолучитьЭлементы();
			
			Пока ВыборкаПоКатегории.Следующий() Цикл
				
				НовыйЭлемент = РодительскийЭлемент.Добавить();
				ЗаполнитьЗначенияСвойств(НовыйЭлемент, ВыборкаПоКатегории);
				
				Если НовыйЭлемент.ЭтоКатегория ИЛИ НовыйЭлемент.ИмеетсяВложенность Тогда
					НумерацияКатегорий.Вставить(НовыйЭлемент.НомерКатегории, НовыйЭлемент);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ИсходныеДанные.ШрифтЭлементовПодбора) Тогда
					НовыйЭлемент.Шрифт = ОбщегоНазначения.ЗначениеВСтрокуXML(ИсходныеДанные.ШрифтЭлементовПодбора);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ВыборкаПоКатегории.ЦветШрифта) Тогда
					НовыйЭлемент.ЦветШрифта = ОбщегоНазначения.ЗначениеИзСтрокиXML(ВыборкаПоКатегории.ЦветШрифта);
				КонецЕсли;

				Если ЗначениеЗаполнено(ВыборкаПоКатегории.ЦветФона) Тогда
					НовыйЭлемент.ЦветФона = ОбщегоНазначения.ЗначениеИзСтрокиXML(ВыборкаПоКатегории.ЦветФона);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьСоставПалитрыИзбранногоПоДаннымДерева(СоставПалитры, ИерархияТоваров, ЗаполнятьНомерСтроки = Ложь) Экспорт
	
	НомерСтроки = Неопределено;
	Если ЗаполнятьНомерСтроки Тогда
		НомерСтроки = 0;
	КонецЕсли;
	
	Дерево = ДанныеФормыВЗначение(ИерархияТоваров, Тип("ДеревоЗначений"));
	Дерево.Строки.Сортировать("ИндексПозиции", Истина);
	СоставПалитры.Очистить();
	ИндексКорневогоЭлемента = 0;
	ЭлементыДерева = Дерево.Строки;
	КорневойЭлемент = ЭлементыДерева[ИндексКорневогоЭлемента];
	Ветви = КорневойЭлемент.Строки;
	ЗаполнитьСоставПалитрыИзбранногоПоДаннымДереваВУзле(СоставПалитры, Ветви, ИндексКорневогоЭлемента, НомерСтроки);
	
КонецПроцедуры

Процедура НастроитьПервоначальныйИнтерфейсРежимаКассыСамообслуживания(Форма) Экспорт
	
	ВысотаКоманд = 2;
	
	ЭлементыФормы = Форма.Элементы;
	КомандыФормы = Форма.Команды;
	ЭлементыФормы.РассчитатьСкидки.Видимость = Форма.РаботаВРежимеМедленногоСоединения;
	КомандыФормы.РассчитатьСкидки.Отображение = ОтображениеКнопки.Текст;
	КомандыФормы.РассчитатьСкидки.Картинка = Новый Картинка();
	
	КомандыФормы.ОткрытьПлиточныйИнтерфейсКаталога.Отображение = ОтображениеКнопки.КартинкаИТекст;
	КомандыФормы.ОткрытьПлиточныйИнтерфейсКаталога.Заголовок = НСтр("ru='Каталог'");
	
	ЗаголовокНоваяПокупка = НСтр("ru='Новая покупка'");
	КомандыФормы.УдалитьЧек.Заголовок = ЗаголовокНоваяПокупка;
	КомандыФормы.ПродолжитьПослеПробитияЧека.Заголовок = ЗаголовокНоваяПокупка;
	ЭлементыФормы.УдалитьЧек.ВысотаЗаголовка = 2;
	
	ЭлементыФормы.НачатьСканированиеКСО.Видимость = Истина;
	
	ЭлементыФормы.РассчитатьСкидки.Заголовок = НСтр("ru='Рассчитать скидки'");
	ЭлементыФормы.РассчитатьСкидки.Высота = ВысотаКоманд;
	ЭлементыФормы.ГруппаQRCode.Видимость = Ложь;
	ЭлементыФормы.ГруппаНайденнаяКартаПочта.Видимость = Ложь;
	ЭлементыФормы.ГруппаНайденнаяКартаФИО.Видимость = Ложь;
	ЭлементыФормы.ГруппаНайденнаяКартаДатаРождения.Видимость = Ложь;
	ЭлементыФормы.ГруппаИнформацияПокупателяФИО.Видимость = Ложь;
	ЭлементыФормы.ГруппаИнформацияПокупателяТелефон.Видимость = Ложь;
	ЭлементыФормы.ГруппаИнформацияПокупателяДатаРождения.Видимость = Ложь;
	ЭлементыФормы.ГруппаИнформацияПокупателяАдресЭлПочты.Видимость = Ложь;
	ЭлементыФормы.ОтложитьЧекИзОшибки.Видимость = Ложь;
	ЭлементыФормы.ДекорацияПоясненияКАвторизации.Видимость = Ложь;
	ЭлементыФормы.ОткрытьФормуСозданияКодаДоступа.Видимость = Ложь;
	ЭлементыФормы.ДекорацияУдалитьСБП.Видимость = Ложь;
	ЭлементыФормы.ДекорацияУдалитьЮКасса.Видимость = Ложь;
	
	ЭлементыФормы.ГруппаИнфоОшибка.ЦветФона = WebЦвета.Красный;
	ЭлементыФормы.ГруппаЗаменаПрав.ЦветФона = WebЦвета.Красный;
	ЭлементыФормы.ДекорацияЗаголовокВводКассира.ЦветТекста = WebЦвета.Красный;
	ЭлементыФормы.ТекстПредупреждениеЗаголовок.ЦветТекста = WebЦвета.Белый;
	ЭлементыФормы.ТекстПредупреждениеОшибка.ЦветТекста = WebЦвета.Белый;
	ЭлементыФормы.ДекорацияЗаголовокЗаменаПрав.ЦветТекста = WebЦвета.Белый;
	ЭлементыФормы.ДекорацияТекстЗаменаПрав.ЦветТекста = WebЦвета.Белый;
	ЭлементыФормы.ДекорацияОшибкаЗаменаПрав.ЦветТекста = WebЦвета.Белый;
	ЭлементыФормы.ЗакрытьФормуДанныеПокупателя.Заголовок
		= ИнтерфейсРМКСлужебныйКлиентСервер.НаименованиеКнопкиЗакрытияДанныхПокупателя(Истина);
		
	ПараметрыПлиточногоИнтерфейса = ИнтерфейсРМКСлужебныйКлиентСервер.ПараметрыПлиточногоИнтерфейса();
	ЭлементыФормы.УдалитьЧек.Доступность = Истина;
	ЭлементыФормы.УдалитьЧек.Картинка = БиблиотекаКартинок.РМКНоваяПродажа24;
	ЭлементыФормы.УдалитьЧекРасширеннаяПодсказка.Заголовок = НСтр("ru='Начать новую продажу'");
	ЭлементыФормы.УдалитьЧек.Отображение = ОтображениеКнопки.КартинкаИТекст;
	ЭлементыФормы.УдалитьЧек.Ширина = ПараметрыПлиточногоИнтерфейса.ШиринаКомандыСНадписью;
	Если Не (Форма.ИспользоватьАртикул Или Форма.ИспользоватьКод) Тогда
		ЭлементыФормы.ТоварыПредставлениеНоменклатураХарактеристика.АвтоВысотаЯчейки = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура УвеличитьРазмерКоманд(Форма) Экспорт
	Перем ПараметрыРазмеров;
	
	ПараметрыУвеличенногоИнтерфейса = ПараметрыУвеличенногоИнтерфейса(Форма.ВидОтображения);
	Высота = ПараметрыУвеличенногоИнтерфейса.ВысотаКоманды;
	Ширина = ПараметрыУвеличенногоИнтерфейса.ШиринаКоманды;
	Шрифт = ПараметрыУвеличенногоИнтерфейса.Шрифт;
	
	Элементы = Форма.Элементы;
	
	Элементы.ОперацииСтраницаКнопок.Видимость = Истина;
	Элементы.ОперацииСтраницы.ТекущаяСтраница = Элементы.ОперацииСтраницаКнопок;
	
	Если Не Форма.РежимКассыСамообслуживания Тогда
		НастроитьКомандыРежимИЕще(Форма);
	КонецЕсли;
	
	Для Каждого ЭлементФормы Из Элементы Цикл
		Если ИгнорироватьЭлементДляУвеличенияРазмера(Форма.РежимКассыСамообслуживания, Элементы, ЭлементФормы) Тогда
			Продолжить;
		КонецЕсли;
		Если ЭлементФормы.Высота = 0 Или ЭлементФормы.Высота = 1 Тогда
			ЭлементФормы.Высота = Высота;
		КонецЕсли;
		Если ЗначениеЗаполнено(ЭлементФормы.Ширина) И ЭлементФормы.Ширина < 4 Тогда
			ЭлементФормы.Ширина = Ширина;
		КонецЕсли;
	КонецЦикла;
	
	Если Форма.ВертикальнаяОриентация Тогда
		Элементы.ПанельВидовОплат.Ширина = ПараметрыУвеличенногоИнтерфейса.ШиринаПанелиВидовОплат;
		Элементы.ГруппаСлоевЛеваяВерхняяВспомогательнаяПанель.Ширина = 28;
	Иначе
		Элементы.ГруппаСлоевПанелиУправления.Ширина = 26;
	КонецЕсли;
	УвеличитьРазмерПолейОплат(Элементы.ПанельВидовОплат, ПараметрыУвеличенногоИнтерфейса);
	
	Элементы.СкидкаТекущийТоварПроцент.Ширина = Ширина;
	Элементы.СкидкаТекущийТоварСумма.Ширина = Ширина;
	Элементы.УказатьСерии.Ширина = Ширина;
	Элементы.УказатьХарактеристику.Ширина = Ширина;
	Элементы.СкидкаНаЧекПроцентом.Ширина = Ширина;
	Элементы.СкидкаНаЧекСуммой.Ширина = Ширина;
	Элементы.ТекущийТоварЦенаИзКарточки.Ширина = ПараметрыУвеличенногоИнтерфейса.ШиринаПоля;
	
	Если Форма.РежимКассыСамообслуживания Тогда
		ПараметрыРазмеров = ИнтерфейсРМКСлужебныйКлиентСервер.ПараметрыРазмеровКомандУправленияЧекомДляКСО();
	Иначе
		ПараметрыРазмеров = ПараметрыРазмеровКомандУправленияЧекомДляОбычногоРежима(ПараметрыУвеличенногоИнтерфейса);
	КонецЕсли;
	ПараметрыИнтерфейсаПлитки = ИнтерфейсРМКСлужебныйКлиентСервер.ПараметрыПлиточногоИнтерфейса();
	ПараметрыРазмеров.Вставить("ШиринаКомандыСНадписью", ПараметрыИнтерфейсаПлитки.ШиринаКомандыСНадписью);
	ИнтерфейсРМКСлужебныйКлиентСервер.НастроитьРазмерКомандУправленияСоставомЧека(Форма, ПараметрыРазмеров, Истина);
	УстановитьУвеличенныйШрифтПолей(Элементы, ПараметрыУвеличенногоИнтерфейса);
	
	ОбщегоНазначенияРМКПереопределяемый.УвеличитьРазмерКоманд(Форма, ПараметрыУвеличенногоИнтерфейса);
	
КонецПроцедуры

Процедура НастроитьЭлементыПоМасштабу(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	Если Форма.ВидОтображения = Перечисления.ВидыОтображения.Уменьшенный Тогда
		Элементы.Предупреждение.Шрифт = ШрифтыСтиля.ШрифтОбычный32РМК;
	КонецЕсли;
	
КонецПроцедуры

// Устанавливает условное оформление формы
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения.
//
Процедура УстановитьУсловноеОформление(Форма) Экспорт

	Если Форма.ИмяФормы = "Обработка.РабочееМестоКассира.Форма.ФормаРМК" Тогда
		УстановитьУсловноеОформлениеФормыРМК(Форма);
	КонецЕсли;
	
КонецПроцедуры

// Подготавливает панель наличных купюр формы РМК
//
// Параметры:
//  Форма - форма клиентского приложения ФормаРМК
//  ИспользоватьПанельВводаНаличныхКупюр - Булево
//  ВертикальнаяОриентация - Булево. Признак настройки использования экрана в вертикальной ориентации.
//
Процедура ПодготовитьПанельВводаНаличныхКупюр(Форма, ИспользоватьПанельВводаНаличныхКупюр,
		ВертикальнаяОриентация = Ложь) Экспорт
	Перем ГруппаРядКупюр;
	
	КоличествоКупюрВРяде = 4;
	ОчиститьПанельКупюр(Форма);
	Если ИспользоватьПанельВводаНаличныхКупюр Тогда
	
		ШаблонИмениКартинкиКупюры = НСтр("ru='РМККупюраНоминалВеличина_ru'");
		КоличествоКупюрРяда1 = 0;
		МассивДанныхКупюр = Новый Массив;
		Элементы = Форма.Элементы;
		
		ЗапросНоминалов = Новый Запрос;
		ЗапросНоминалов.Текст =
		"ВЫБРАТЬ
		|	СправочникНастройкиРМК.ВводНаличныхАкселераторAlt КАК Alt,
		|	СправочникНастройкиРМК.ВводНаличныхАкселераторCtrl КАК Ctrl,
		|	СправочникНастройкиРМК.ВводНаличныхАкселераторShift КАК Shift
		|ИЗ
		|	Справочник.НастройкиРабочегоМестаКассира КАК СправочникНастройкиРМК
		|ГДЕ
		|	СправочникНастройкиРМК.Ссылка = &НастройкаСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НастройкиРабочегоМестаКассираВводНаличных.Номинал КАК Номинал,
		|	НастройкиРабочегоМестаКассираВводНаличных.Клавиша КАК Клавиша
		|ИЗ
		|	Справочник.НастройкиРабочегоМестаКассира.ВводНаличных КАК НастройкиРабочегоМестаКассираВводНаличных
		|ГДЕ
		|	НастройкиРабочегоМестаКассираВводНаличных.Ссылка = &НастройкаСсылка
		|	И НастройкиРабочегоМестаКассираВводНаличных.Использование";
		ЗапросНоминалов.УстановитьПараметр("НастройкаСсылка", Форма.ТекущаяНастройкаРМК);
		РезультатыЗапросов = ЗапросНоминалов.ВыполнитьПакет();
		ВыборкаАкселераторов = РезультатыЗапросов[0].Выбрать();
		АкселераторыКупюр = Новый Структура("Alt,Ctrl,Shift", Ложь, Ложь, Ложь);
		Если ВыборкаАкселераторов.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(АкселераторыКупюр, ВыборкаАкселераторов);
		КонецЕсли;
		ВыборкаНоминалов = РезультатыЗапросов[1].Выбрать();
		Пока ВыборкаНоминалов.Следующий() Цикл
			
			ИмяКартинки = СтрЗаменить(ШаблонИмениКартинкиКупюры, "Величина", ВыборкаНоминалов.Номинал);
			ОбъектКартинки = Метаданные.ОбщиеКартинки.Найти(ИмяКартинки);
			Если Не ОбъектКартинки = Неопределено Тогда
				КартинкаКупюры = БиблиотекаКартинок[ИмяКартинки];
				СочетаниеКлавишКупюры = ПодготовитьСочетаниеГорячейКлавиши(АкселераторыКупюр, ВыборкаНоминалов.Клавиша);
				ДанныеКупюры = Новый Структура("НоминалКупюры,КартинкаКупюры,ГорячаяКлавиша",
					ВыборкаНоминалов.Номинал, КартинкаКупюры, СочетаниеКлавишКупюры);
				МассивДанныхКупюр.Добавить(ДанныеКупюры);
			КонецЕсли;
			
		КонецЦикла;
		КоличествоКупюр = МассивДанныхКупюр.Количество();
		Если КоличествоКупюр > 0 Тогда
			Форма.ИспользоватьПанельВводаНаличных = Истина;
			Если ВертикальнаяОриентация Тогда
				КоличествоКупюрРяда1 = ?(КоличествоКупюр > КоличествоКупюрВРяде, Окр(КоличествоКупюр / 2, 0, 1), КоличествоКупюр);
			КонецЕсли;
			ИндексКупюры = 0;
			Пока ИндексКупюры < КоличествоКупюр Цикл
				ДанныеКупюры = МассивДанныхКупюр.Получить(ИндексКупюры);
				Если ВертикальнаяОриентация Тогда
					ГруппаРядКупюр = ?(ИндексКупюры < КоличествоКупюрРяда1, Элементы.ГруппаКупюрРяд1, Элементы.ГруппаКупюрРяд2);
				Иначе
					ГруппаРядКупюр = Элементы.ГруппаКупюр;
				КонецЕсли;
				ДобавитьКупюруНаПанельВводаНаличных(Элементы, Форма.Команды, ГруппаРядКупюр, ДанныеКупюры);
				ИндексКупюры = ИндексКупюры + 1;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Подготавливает панель управления чеком формы РМК
//
// Параметры:
//  Форма - форма клиентского приложения ФормаРМК
//  ВертикальнаяОриентация - Булево. Признак настройки использования экрана в вертикальной ориентации.
//
Процедура НастроитьПанельУправленияЧеком(Форма, ВертикальнаяОриентация) Экспорт
	
	ПараметрыЭлементовПанели = ПолучитьПараметрыЭлементовПанелиУправленияЧеком(Форма);
	
	Для Каждого ДанныеЭлемента Из ПараметрыЭлементовПанели Цикл
		МодифицироватьЭлементФормы(Форма.Элементы, ДанныеЭлемента, ВертикальнаяОриентация);
	КонецЦикла;
	
	Форма.Элементы.ВернутьсяВРежимПодбораТовара.Видимость = (Не ВертикальнаяОриентация);
	Форма.Элементы.ГруппаВозвратВПодборИзУправления.Видимость = Ложь;
	Форма.Элементы.ГруппаВозвратВПодборИзСертификатов.Видимость = ВертикальнаяОриентация;
	Форма.Элементы.ГруппаВозвратВПодборИзПанелиНаличных.Видимость = ВертикальнаяОриентация;
	
	Форма.Элементы.ГруппаУправленияЧекомВер.Видимость = ВертикальнаяОриентация;
	Форма.Элементы.ГруппаУправленияЧекомГор.Видимость = (Не ВертикальнаяОриентация);

КонецПроцедуры

// Добавляет элемент отбора на равенство в отбор компоновки данных
//
// Параметры:
//  ЭлементВладелецОтбора - родительский элемент (отбор, группа отбора), которому добавляется элемент отбора.
//  ПутьКДаннымЭлемента - Строка - путь к элементу данных, значение которого сравнивается.
//  ЗначениеСравнения - любое значение, с которым сравнивается значение элемента.
//
Процедура ДобавитьЭлементОтбораКомпоновкиДанныхРавенство(ЭлементВладелецОтбора, ПутьКДаннымЭлемента, ЗначениеСравнения) Экспорт
	
	ЭлементОтбора = ЭлементВладелецОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьКДаннымЭлемента);
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = ЗначениеСравнения;
	
КонецПроцедуры

Функция ПараметрыУвеличенногоИнтерфейса(ВидОтображения) Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("ВысотаКоманды", 2);
	Параметры.Вставить("ШиринаКоманды", 4);
	Параметры.Вставить("ШиринаПоля", 10);
	Параметры.Вставить("ШиринаПанелиВидовОплат", 30);
	
	ШрифтПоляВвода = Неопределено;
	Если ВидОтображения = Перечисления.ВидыОтображения.Уменьшенный Тогда
		ШрифтПоляВвода = ШрифтыСтиля.ШрифтПоляВводаРМК18;
	ИначеЕсли ВидОтображения = Перечисления.ВидыОтображения.Стандартный Тогда
		ШрифтПоляВвода = ШрифтыСтиля.ШрифтПоляВводаРМК17;
	Иначе
		ШрифтПоляВвода = ШрифтыСтиля.ШрифтПоляВводаРМК;
	КонецЕсли;
	Параметры.Вставить("Шрифт", ШрифтПоляВвода);
	Параметры.Вставить("ШрифтКнопкиВидаОплаты", ШрифтыСтиля.ШрифтОбычныйПолужирныйРМК);
	Параметры.Вставить("ШрифтСуммОплат", ШрифтыСтиля.ШрифтОбычныйПолужирный16РМК);
	
	Возврат Параметры;
	
КонецФункции

Процедура СформироватьЭлементыПанелиИзбранныхПозиций(Форма, ГорячиеКлавиши) Экспорт
	
	Элементы = Форма.Элементы;
	
	ДанныеКнопок = Форма.ДанныеКнопок;
	ОсновнаяГруппаЭлементов = Элементы.ГруппаРядовКнопокБыстрыхТоваров;
	
	Для ПорядковыйНомер = 1 По 12 Цикл
		СтрокаКнопка = ДанныеКнопок.Добавить();
	КонецЦикла;
	
	ИндексКнопки = 0;
	ИндексРяда = 1;
	
	КоличествоКнопокВРяду = 4;
	КоличествоРядов = 3;
	
	Для ИндексРяда = 1 По КоличествоРядов Цикл
		
		РядКнопок = ДобавитьРядКнопок(ОсновнаяГруппаЭлементов, ИндексРяда, Элементы);
		
		Для СчетчикКнопок = 1 По КоличествоКнопокВРяду Цикл
			ДобавитьКнопкуВРяд(РядКнопок, ИндексКнопки, ГорячиеКлавиши, Форма);
			ИндексКнопки = ИндексКнопки + 1;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьУсловноеОформлениеИерархииБыстрыхТоваров(Форма) Экспорт
	
	УсловноеОформление = Форма.УсловноеОформление;
	Элементы = Форма.Элементы;
	
	НомераКартинок = Новый СписокЗначений;
	НомераКартинок.Добавить(0);
	НомераКартинок.Добавить(5);
	
	// Только просмотр для корня и палитры
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеДереваТоваров = Элемент.Поля.Элементы.Добавить();
	ПолеДереваТоваров.Поле = Новый ПолеКомпоновкиДанных(Элементы.ИерархияТоваров.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение =
		Новый ПолеКомпоновкиДанных(Элементы.ИерархияТоваровНомерИзображения.ПутьКДанным);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборЭлемента.ПравоеЗначение = НомераКартинок;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	// Не отображать шрифт, цвет шрифта и цвет фона для корня и палитры
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеШрифт = Элемент.Поля.Элементы.Добавить();
	ПолеШрифт.Поле = Новый ПолеКомпоновкиДанных(Элементы.ИерархияТоваровШрифт.Имя);
	
	ПолеЦвет = Элемент.Поля.Элементы.Добавить();
	ПолеЦвет.Поле = Новый ПолеКомпоновкиДанных(Элементы.ИерархияТоваровЦветШрифта.Имя);
	
	ПолеФон = Элемент.Поля.Элементы.Добавить();
	ПолеФон.Поле = Новый ПолеКомпоновкиДанных(Элементы.ИерархияТоваровЦветФона.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение =
		Новый ПолеКомпоновкиДанных(Элементы.ИерархияТоваровНомерИзображения.ПутьКДанным);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборЭлемента.ПравоеЗначение = НомераКартинок;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Отображать", Ложь);
	
	// Только просмотр для категорий
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеНоменклатуры = Элемент.Поля.Элементы.Добавить();
	ПолеНоменклатуры.Поле = Новый ПолеКомпоновкиДанных(Элементы.ИерархияТоваровНоменклатура.Имя);
	
	ПолеХарактеристики = Элемент.Поля.Элементы.Добавить();
	ПолеХарактеристики.Поле = Новый ПолеКомпоновкиДанных(Элементы.ИерархияТоваровХарактеристика.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Элементы.ИерархияТоваровЭтоКатегория.ПутьКДанным);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	// Контроль заполнения характеристик
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ИерархияТоваровХарактеристика.Имя);
	
	ОтборПоИспользованиюХарактеристик = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборПоИспользованиюХарактеристик.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(
		Элементы.ИерархияТоваровХарактеристикиИспользуются.ПутьКДанным);
	ОтборПоИспользованиюХарактеристик.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборПоИспользованиюХарактеристик.ПравоеЗначение = Ложь;
	
	ОтборПоПринадлежностиКатегории = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборПоПринадлежностиКатегории.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(
		Элементы.ИерархияТоваровЭтоКатегория.ПутьКДанным);
	ОтборПоПринадлежностиКатегории.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборПоПринадлежностиКатегории.ПравоеЗначение = Ложь;
	
	ОтборПоПринадлежностиКатегории = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборПоПринадлежностиКатегории.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(
		Элементы.ИерархияТоваровНомерИзображения.ПутьКДанным);
	ОтборПоПринадлежностиКатегории.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборПоПринадлежностиКатегории.ПравоеЗначение = 5;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<характеристики не используются>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПоясняющийТекст);
	
	// Незаполненное изображение
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ИерархияТоваровИзображениеЭлемента.Имя);
	
	ОтборПоПустомуФайлуИзображения = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборПоПустомуФайлуИзображения.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(
		Элементы.ИерархияТоваровИзображениеЭлемента.ПутьКДанным);
	ОтборПоПустомуФайлуИзображения.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЗначениеСтрокой = "Справочник.ПалитраТоваровРМКПрисоединенныеФайлы.ПустаяСсылка";
	ОтборПоПустомуФайлуИзображения.ПравоеЗначение = ОбщегоНазначения.ПредопределенныйЭлемент(ЗначениеСтрокой);
	
	ОтборПоПринадлежностиКатегории = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборПоПринадлежностиКатегории.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(
		Элементы.ИерархияТоваровНомерИзображения.ПутьКДанным);
	ОтборПоПринадлежностиКатегории.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
	ОтборПоПринадлежностиКатегории.ПравоеЗначение = НомераКартинок;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<Добавить изображение>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПоясняющийТекст);
	
КонецПроцедуры

Процедура ОбновитьСписокТоваров(Форма) Экспорт
	
	СтандартнаяОбработка = Истина;
	ОбщегоНазначенияРМКПереопределяемый.ОбновитьДинамическийСписокТоваров(Форма, СтандартнаяОбработка);
	Если СтандартнаяОбработка Тогда
		
		ПараметрыСписка = Форма.СписокТоваров.Параметры;
		Если Не ПараметрыСписка.Элементы.Найти("Дата") = Неопределено Тогда
			ПараметрыСписка.УстановитьЗначениеПараметра("Дата", ТекущаяДатаСеанса());
		КонецЕсли;
		
	КонецЕсли;
	Форма.Элементы.СписокТоваров.Обновить();
	Форма.Элементы.ДополнительныйСписокТоваров.Обновить();
	
КонецПроцедуры

Процедура СформироватьЭлементыПлиток(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	ДанныеКнопокПлиток = Форма.ДанныеКнопокПлиток;
	ОсновнаяГруппаЭлементов = Элементы.ПлиточныйИнтерфейс;
	КоличествоКнопокВРяду = Форма.КоличествоЭлементовВРяду;
	КоличествоРядов = Форма.КоличествоРядовНаСтранице;
	БазовыйШрифт = ПолучитьШрифтПлиткиПоУмолчанию(Форма);
	
	ИндексКнопки = 0;
	Для ИндексРяда = 1 По КоличествоРядов Цикл
		
		РядКнопок = ДобавитьРядКнопокПлиток(ОсновнаяГруппаЭлементов, ИндексРяда, Элементы);
		
		Для СчетчикКнопок = 1 По КоличествоКнопокВРяду Цикл
			ДобавитьКнопкуВРядПлиток(РядКнопок, ИндексКнопки, Форма, БазовыйШрифт);
			СтрокаКнопка = ДанныеКнопокПлиток.Добавить();
			ИндексКнопки = ИндексКнопки + 1;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ЗаполнитьПараметрыКартыЛояльности(ОписаниеКарты) Экспорт
	
	ПараметрыКарты = ИнтерфейсРМКСлужебныйКлиентСервер.ПараметрыКартыЛояльности();
	НомерКарты = ?(ЗначениеЗаполнено(ОписаниеКарты.Barcode), ОписаниеКарты.Barcode, ОписаниеКарты.MagneticCode);
	
	ПараметрыКарты.ИдентификаторКарты = ОписаниеКарты.CardGUID;
	ПараметрыКарты.КодКарты = НомерКарты;
	ПараметрыКарты.ФИО = ОписаниеКарты.ClientName;
	ПараметрыКарты.НомерТелефонаВладельцаКарты = ОписаниеКарты.Phone;
	ПараметрыКарты.АдресЭПВладельцаКарты = ОписаниеКарты.Email;
	ПараметрыКарты.ДатаРождения = XMLЗначение(Тип("Дата"), ОписаниеКарты.DateOfBirth);
	ПараметрыКарты.ЭтоКомпания = Не ОписаниеКарты.IsPerson;
	
	Если ОписаниеКарты.Свойство("SellCount") Тогда
		ПараметрыКарты.СуммаПродаж = Формат(ОписаниеКарты.SellCount,"ЧДЦ=2");
	КонецЕсли;
	
	Возврат ПараметрыКарты;
	
КонецФункции

// Включает или выключает отображение кнопки выбора у полей ввода, в зависимости от значения переменной
// Форма.СенсорныйЭкран на форме РМК
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма РМК
//
Процедура НастроитьИспользованиеКнопокВыбораПолей(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	УвеличитьШирину = Ложь;
	ПредыдущееЗначение = Элементы.ТекущийТоварКоличество.КнопкаВыбора;
	ПоказатьКнопкуВыбора = (Не Форма.СенсорныйЭкран);
	Если ПредыдущееЗначение И Не ПоказатьКнопкуВыбора Тогда
		УвеличитьШирину = Истина;
	КонецЕсли;
	
	НастроитьИспользованиеКнопкиВыбораПоля(Элементы, "ТекущийТоварЦенаИзКарточки", ПоказатьКнопкуВыбора, УвеличитьШирину);
	НастроитьИспользованиеКнопкиВыбораПоля(Элементы, "ТекущийТоварКоличество", ПоказатьКнопкуВыбора, УвеличитьШирину);
	НастроитьИспользованиеКнопкиВыбораПоля(Элементы, "СуммаОплаченоНал", ПоказатьКнопкуВыбора, УвеличитьШирину);
	НастроитьИспользованиеКнопкиВыбораПоля(Элементы, "СуммаОплаченоБН", ПоказатьКнопкуВыбора, УвеличитьШирину);
	НастроитьИспользованиеКнопкиВыбораПоля(Элементы, "СуммаОплаченоЮКасса", ПоказатьКнопкуВыбора, УвеличитьШирину);
	НастроитьИспользованиеКнопкиВыбораПоля(Элементы, "СуммаОплаченоСБП", ПоказатьКнопкуВыбора, УвеличитьШирину);
	НастроитьИспользованиеКнопкиВыбораПоля(Элементы, "СуммаОплаченоБонусами", ПоказатьКнопкуВыбора, УвеличитьШирину);
	НастроитьИспользованиеКнопкиВыбораПоля(Элементы, "РучнойШтрихкодДляПоиска", ПоказатьКнопкуВыбора, УвеличитьШирину);
	
КонецПроцедуры

Процедура СжатьПанельИтоговПоЧекам(Форма, ТребуетсяГоризонтальноеСжатиеВсегда) Экспорт
	Элементы = Форма.Элементы;
	Если НеобходимоСжиматьПанельИтогов(Форма, ТребуетсяГоризонтальноеСжатиеВсегда) Тогда
		Элементы.ПанельИтоговПоЧекам.Видимость = Ложь;
		Элементы.Переместить(Элементы.ГруппаСуммаИтогоПоЧеку, Элементы.СжатаяПанельИтогов);
		Если Форма.ВертикальнаяОриентация Тогда
			Элементы.Переместить(Элементы.ГруппаСдача, Элементы.ОтображениеСдачи);
			Элементы.СжатаяПанельСдача.ТекущаяСтраница = Элементы.ОтображениеСдачи;
		Иначе
			Элементы.Переместить(Элементы.ГруппаСдача, Элементы.СжатаяПанельИтогов);
		КонецЕсли;
		Элементы.СжатаяПанельИтогов.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ВосстановитьПанельИтоговПоЧекам(Форма) Экспорт
	Элементы = Форма.Элементы;
	Если Не Элементы.ПанельИтоговПоЧекам.Видимость Тогда
		Элементы.Переместить(Элементы.ГруппаСуммаИтогоПоЧеку, Элементы.ГруппаСводныеДанныеЧека);
		Элементы.Переместить(Элементы.ГруппаСдача, Элементы.ГруппаСводныеДанныеЧека);
		Элементы.СжатаяПанельИтогов.Видимость = Ложь;
		Элементы.ПанельИтоговПоЧекам.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура НастроитьЭлементыФормыПриСозданииНаСервере(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	МаскаПоляВводаТелефона = ИнтерфейсРМКСлужебныйКлиентСервер.МаскаВводаТелефона();
	Элементы.НоваяКартаТелефон.Маска = МаскаПоляВводаТелефона;
	Элементы.ОтправкаЧекаТелефон.Маска = МаскаПоляВводаТелефона;
	
	Если Форма.РежимКассыСамообслуживания Тогда
		ТекстВводаНомера = НСтр("ru = 'Введите номер'");
		ПодсказкаВвода = НСтр("ru = 'Телефон или карта'");
	Иначе
		ТекстВводаНомера = НСтр("ru = 'Введите'");
		ПодсказкаВвода = НСтр("ru = 'Тел., почта или карта'");
	КонецЕсли;
	Элементы.ДекорацияПоискКартыЗаголовок.Заголовок = ТекстВводаНомера;
	Элементы.СтрокаПоискаКарты.ПодсказкаВвода = ПодсказкаВвода;
	Элементы.СтрокаПовторныйПоискКарты.ПодсказкаВвода = ПодсказкаВвода;
	
	Элементы.ДекорацияВведитеДанныеОтправкаЧека.Видимость = Форма.РежимКассыСамообслуживания;
	Элементы.ГруппаОтправкаЧекаПочта.Видимость = Не Форма.РежимКассыСамообслуживания;
	
	НастроитьЭлементыРаботыСДисконтнымиКартами(Форма);
	
КонецПроцедуры

Процедура НастроитьЭлементыФормыПоТекущейНастройке(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	Элементы.Декорация8.Видимость = Форма.ВертикальнаяОриентация И Не Форма.РежимКассыСамообслуживания;
	Если Форма.ИспользоватьОплатуНаличными Тогда
		Элементы.Декорация36.Шрифт = ШрифтыСтиля.ШрифтОбычныйПолужирный18РМК;
	Иначе
		Элементы.Декорация36.Шрифт = ШрифтыСтиля.ШрифтОбычный12РМК;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьУсловноеОформлениеГорячихКлавиш(Форма) Экспорт
	
	УсловноеОформление = Форма.УсловноеОформление;
	Элементы = Форма.Элементы;
	
	// Шрифт раздела горячих клавиш
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеДереваГорячихКлавиш = Элемент.Поля.Элементы.Добавить();
	ПолеДереваГорячихКлавиш.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоГорячиеКлавишиДействие.Имя);
	
	ДобавитьОтборРазделаГорячихКлавиш(Элементы, Элемент);
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ШрифтОбычныйПолужирный12РМК);
	
	// Только просмотр колонок сочетания клавиш
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеДереваГорячихКлавиш = Элемент.Поля.Элементы.Добавить();
	ПолеДереваГорячихКлавиш.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоГорячиеКлавишиКлавиша.Имя);
	ПолеДереваГорячихКлавиш = Элемент.Поля.Элементы.Добавить();
	ПолеДереваГорячихКлавиш.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоГорячиеКлавишиАкселераторAlt.Имя);
	ПолеДереваГорячихКлавиш = Элемент.Поля.Элементы.Добавить();
	ПолеДереваГорячихКлавиш.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоГорячиеКлавишиАкселераторCtrl.Имя);
	ПолеДереваГорячихКлавиш = Элемент.Поля.Элементы.Добавить();
	ПолеДереваГорячихКлавиш.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоГорячиеКлавишиАкселераторShift.Имя);
	
	ДобавитьОтборРазделаГорячихКлавиш(Элементы, Элемент);
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	// Цвет фона дублей горячих клавиш
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеДереваГорячихКлавиш = Элемент.Поля.Элементы.Добавить();
	ПолеДереваГорячихКлавиш.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоГорячиеКлавиши.Имя);
	
	ДобавитьОтборНекорректныхКомбинацийГорячихКлавиш(Элемент, "Дубль");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Персиковый);
	
	// Цвет фона запрещенных горячих клавиш
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеДереваГорячихКлавиш = Элемент.Поля.Элементы.Добавить();
	ПолеДереваГорячихКлавиш.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоГорячиеКлавиши.Имя);
	
	ДобавитьОтборНекорректныхКомбинацийГорячихКлавиш(Элемент, "ЗапрещеннаяКомбинация");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Розовый);
	
	// Цвет фона дублей горячих клавиш купюр
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеДереваГорячихКлавиш = Элемент.Поля.Элементы.Добавить();
	ПолеДереваГорячихКлавиш.Поле = Новый ПолеКомпоновкиДанных(Элементы.НастройкаРМКВводНаличных.Имя);
	
	ДобавитьОтборНекорректныхКомбинацийГорячихКлавишКупюр(Элемент, "Дубль");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Персиковый);
	
	// Цвет фона запрещенных горячих клавиш купюр
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеДереваГорячихКлавиш = Элемент.Поля.Элементы.Добавить();
	ПолеДереваГорячихКлавиш.Поле = Новый ПолеКомпоновкиДанных(Элементы.НастройкаРМКВводНаличных.Имя);
	
	ДобавитьОтборНекорректныхКомбинацийГорячихКлавишКупюр(Элемент, "ЗапрещеннаяКомбинация");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Розовый);
	
КонецПроцедуры

Процедура УстановитьУсловноеОформлениеДереваОбластейФормыРМК(Форма) Экспорт
	
	УсловноеОформление = Форма.УсловноеОформление;
	Элементы = Форма.Элементы;
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеДереваОбластей = Элемент.Поля.Элементы.Добавить();
	ПолеДереваОбластей.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоОбластейФормыРМК.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоОбластейФормыРМК.ДоступностьГруппы");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Серебряный);
	
КонецПроцедуры

Функция ПолучитьУстройстваРаспознаванияЭлектронныхВесовДляПодключения(РабочееМесто) Экспорт
	
	УстройстваРаспознавания = Новый Массив;
	
	ЭлектронныеВесыРабочегоМеста
		= ОбщегоНазначенияРМК.ПолучитьПодключенноеОборудованиеПоТипу("ЭлектронныеВесы", РабочееМесто);
	УстройстваРаспознаванияРабочегоМеста
		= ОбщегоНазначенияРМК.ПолучитьПодключенноеОборудованиеПоТипу("УстройствоРаспознавания", РабочееМесто);
		
	ЗапросУстройств = Новый Запрос;
	ЗапросУстройств.Текст =
	"ВЫБРАТЬ
	|	КомплектацияПодключаемогоОборудования.ОсновноеОборудование КАК ЭлектронныеВесыСсылка,
	|	КомплектацияПодключаемогоОборудования.ДополнительноеОборудование КАК УстройствоРаспознаванияСсылка
	|ИЗ
	|	РегистрСведений.КомплектацияПодключаемогоОборудования КАК КомплектацияПодключаемогоОборудования
	|ГДЕ
	|	КомплектацияПодключаемогоОборудования.ОсновноеОборудование В(&ЭлектронныеВесы)
	|	И КомплектацияПодключаемогоОборудования.ДополнительноеОборудование В(&УстройстваРаспознавания)";
	ЗапросУстройств.УстановитьПараметр("ЭлектронныеВесы", ЭлектронныеВесыРабочегоМеста);
	ЗапросУстройств.УстановитьПараметр("УстройстваРаспознавания", УстройстваРаспознаванияРабочегоМеста);
	РезультатЗапроса = ЗапросУстройств.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаУстройств = РезультатЗапроса.Выбрать();
		Пока ВыборкаУстройств.Следующий() Цикл
			
			СтрокаКомплекта = Новый Структура();
			СтрокаКомплекта.Вставить("ЭлектронныеВесы", ВыборкаУстройств.ЭлектронныеВесыСсылка);
			СтрокаКомплекта.Вставить("УстройствоРаспознавания", ВыборкаУстройств.УстройствоРаспознаванияСсылка);
			СтрокаКомплекта.Вставить("ВесыОбработаны", Ложь);
			СтрокаКомплекта.Вставить("УстройствоРаспознаванияОбработано", Ложь);
			УстройстваРаспознавания.Добавить(СтрокаКомплекта);
			
		КонецЦикла;
	КонецЕсли;
	
	Возврат УстройстваРаспознавания;
	
КонецФункции

Процедура НастроитьЭлементыВесовогоТовараВПлитке(Форма) Экспорт
	
	ПараметрыИнтерфейсаПлитки = ИнтерфейсРМКСлужебныйКлиентСервер.ПараметрыПлиточногоИнтерфейса();
	Форма.ЕстьВесовойТоварВПлитке = ЕстьВесовойТоварВОпорныхДанных(Форма.ОпорныеДанные);
	Элементы = Форма.Элементы;
	СтандартнаяПлитка = ЗначениеЗаполнено(Форма.СтруктураПлиточногоИнтерфейсаПодбора);
	
	Элементы.ОтборВесовогоТовара.Ширина = ПараметрыИнтерфейсаПлитки.ШиринаКоманды;
	Элементы.ОтборВесовогоТовара.Высота = ПараметрыИнтерфейсаПлитки.ВысотаКоманды;
	Если Форма.РежимКассыСамообслуживания Тогда
		Элементы.ОтборВесовогоТовараКСО.Видимость = СтандартнаяПлитка И Форма.ЕстьВесовойТоварВПлитке;;
	Иначе
		Элементы.ОтборВесовогоТовара.Видимость = СтандартнаяПлитка И Форма.ЕстьВесовойТоварВПлитке;
	КонецЕсли;
	
	Если Форма.ЕстьВесовойТоварВПлитке Тогда
		ДобавитьСлужебныеГруппыВесовогоТовараВОпорныеДанные(Форма);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьАнализИРегистрациюАварийногоЗавершенияЧеков(ПараметрыРМК) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтартовыеОперации = РегистрыСведений.ЖурналДействийКассира.ПолучитьОперацииДействийОткрытияЧека();
	ТекущийНомерСеанса = НомерСеансаИнформационнойБазы();
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаНеЗавершенныхДействийСЧеком();
	Запрос.УстановитьПараметр("НачальныеОперацииСЧеком", СтартовыеОперации);
	
	НачатьТранзакцию();
	Попытка
		
		БлокировкаЖурналаДействий = Новый БлокировкаДанных;
		ЭлементБлокировки = БлокировкаЖурналаДействий.Добавить("РегистрСведений.ЖурналДействийКассира");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаЖурналаДействий.Заблокировать();
		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			
			АктивныеСеансы = ПолучитьСеансыИнформационнойБазы();
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				РегистрироватьАварийноеЗавершение = Ложь;
				Если Выборка.НомерСеанса = ТекущийНомерСеанса Тогда
					РегистрироватьАварийноеЗавершение = ПараметрыРМК.ЗапускПриСтарте;
				Иначе
					Активныйсеанс = НайтиАктивныйСеансПоНомеру(АктивныеСеансы, Выборка.НомерСеанса);
					Если Активныйсеанс = Неопределено Тогда
						РегистрироватьАварийноеЗавершение = Истина;
					КонецЕсли;
				КонецЕсли;
				Если РегистрироватьАварийноеЗавершение Тогда
					ЗарегистрироватьАварийноеЗавершениеЧека(Выборка);
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Не удалось зарегистрировать аварийные завершения чеков.'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.РегистрыСведений.ЖурналДействийКассира, ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

Процедура УстановитьУсловноеОформлениеЖурналаДействийКассира(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	УсловноеОформление = Форма.УсловноеОформление;
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеСписок = Элемент.Поля.Элементы.Добавить();
	ПолеСписок.Поле = Новый ПолеКомпоновкиДанных(Элементы.Список.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.ОперацияСЧеком");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ОперацииРабочегоМестаКассира.АварийноеЗавершениеЧека;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОсобогоТекста);
	
КонецПроцедуры

Функция ПолучитьПервоначальноеРасположениеОбластейФормыРМК(ГруппаФормыРМК, ПараметрыЗаполнения) Экспорт
	
	МассивТиповЦвет = Новый Массив;
	МассивТиповЦвет.Добавить(Тип("Цвет"));
	ТипЧислоРазмер = ОбщегоНазначения.ОписаниеТипаЧисло(3, 0, ДопустимыйЗнак.Неотрицательный);
	
	МассивТиповГруппировка = Новый Массив;
	МассивТиповГруппировка.Добавить(Тип("ГруппировкаПодчиненныхЭлементовФормы"));
	
	ДеревоПорядкаОбластей = Новый ДеревоЗначений;
	ДеревоПорядкаОбластей.Колонки.Добавить("ИмяОбласти", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ДеревоПорядкаОбластей.Колонки.Добавить("ЗаголовокОбласти", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ДеревоПорядкаОбластей.Колонки.Добавить("Группировка", ОбщегоНазначения.ОписаниеТипаСтрока(15));
	ДеревоПорядкаОбластей.Колонки.Добавить("Ширина", ТипЧислоРазмер);
	ДеревоПорядкаОбластей.Колонки.Добавить("Высота", ТипЧислоРазмер);
	ДеревоПорядкаОбластей.Колонки.Добавить("ЦветОбласти", Новый ОписаниеТипов(МассивТиповЦвет));
	ДеревоПорядкаОбластей.Колонки.Добавить("ДоступностьГруппы", Новый ОписаниеТипов("Булево"));
	
	ЗаполнитьПервоначальныйПорядокОбластейФормыРМК(ГруппаФормыРМК, ДеревоПорядкаОбластей, ПараметрыЗаполнения);
	
	Возврат ДеревоПорядкаОбластей;
	
КонецФункции

Процедура ПрименитьНастройкуПорядкаОбластей(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	
	ЗапросПорядка = Новый Запрос;
	ЗапросПорядка.Текст =
	"ВЫБРАТЬ
	|	НастройкиРабочегоМестаКассираПорядокОбластей.ОбластьРодитель КАК ОбластьРодитель,
	|	НастройкиРабочегоМестаКассираПорядокОбластей.Область КАК Область,
	|	НастройкиРабочегоМестаКассираПорядокОбластей.Порядок КАК Порядок
	|ИЗ
	|	Справочник.НастройкиРабочегоМестаКассира.ПорядокОбластей КАК НастройкиРабочегоМестаКассираПорядокОбластей
	|ГДЕ
	|	НастройкиРабочегоМестаКассираПорядокОбластей.ВертикальнаяОриентация = &ВертикальнаяОриентация
	|	И НастройкиРабочегоМестаКассираПорядокОбластей.Ссылка = &ТекущаяНастройка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОбластьРодитель,
	|	Порядок";
	ЗапросПорядка.УстановитьПараметр("ВертикальнаяОриентация", Форма.ВертикальнаяОриентация);
	ЗапросПорядка.УстановитьПараметр("ТекущаяНастройка", Форма.ТекущаяНастройкаРМК);
	
	СуфиксВертикальная = "_Вертикальная";
	СуфиксГоризонтальная = "_Горизонтальная";
	ТекущийСуфикс = ?(Форма.ВертикальнаяОриентация, СуфиксВертикальная, СуфиксГоризонтальная);

	ТаблицаПорядка = ЗапросПорядка.Выполнить().Выгрузить();
	Для Каждого СтрокаПорядка Из ТаблицаПорядка Цикл
		
		ПозицияСуфикса = СтрНайти(СтрокаПорядка.Область, ТекущийСуфикс);
		Если ПозицияСуфикса > 0 Тогда
			ИмяГруппы = Лев(СтрокаПорядка.Область, ПозицияСуфикса - 1);
			ГруппаЭлемент = Элементы.Найти(ИмяГруппы);
			КоллекцияЭлементов = ГруппаЭлемент.Родитель.ПодчиненныеЭлементы;
			ИндексЭлемента = КоллекцияЭлементов.Индекс(ГруппаЭлемент);
			Если СтрокаПорядка.Порядок <> ИндексЭлемента + 1 Тогда
				ЭлементДляСмещения = КоллекцияЭлементов.Получить(СтрокаПорядка.Порядок - 1);
				Элементы.Переместить(ГруппаЭлемент, ГруппаЭлемент.Родитель, ЭлементДляСмещения);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	ПрименитьИсключенияОбработкиПорядкаОбластей(Форма, ТаблицаПорядка);
	
КонецПроцедуры

// Получает массив вложенных палитр в переданных палитрах по всей глубине иерархии
//
// Параметры:
//  КорневыеПалитры - Массив из СправочникСсылка.ПалитраТоваровРМК
//
// Возвращаемое значение - Массив из СправочникСсылка.ПалитраТоваровРМК
//
Функция ПолучитьВложенныеПалитры(КорневыеПалитры) Экспорт
	
	РезльтатФункции = Новый Массив;
	
	СхемаВложенныхПалитр = Справочники.ПалитраТоваровРМК.ПолучитьМакет("МакетВложенныхПалитр");
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаВложенныхПалитр.НастройкиПоУмолчанию);

	ПараметрМассивПалитр = Новый ПараметрКомпоновкиДанных("МассивПалитр");
	МассивПалитр = Новый СписокЗначений;
	МассивПалитр.ЗагрузитьЗначения(КорневыеПалитры);
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(ПараметрМассивПалитр, МассивПалитр);
	ТекущиеНастройки = КомпоновщикНастроек.ПолучитьНастройки();
	ТипГенератораДляКоллекции = Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений");
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаВложенныхПалитр, ТекущиеНастройки, , , ТипГенератораДляКоллекции);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	ТаблицаВложенныхПалитр = Новый ТаблицаЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаВложенныхПалитр);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Для каждого СтрокаТаблицы Из ТаблицаВложенныхПалитр Цикл
		
		Если КорневыеПалитры.Найти(СтрокаТаблицы.ВложеннаяПалитра) = Неопределено
				И РезльтатФункции.Найти(СтрокаТаблицы.ВложеннаяПалитра) = Неопределено Тогда
				
			РезльтатФункции.Добавить(СтрокаТаблицы.ВложеннаяПалитра);
				
		КонецЕсли;
		
	КонецЦикла;
	Возврат РезльтатФункции;
	
КонецФункции

// Получает массив палитр, начиная с текущей и всех палитр - владельцев
//
// Параметры:
//  ИсходнаяПалитра - СправочникСсылка.ПалитраТоваровРМК,
//  ИсключитьИсходнуюПалитру - Булево - в возвращаемом массиве будет исключена исходная палитра
//
// Возвращаемое значение - Массив из СправочникСсылка.ПалитраТоваровРМК
//
Функция ПолучитьИерархиюРодителейПалитры(ИсходнаяПалитра, ИсключитьИсходнуюПалитру = Ложь) Экспорт
	
	РезльтатФункции = Новый Массив;
	
	СхемаРодительскихПалитр = Справочники.ПалитраТоваровРМК.ПолучитьМакет("МакетРодительскихПалитр");
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаРодительскихПалитр.НастройкиПоУмолчанию);

	ПараметрИсходнаяПалитра = Новый ПараметрКомпоновкиДанных("ИсходнаяПалитра");
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(ПараметрИсходнаяПалитра, ИсходнаяПалитра);
	ТекущиеНастройки = КомпоновщикНастроек.ПолучитьНастройки();
	ТипГенератораДляКоллекции = Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений");
	МакетКомпоновки
		= КомпоновщикМакета.Выполнить(СхемаРодительскихПалитр, ТекущиеНастройки, , , ТипГенератораДляКоллекции);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	ТаблицаРодительскихПалитр = Новый ТаблицаЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаРодительскихПалитр);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	РезльтатФункции = ТаблицаРодительскихПалитр.ВыгрузитьКолонку("ПалитраВладелец");
	Если Не ИсключитьИсходнуюПалитру Тогда
		РезльтатФункции.Вставить(0, ИсходнаяПалитра);
	КонецЕсли;
	
	Возврат РезльтатФункции;
	
КонецФункции

Процедура НастроитьКоличествоЭлементовПлитки(Форма) Экспорт
	
	ВертикальнаяОриентация = Ложь;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ВертикальнаяОриентация") тогда
		ВертикальнаяОриентация = Форма.ВертикальнаяОриентация;
	КонецЕсли;
	КоличествоЭлементовВРяду = 4 - ?(ВертикальнаяОриентация, 1, 0);
	КоличествоРядовНаСтранице = 3 + ?(ВертикальнаяОриентация, 1, 0);
	
	СтруктураРеквизитовФормы = Новый Структура;
	СтруктураРеквизитовФормы.Вставить("КоличествоЭлементовВРяду", КоличествоЭлементовВРяду);
	СтруктураРеквизитовФормы.Вставить("КоличествоРядовНаСтранице", КоличествоРядовНаСтранице);
	ЗаполнитьЗначенияСвойств(Форма, СтруктураРеквизитовФормы);
	
КонецПроцедуры

Функция ПодготовитьДанныеКонтроляПродаж(НаборТаблиц) Экспорт
	
	ДанныеКонтроляПродаж = ИнтерфейсРМКСлужебныйКлиентСервер.ШаблонКэшаКонтроляПродаж();
	ТаблицаКонтроляИСвойств = НаборТаблиц.ТаблицаКонтроляИСвойств;
	ТаблицаВидовКонтроляСПараметрами = НаборТаблиц.ТаблицаВидовКонтроляСПараметрами;
	ТаблицаКонтроляИНоменклатуры = НаборТаблиц.ТаблицаКонтроляИНоменклатуры;
	ТаблицаСтрокКонтроля = НаборТаблиц.ТаблицаСтрокКонтроля;
	
	Для Каждого СтрокаКонтроляНоменклатуры Из ТаблицаКонтроляИНоменклатуры Цикл
		ТекущийКонтроль = СтрокаКонтроляНоменклатуры.КонтрольПродаж;
		КонтрольДобавлен = Ложь;
		Если ЗначениеЗаполнено(СтрокаКонтроляНоменклатуры.Номенклатура) Тогда
			КонтрольДобавлен = ДобавитьКонтрольНоменклатурыПриНеобходимости(ДанныеКонтроляПродаж.НоменклатураКонтроляПродаж, 
				СтрокаКонтроляНоменклатуры);
		Иначе
			Если ДанныеКонтроляПродаж.ОбщийКонтрольПродаж.Найти(ТекущийКонтроль) = Неопределено Тогда
				ДанныеКонтроляПродаж.ОбщийКонтрольПродаж.Добавить(ТекущийКонтроль);
				КонтрольДобавлен = Истина;
			КонецЕсли;
		КонецЕсли;
		Если КонтрольДобавлен Тогда
			СтрокаЭлементаКонтроля
				= ПолучитьСтрокуЭлементаКонтроляПродаж(ДанныеКонтроляПродаж.ЭлементыКонтроляПродаж, ТекущийКонтроль);
				
			Если СтрокаЭлементаКонтроля = Неопределено Тогда
				ДобавитьЭлементКонтроляПродажВДанныеКонтроля(НаборТаблиц, ДанныеКонтроляПродаж, ТекущийКонтроль);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат ДанныеКонтроляПродаж;
	
КонецФункции

Функция ПолучитьРеквизитыОбработкиРабочееМестоКассира() Экспорт
	
	РезультатФункции = Новый Массив;
	КоллекцияРеквизитов = Метаданные.Обработки.РабочееМестоКассира.Реквизиты;
	Для Каждого РеквизитОбработки Из КоллекцияРеквизитов Цикл
		РезультатФункции.Добавить(РеквизитОбработки.Имя);
	КонецЦикла;
	Возврат РезультатФункции;
	
КонецФункции

Процедура ПреобразоватьМассивыСтруктурДанныхЧекаВТаблицы(РеквизитыФормы) Экспорт
	
	ИмяТаблицыОплата = "Оплата";
	ИмяТаблицыТовары = "Товары";
	
	СтруктураИсточник = Неопределено;
	Для Каждого ОписаниеТаблицы Из РеквизитыФормы.КолонкиТаблицФормы Цикл
		ТаблицаПриемник = Новый ТаблицаЗначений;
		Для Каждого КолонкаТаблицы Из ОписаниеТаблицы.Значение Цикл
			ТаблицаПриемник.Колонки.Добавить(КолонкаТаблицы.Имя, КолонкаТаблицы.Тип);
		КонецЦикла;
		Если ОписаниеТаблицы.Ключ = ИмяТаблицыОплата Или ОписаниеТаблицы.Ключ = ИмяТаблицыТовары Тогда
			СтруктураИсточник = РеквизитыФормы.Объект[ОписаниеТаблицы.Ключ];
		Иначе
			СтруктураИсточник = РеквизитыФормы[ОписаниеТаблицы.Ключ];
		КонецЕсли;
		Для Каждого ДанныеСтроки Из СтруктураИсточник Цикл
			НоваяСтрока = ТаблицаПриемник.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеСтроки);
		КонецЦикла;
		Если ОписаниеТаблицы.Ключ = ИмяТаблицыОплата Или ОписаниеТаблицы.Ключ = ИмяТаблицыТовары Тогда
			РеквизитыФормы.Объект.Вставить(ОписаниеТаблицы.Ключ, ТаблицаПриемник);
		Иначе
			РеквизитыФормы.Вставить(ОписаниеТаблицы.Ключ, ТаблицаПриемник);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПреобразоватьТаблицыЧекаВСтруктурыДанных(РеквизитыФормы) Экспорт
	
	ИмяТаблицыОплата = "Оплата";
	ИмяТаблицыТовары = "Товары";
	
	ТаблицаИсточник = Неопределено;
	Для Каждого ОписаниеТаблицы Из РеквизитыФормы.КолонкиТаблицФормы Цикл
		Если ОписаниеТаблицы.Ключ = ИмяТаблицыОплата Или ОписаниеТаблицы.Ключ = ИмяТаблицыТовары Тогда
			ТаблицаИсточник = РеквизитыФормы.Объект[ОписаниеТаблицы.Ключ];
		Иначе
			ТаблицаИсточник = РеквизитыФормы[ОписаниеТаблицы.Ключ];
		КонецЕсли;
		СтруктураПриемник = Новый Массив;
		Для Каждого СтрокаТаблицыИсточника Из ТаблицаИсточник Цикл
			ДанныеСтроки = Новый Структура();
			Для Каждого КолонкаТаблицы Из ОписаниеТаблицы.Значение Цикл
				ДанныеСтроки.Вставить(КолонкаТаблицы.Имя, СтрокаТаблицыИсточника[КолонкаТаблицы.Имя]);
			КонецЦикла;
			СтруктураПриемник.Добавить(ДанныеСтроки);
		КонецЦикла;
		Если ОписаниеТаблицы.Ключ = ИмяТаблицыОплата Или ОписаниеТаблицы.Ключ = ИмяТаблицыТовары Тогда
			РеквизитыФормы.Объект.Вставить(ОписаниеТаблицы.Ключ, СтруктураПриемник);
		Иначе
			РеквизитыФормы.Вставить(ОписаниеТаблицы.Ключ, СтруктураПриемник);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьЭлементКонтроляПродажВДанныеКонтроля(НаборТаблиц, ДанныеКонтроляПродаж, КонтрольПродаж)

	ТаблицаКонтроляИСвойств = НаборТаблиц.ТаблицаКонтроляИСвойств;
	ТаблицаВидовКонтроляСПараметрами = НаборТаблиц.ТаблицаВидовКонтроляСПараметрами;
	ТаблицаСтрокКонтроля = НаборТаблиц.ТаблицаСтрокКонтроля;
	
	ОтборСтрокКонтроля = Новый Структура("КонтрольПродаж", КонтрольПродаж);
	СтрокаТаблицыКонтроляИСвойств = ТаблицаКонтроляИСвойств.Найти(КонтрольПродаж, "КонтрольПродаж");
	СтрокиКонтроляИзТаблицы = ТаблицаСтрокКонтроля.НайтиСтроки(ОтборСтрокКонтроля);
	Если СтрокиКонтроляИзТаблицы.Количество() > 0 И Не СтрокаТаблицыКонтроляИСвойств = Неопределено Тогда
		
		СтрокаЭлементаКонтроля = ИнтерфейсРМКСлужебныйКлиентСервер.ШаблонЭлементаКонтроляПродаж();
		СтрокаЭлементаКонтроля.КонтрольПродаж = КонтрольПродаж;
		СтрокаЭлементаКонтроля.НаименованиеГруппыТоваров = СтрокаТаблицыКонтроляИСвойств.НаименованиеГруппыТоваров;
		Для Каждого СтрокаКонтроляТаблицы Из СтрокиКонтроляИзТаблицы Цикл
			СтрокаКонтроляПродаж = ИнтерфейсРМКСлужебныйКлиентСервер.ШаблонСтрокиКонтроляПродаж();
			ЗаполнитьЗначенияСвойств(СтрокаКонтроляПродаж, СтрокаКонтроляТаблицы);
			
			СтрокаВидаКонтроля = ПолучитьСтрокуВидаКонтроля(ДанныеКонтроляПродаж.СтрокиВидовКонтроля,
				СтрокаКонтроляТаблицы.ВидКонтроля);
			Если СтрокаВидаКонтроля = Неопределено Тогда
				ДобавитьСтрокуВидаКонтроляВДанныеКонтроля(ТаблицаВидовКонтроляСПараметрами,
					ДанныеКонтроляПродаж.СтрокиВидовКонтроля, СтрокаКонтроляТаблицы.ВидКонтроля);
			КонецЕсли;
			
			СтрокаЭлементаКонтроля.СтрокиКонтроля.Добавить(СтрокаКонтроляПродаж);
		КонецЦикла;
		ДанныеКонтроляПродаж.ЭлементыКонтроляПродаж.Добавить(СтрокаЭлементаКонтроля);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьСтрокуВидаКонтроляВДанныеКонтроля(ТаблицаВидовКонтроляСПараметрами, СтрокиВидовКонтроля, ВидКонтроля)
	
	СтрокаВидаКонтроляИзТаблицы = ТаблицаВидовКонтроляСПараметрами.Найти(ВидКонтроля, "ВидКонтроля");
	Если Не СтрокаВидаКонтроляИзТаблицы = Неопределено Тогда
		СтрокаВидаКонтроля = ИнтерфейсРМКСлужебныйКлиентСервер.ШаблонСтрокиВидаКонтроляПродаж();
		ЗаполнитьЗначенияСвойств(СтрокаВидаКонтроля, СтрокаВидаКонтроляИзТаблицы, , "ПараметрыКонтроля"); 
		Для Каждого ПараметрВидаКонтроля Из СтрокаВидаКонтроляИзТаблицы.ПараметрыКонтроля Цикл
			СтрокаПараметра = ИнтерфейсРМКСлужебныйКлиентСервер.ШаблонСтрокиПараметровВидаКонтроля();
			СтрокаПараметра.Параметр = ПараметрВидаКонтроля.Параметр;
			СтрокаПараметра.Значение = ПараметрВидаКонтроля.Значение;
			СтрокаВидаКонтроля.ПараметрыКонтроля.Добавить(СтрокаПараметра);
		КонецЦикла;
		СтрокиВидовКонтроля.Добавить(СтрокаВидаКонтроля);
	КонецЕсли;
	
КонецПроцедуры

Функция ДобавитьКонтрольНоменклатурыПриНеобходимости(НоменклатураКонтроляПродаж, СтрокаКонтроляНоменклатуры)
	
	КонтрольДобавлен = Ложь;
	СтрокаНоменклатурыСКонтролем
		= ПолучитьСтрокуНоменклатурыСКонтролем(НоменклатураКонтроляПродаж, СтрокаКонтроляНоменклатуры);
	Если СтрокаНоменклатурыСКонтролем = Неопределено Тогда
		СтрокаНоменклатурыСКонтролем = ИнтерфейсРМКСлужебныйКлиентСервер.ШаблонСтрокиНоменклатурыКонтроляПродаж();
		СтрокаНоменклатурыСКонтролем.Номенклатура = СтрокаКонтроляНоменклатуры.Номенклатура;
		СтрокаНоменклатурыСКонтролем.Характеристика = СтрокаКонтроляНоменклатуры.Характеристика;
		НоменклатураКонтроляПродаж.Добавить(СтрокаНоменклатурыСКонтролем);
	КонецЕсли;
	Если СтрокаНоменклатурыСКонтролем.МассивКонтролейПродаж.Найти(СтрокаКонтроляНоменклатуры.КонтрольПродаж)
			= Неопределено Тогда
			
		СтрокаНоменклатурыСКонтролем.МассивКонтролейПродаж.Добавить(СтрокаКонтроляНоменклатуры.КонтрольПродаж);
		КонтрольДобавлен = Истина;
		
	КонецЕсли;
	
	Возврат КонтрольДобавлен;
	
КонецФункции

Функция ПолучитьСтрокуВидаКонтроля(СтрокиВидовКонтроля, ВидКонтроля)
	
	РезультатФункции = Неопределено;
	КоличествоСтрок = СтрокиВидовКонтроля.Количество();
	ИндексСтроки = 0;
	Пока ИндексСтроки < КоличествоСтрок И РезультатФункции = Неопределено Цикл
		СтрокаВидаКонтроля = СтрокиВидовКонтроля.Получить(ИндексСтроки);
		Если СтрокаВидаКонтроля.ВидКонтроля = ВидКонтроля Тогда
			РезультатФункции = СтрокаВидаКонтроля;
		КонецЕсли;
		ИндексСтроки = ИндексСтроки + 1;
	КонецЦикла;
	Возврат РезультатФункции;
	
КонецФункции

Функция ПолучитьСтрокуЭлементаКонтроляПродаж(ЭлементыКонтроляПродаж, КонтрольПродаж)
	
	РезультатФункции = Неопределено;
	КоличествоСтрок = ЭлементыКонтроляПродаж.Количество();
	ИндексСтроки = 0;
	Пока ИндексСтроки < КоличествоСтрок И РезультатФункции = Неопределено Цикл
		СтрокаЭлементаКонтроля = ЭлементыКонтроляПродаж.Получить(ИндексСтроки);
		Если СтрокаЭлементаКонтроля.КонтрольПродаж = КонтрольПродаж Тогда
			РезультатФункции = СтрокаЭлементаКонтроля;
		КонецЕсли;
		ИндексСтроки = ИндексСтроки + 1;
	КонецЦикла;
	Возврат РезультатФункции;
	
КонецФункции

Функция ПолучитьСтрокуНоменклатурыСКонтролем(НоменклатураКонтроляПродаж, СтрокаКонтроляНоменклатуры)
	
	РезультатФункции = Неопределено;
	КоличествоСтрок = НоменклатураКонтроляПродаж.Количество();
	ИндексСтроки = 0;
	Пока ИндексСтроки < КоличествоСтрок И РезультатФункции = Неопределено Цикл
		СтрокаНоменклатуры = НоменклатураКонтроляПродаж.Получить(ИндексСтроки);
		Если СтрокаНоменклатуры.Номенклатура = СтрокаКонтроляНоменклатуры.Номенклатура
				И СтрокаНоменклатуры.Характеристика = СтрокаКонтроляНоменклатуры.Характеристика Тогда
				
			РезультатФункции = СтрокаНоменклатуры;
				
		КонецЕсли;
		
		ИндексСтроки = ИндексСтроки + 1;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура ЗаполнитьПервоначальныйПорядокОбластейФормыРМК(ГруппаФормыРМК, ДеревоПорядкаОбластей, ПараметрыЗаполнения)
	
	Для Каждого ОбластьФормы Из ГруппаФормыРМК.ПодчиненныеЭлементы Цикл
		
		ОбработатьОбластьФормы(ДеревоПорядкаОбластей.Строки, ОбластьФормы, ПараметрыЗаполнения);
		
	КонецЦикла;
	
КонецПроцедуры

Функция СинонимГруппыПлиточногоИнтерфейса()
	
	Возврат НСтр("ru = 'Панель плиток'")
	
КонецФункции

Функция ЭтоГруппаПлиточногоИнтерфейса(ИмяОбласти, ПараметрыЗаполнения)
	
	МассивГруппПлитки = Новый Массив;
	МассивГруппПлитки.Добавить("ГруппаЛевоОболочкаПорядка_Горизонтальная");
	МассивГруппПлитки.Добавить("ГруппаПанельИнформацииВер_Вертикальная");
	
	Возврат (ПараметрыЗаполнения.ПлиточныйИнтерфейс И Не МассивГруппПлитки.Найти(ИмяОбласти) = Неопределено);
	
КонецФункции

Процедура ОбработатьОбластьФормы(УровеньПорядкаОбластей, ТекущаяОбласть, ПараметрыЗаполнения)
	
	НачалоУдаленногоЭлемента = "ххх";
	Если СтрНайти(ТекущаяОбласть.Имя, НачалоУдаленногоЭлемента) <> 1 Тогда
	
		ТипГоризонтальная = "Горизонтальная";
		ТипВертикальная = "Вертикальная";
		
		ТипГруппировки = ?(ТекущаяОбласть.Группировка
			= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная, ТипВертикальная, ТипГоризонтальная);
		
		НоваяСтрокаОбласти = УровеньПорядкаОбластей.Добавить();
		НоваяСтрокаОбласти.ИмяОбласти = ТекущаяОбласть.Имя;
		НоваяСтрокаОбласти.ЗаголовокОбласти = ТекущаяОбласть.Заголовок;
		НоваяСтрокаОбласти.Группировка = ТипГруппировки;
		НоваяСтрокаОбласти.Ширина = ТекущаяОбласть.Ширина;
		НоваяСтрокаОбласти.Высота = ТекущаяОбласть.Высота;
		НоваяСтрокаОбласти.ЦветОбласти = ТекущаяОбласть.ЦветФона;
		НоваяСтрокаОбласти.ДоступностьГруппы = ОпределитьДоступностьОбластиФормы(ТекущаяОбласть.Имя, ПараметрыЗаполнения);
		
		Если ЭтоГруппаПлиточногоИнтерфейса(ТекущаяОбласть.Имя, ПараметрыЗаполнения) Тогда
			НоваяСтрокаОбласти.ЗаголовокОбласти = СинонимГруппыПлиточногоИнтерфейса();
		Иначе
			Для Каждого ПодчиненнаяОбласть Из ТекущаяОбласть.ПодчиненныеЭлементы Цикл
				ОбработатьОбластьФормы(НоваяСтрокаОбласти.Строки, ПодчиненнаяОбласть, ПараметрыЗаполнения);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ОпределитьДоступностьОбластиФормы(ИмяОбласти, ПараметрыЗаполнения)
	
	НачалоИмениПанелиИзбранных = "ПанельИзбранныхТоваров_";
	НачалоИмениПанелиВводаНаличных = "ПанельВводаНаличных_";
	
	РезультатФункции = Истина;
	Если СтрНайти(ИмяОбласти, НачалоИмениПанелиИзбранных) = 1 Тогда
		РезультатФункции = ПараметрыЗаполнения.ПанельИзбранных;
	ИначеЕсли СтрНайти(ИмяОбласти, НачалоИмениПанелиВводаНаличных) = 1 Тогда
		РезультатФункции = ПараметрыЗаполнения.ПокупюрныйВводНаличных;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура ЗарегистрироватьАварийноеЗавершениеЧека(СтрокаВыборки)
	
	ПараметрыОперации = Новый Структура();
	
	ПараметрыОперации.Вставить("РабочееМесто", СтрокаВыборки.РабочееМесто);
	ПараметрыОперации.Вставить("ТорговыйОбъект", СтрокаВыборки.ТорговыйОбъект);
	ПараметрыОперации.Вставить("Кассир", СтрокаВыборки.Кассир);
	ПараметрыОперации.Вставить("ПользовательБД", СтрокаВыборки.Пользователь);
	ПараметрыОперации.Вставить("РегистрируемаяОперация",
		Перечисления.ОперацииРабочегоМестаКассира.АварийноеЗавершениеЧека);
	ПараметрыОперации.Вставить("НомерСеанса", СтрокаВыборки.НомерСеанса);
	ПараметрыОперации.Вставить("Чек", Неопределено);
	ПараметрыОперации.Вставить("Сумма", 0);
	
	РегистрыСведений.ЖурналДействийКассира.ЗарегистрироватьОперацию(ПараметрыОперации);
	
КонецПроцедуры

Функция НайтиАктивныйСеансПоНомеру(АктивныеСеансы, НомерСеанса)
	
	РезультатФункции = Неопределено;
	
	КоличествоСеансов = АктивныеСеансы.Количество();
	ИндексСеанса = 0;
	Пока ИндексСеанса < КоличествоСеансов И РезультатФункции = Неопределено Цикл
		ДанныеСеанса = АктивныеСеансы[ИндексСеанса];
		Если ДанныеСеанса.НомерСеанса = НомерСеанса Тогда
			РезультатФункции = ДанныеСеанса;
		КонецЕсли;
		ИндексСеанса = ИндексСеанса + 1;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ТекстЗапросаНеЗавершенныхДействийСЧеком()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЖурналДействийКассира.НомерСеанса КАК НомерСеанса,
	|	МАКСИМУМ(ЖурналДействийКассира.ДатаВремяОперации) КАК ДатаВремяОперации
	|ПОМЕСТИТЬ втПоследниеОперацииСеансов
	|ИЗ
	|	РегистрСведений.ЖурналДействийКассира КАК ЖурналДействийКассира
	|
	|СГРУППИРОВАТЬ ПО
	|	ЖурналДействийКассира.НомерСеанса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПоследниеОперацииСеансов.НомерСеанса КАК НомерСеанса,
	|	ЖурналДействийКассира.ОперацияСЧеком КАК ОперацияСЧеком,
	|	ЖурналДействийКассира.РабочееМесто КАК РабочееМесто,
	|	ЖурналДействийКассира.ТорговыйОбъект КАК ТорговыйОбъект,
	|	ЖурналДействийКассира.Пользователь КАК Пользователь,
	|	ЖурналДействийКассира.Кассир КАК Кассир
	|ИЗ
	|	втПоследниеОперацииСеансов КАК втПоследниеОперацииСеансов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналДействийКассира КАК ЖурналДействийКассира
	|		ПО втПоследниеОперацииСеансов.НомерСеанса = ЖурналДействийКассира.НомерСеанса
	|			И втПоследниеОперацииСеансов.ДатаВремяОперации = ЖурналДействийКассира.ДатаВремяОперации
	|ГДЕ
	|	ЖурналДействийКассира.ОперацияСЧеком В(&НачальныеОперацииСЧеком)";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ЕстьВесовойТоварВОпорныхДанных(ОпорныеДанные)
	
	РезультатФункции = Ложь;
	
	КоличествоПозиций = ОпорныеДанные.Количество();
	ИндексПозиции = 0;
	Пока ИндексПозиции < КоличествоПозиций И Не РезультатФункции Цикл
		СтрокаОпорныхДанных = ОпорныеДанные.Получить(ИндексПозиции);
		Если СтрокаОпорныхДанных.Весовой Тогда
			РезультатФункции = Истина;
		КонецЕсли;
		ИндексПозиции = ИндексПозиции + 1;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура УстановитьУвеличенныйШрифтПолей(Элементы, ПараметрыУвеличенногоИнтерфейса)
	
	Шрифт = ПараметрыУвеличенногоИнтерфейса.Шрифт;
	
	Элементы.ДобавитьСертификат.Шрифт = ПараметрыУвеличенногоИнтерфейса.ШрифтСуммОплат;
	Элементы.УдалитьВсеСертификаты.Шрифт = ПараметрыУвеличенногоИнтерфейса.ШрифтСуммОплат;
	
	Элементы.ВводТовараПоСтроке.Шрифт = Шрифт;
	Элементы.ЗначениеСкидкиНаЧек.Шрифт = Шрифт;
	Элементы.ТекущийТоварЦенаИзКарточки.Шрифт = Шрифт;
	Элементы.ТекущийТоварКоличество.Шрифт = Шрифт;
	Элементы.ТекущийТоварСкидка.Шрифт = Шрифт;
	Элементы.ОплатаСертификатомНСПК.Шрифт = ПараметрыУвеличенногоИнтерфейса.ШрифтКнопкиВидаОплаты;
	Элементы.ДополнениеСтрокаПоиска.Шрифт = Шрифт;
	Элементы.ДополнениеДополнительнаяСтрокаПоиска.Шрифт = Шрифт;
	
	Элементы.КодДляЗаменыПрав.Шрифт = Шрифт;
	Элементы.ВыборСерии.Шрифт = Шрифт;
	Элементы.РучнойШтрихкодДляПоиска.Шрифт = Шрифт;
	Элементы.ВыборПартии.Шрифт = Шрифт;
	Элементы.СтрокаПоискаКарты.Шрифт = Шрифт;
	Элементы.СуммаКОплатеБонусами.Шрифт = Шрифт;
	Элементы.СтрокаПовторныйПоискКарты.Шрифт = Шрифт;
	Элементы.ОтправкаЧекаПочта.Шрифт = Шрифт;
	Элементы.ОтправкаЧекаТелефон.Шрифт = Шрифт;
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыГруппВерхнегоУровня(Элементы, ПараметрыЭлементов)
	
	ГоризонтальнаяГруппировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ВертикальнаяГруппировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;

	ОписаниеРасположения = ОписаниеРасположенияЭлемента(Элементы.ГруппаУправленияЧекомГор, Неопределено,
		Элементы.ГруппаУправленияЧекомВер, Неопределено);
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаСлоевПанелиУправления, ОписаниеРасположения);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Группировка",
		ВертикальнаяГруппировка, ГоризонтальнаяГруппировка);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Ложь, Неопределено);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ПанельУправленияЧеком);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Группировка",
		ВертикальнаяГруппировка, ГоризонтальнаяГруппировка);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Неопределено, Истина);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоВертикали", Истина, Неопределено);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 0, 24);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ГруппаВыемка);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Неопределено, Истина);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоВертикали", Неопределено, Ложь);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ГруппаВнесение);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Неопределено, Истина);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоВертикали", Неопределено, Ложь);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыГруппСлоев(Элементы, ПараметрыЭлементов)
	
	ОписаниеРасположения = ОписаниеРасположенияЭлемента(Элементы.КоманднаяПанельУправленияЧекомГор,
		Неопределено, Элементы.ПраваяКолонкаУправленияЧеком, Неопределено);
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаСлоевОсновнаяКоманднаяПанельУправленияЧеком, ОписаниеРасположения);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ГоризонтальноеПоложениеВГруппе",
		ГоризонтальноеПоложениеЭлемента.Авто, ГоризонтальноеПоложениеЭлемента.Лево);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоВертикали", Ложь, Истина);
	
	ОписаниеРасположения = ОписаниеРасположенияЭлемента(Элементы.КоманднаяПанельУправленияЧекомГор,
		Элементы.ГруппаСлоевОсновнаяКоманднаяПанельУправленияЧеком,
		Элементы.ЛеваяСредняяКолонкиУправленияЧеком, Неопределено);
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаСлоевДополнительнаяКоманднаяПанель, ОписаниеРасположения);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоВертикали", Ложь, Истина);
	
	ОписаниеРасположения = ОписаниеРасположенияЭлемента(Элементы.ВводИнформацииИтоговЧекаГор,
		Неопределено, Элементы.ДанныеИтоговЧекаВер, Неопределено);
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаЦифроваяПанель, ОписаниеРасположения);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ВертикальноеПоложениеВГруппе",
		ВертикальноеПоложениеЭлемента.Низ, ВертикальноеПоложениеЭлемента.Авто);

	ОписаниеРасположения = ОписаниеРасположенияЭлемента(Элементы.ВводИнформацииИтоговЧекаГор, Элементы.ГруппаЦифроваяПанель,
		Элементы.ЛеваяСредняяКолонкиУправленияЧеком, Элементы.ГруппаСлоевДополнительнаяКоманднаяПанель);
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаСлоевСлужебнаяИнформацияЧека, ОписаниеРасположения);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Группировка",
		ГруппировкаПодчиненныхЭлементовФормы.Вертикальная, ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно);
	
	ОписаниеРасположения = ОписаниеРасположенияЭлемента(Элементы.СводнаяПанельИтоговЧекаГор,
		Неопределено, Элементы.ДанныеИтоговЧекаВер, Элементы.ГруппаЦифроваяПанель);
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ПанельИтоговПоЧекам, ОписаниеРасположения);
		
	ОписаниеРасположения = ОписаниеРасположенияЭлемента(Элементы.СводнаяПанельИтоговЧекаГор,
		Элементы.ПанельИтоговПоЧекам, Элементы.ДанныеИтоговЧекаВер, Элементы.ПанельИтоговПоЧекам);
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.СжатаяПанельИтогов, ОписаниеРасположения);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ОбластьОперативногоУправленияЧеком);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Группировка",
		ГруппировкаПодчиненныхЭлементовФормы.Вертикальная, ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Неопределено, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаСлоевЛеваяВерхняяВспомогательнаяПанель);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ГоризонтальноеПоложениеПодчиненных",
		ГоризонтальноеПоложениеЭлемента.Авто, ГоризонтальноеПоложениеЭлемента.Лево);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 0, 26);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Неопределено, Ложь);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаДополнительноеУправлениеЧеком);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ГоризонтальноеПоложениеПодчиненных",
		ГоризонтальноеПоложениеЭлемента.Авто, ГоризонтальноеПоложениеЭлемента.Лево);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ГруппаПроверкаНСПК);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоВертикали", Неопределено, Истина);
	
	ОписаниеРасположения = ОписаниеРасположенияЭлемента(Элементы.ОбластьОперативногоУправленияЧеком,
		Элементы.ГруппаСлоевЛеваяВерхняяВспомогательнаяПанель, Элементы.ГруппаПанелейВидовОплатВер,
		Элементы.ГруппаДополнительнаяИнформацияПоЧеку);
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ПанельВидовОплат, ОписаниеРасположения);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 0, 27);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ГоризонтальноеПоложениеВГруппе",
		ГоризонтальноеПоложениеЭлемента.Авто, ГоризонтальноеПоложениеЭлемента.Право);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Неопределено, Ложь);
	
	ОписаниеРасположения = ОписаниеРасположенияЭлемента(Элементы.ГруппаДополнительнаяИнформацияПоЧеку,
		Элементы.ГруппаQRCode, Элементы.ГруппаДополнительноеУправлениеЧеком,
		Элементы.ДекорацияРасширительГруппыДопУправленияЧеком);
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаПромокоды, ОписаниеРасположения);
	//ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 0, 27);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ГоризонтальноеПоложениеВГруппе",
		ГоризонтальноеПоложениеЭлемента.Лево, ГоризонтальноеПоложениеЭлемента.Авто);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Неопределено, Ложь);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ГруппаВидовОплат);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Неопределено, Ложь);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаСводныеДанныеЧека);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Неопределено, Ложь);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыВспомогательныхЭлементов(Элементы, ПараметрыЭлементов)
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаДополнительнаяИнформацияПоЧеку);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ГоризонтальноеПоложениеПодчиненных",
		ГоризонтальноеПоложениеЭлемента.Центр, ГоризонтальноеПоложениеЭлемента.Авто);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Неопределено, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ДекорацияОплатаКартой);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "АвтоМаксимальнаяШирина", Истина, Ложь);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "МаксимальнаяШирина", 25, 26);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "МаксимальнаяВысота", 0, 26);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Неопределено, Истина);

КонецПроцедуры

Процедура ЗаполнитьПараметрыЭлементовПокупателя(Элементы, ПараметрыЭлементов)
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ГруппаДанныеПокупателя);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ГоризонтальноеПоложениеВГруппе",
		ГоризонтальноеПоложениеЭлемента.Центр, ГоризонтальноеПоложениеЭлемента.Лево);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Истина, Ложь);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ПанельДанныхПокупателя);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Группировка",
		ГруппировкаПодчиненныхЭлементовФормы.Вертикальная, ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 25, 0);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаДанныеПокупателяОсновнаяПанельВыбор);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Неопределено, Ложь);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаСлоевДанныеПокупателяОсновнаяОбласть);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ГоризонтальноеПоложениеВГруппе",
		ГоризонтальноеПоложениеЭлемента.Центр, ГоризонтальноеПоложениеЭлемента.Авто);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ГруппаПоискКарты);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Истина, Неопределено);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.СтрокаПоискаКарты);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Ложь, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ВыбратьКонтрагента);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 0, 2);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ВертикальноеПоложениеВГруппе",
		ВертикальноеПоложениеЭлемента.Авто, ВертикальноеПоложениеЭлемента.Низ);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Ложь, Истина);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ВыбратьКонтрагентаКартаНеНайдена);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 0, 2);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ВертикальноеПоложениеВГруппе",
		ВертикальноеПоложениеЭлемента.Авто, ВертикальноеПоложениеЭлемента.Низ);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Ложь, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.СтрокаПовторныйПоискКарты);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Ложь, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ОсновнаяГруппаКартаНайдена);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоВертикали", Ложь, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаПоискКартыДанныеКарты);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Ложь, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.НайденнаяКартаТелефон);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 21, 22);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Неопределено, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.НайденнаяКартаПочта);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 21, 22);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Неопределено, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.НайденнаяКартаФИО);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 21, 22);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.НайденнаяКартаДатаРождения);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 21, 22);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.НайденнаяКартаНомер);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 21, 22);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.НайденнаяКартаСуммаПродаж);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 21, 22);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаОтменаКартыЛояльности);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Отображение", ОтображениеОбычнойГруппы.Нет,
		ОтображениеОбычнойГруппы.ОбычноеВыделение);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Группировка",
		ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно,
		ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ВертикальноеПоложениеВГруппе",
		ВертикальноеПоложениеЭлемента.Авто, ВертикальноеПоложениеЭлемента.Низ);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ОтменитьВводКарты);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 24, 0);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 1, 2);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Ложь, Истина);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ОтправитьЧек);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 24, 23);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ГруппаОтправкаЧека);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Ложь, Истина);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоВертикали", Неопределено, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.Декорация8);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Видимость", Ложь, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ОтправкаЧекаПочта);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Ложь, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ОтправкаЧекаТелефон);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Ложь, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаСтраницыКнопкиОтправитьЧек);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ВертикальноеПоложениеВГруппе",
		ВертикальноеПоложениеЭлемента.Авто, ВертикальноеПоложениеЭлемента.Низ);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ОсновнаяГруппаСозданиеКарты);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Группировка",
		ГруппировкаПодчиненныхЭлементовФормы.Вертикальная, ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Ложь, Неопределено);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоВертикали", Ложь, Неопределено);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.НоваяКартаНомер);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Ложь, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.НоваяКартаТелефон);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Ложь, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.НоваяКартаФИО);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Ложь, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.НоваяКартаПочта);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Ложь, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.НоваяКартаДатаРождения);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ДекорацияПредупреждение);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 0, 2);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаКомандыСозданиеКарты);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ВертикальноеПоложениеПодчиненных",
		ВертикальноеПоложениеЭлемента.Центр, ВертикальноеПоложениеЭлемента.Низ);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоВертикали", Неопределено, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.СоздатьКарту);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 0, 2);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаСлоевДанныеПокупателяДополнительнаяОбласть);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Отображение", ОтображениеОбычнойГруппы.Нет,
		ОтображениеОбычнойГруппы.ОбычноеВыделение);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ГоризонтальноеПоложениеВГруппе",
		ГоризонтальноеПоложениеЭлемента.Центр, ГоризонтальноеПоложениеЭлемента.Авто);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ДополнительнаяГруппаКартаНайдена);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоВертикали", Неопределено, Истина);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Ложь, Неопределено);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ДополнительнаяГруппаКартаНайденаКонтейнер);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоВертикали", Неопределено, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ДекорацияИнформацияОБонусахОтступ);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Видимость", Ложь, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.КоличествоБонусов);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Неопределено, Истина);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ГруппаПодтверждениеСМС);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ВертикальноеПоложениеПодчиненных",
		ВертикальноеПоложениеЭлемента.Низ, ВертикальноеПоложениеЭлемента.Авто);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаВводКодаSMSОсновное);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоВертикали", Ложь, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ДекорацияТекстПодтвердитеКарту);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 0, 24);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 2, 1);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ГоризонтальноеПоложениеВГруппе",
		ГоризонтальноеПоложениеЭлемента.Лево, ГоризонтальноеПоложениеЭлемента.Центр);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ОтправитьSMSСКодомПроверки);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 0, 2);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ВертикальноеПоложениеВГруппе",
		ВертикальноеПоложениеЭлемента.Авто, ВертикальноеПоложениеЭлемента.Низ);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ОтменитьЗаведениеКарты);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ВертикальноеПоложениеВГруппе",
		ВертикальноеПоложениеЭлемента.Авто, ВертикальноеПоложениеЭлемента.Низ);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыЭлементовПокупателяДляПереходаКОплате(Элементы, ПараметрыЭлементов)
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.СуммаКОплатеБонусами);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Ложь, Истина);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыЭлементовМаркировки(Элементы, ПараметрыЭлементов)

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ДекорацияЛинияВыделенияДанныеПоМаркам);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Видимость", Истина, Ложь);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаВыполненияВозвратаБезМарки);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ГоризонтальноеПоложениеПодчиненных",
		ГоризонтальноеПоложениеЭлемента.Центр, ГоризонтальноеПоложениеЭлемента.Авто);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ВертикальноеПоложениеПодчиненных",
		ВертикальноеПоложениеЭлемента.Низ, ВертикальноеПоложениеЭлемента.Авто);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ГоризонтальноеПоложениеВГруппе",
		ГоризонтальноеПоложениеЭлемента.Центр, ГоризонтальноеПоложениеЭлемента.Лево);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ОтступГруппыВыполненияВозвратаБезМарки);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Видимость", Истина, Ложь);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ВернутьПозициюБезМарки);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ВертикальноеПоложениеВГруппе",
		ВертикальноеПоложениеЭлемента.Авто, ВертикальноеПоложениеЭлемента.Низ);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ДекорацияЛинияВыделенияДанныеПоМаркам1);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Видимость", Истина, Ложь);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаВыполненияВозвратаБезМаркиПослеОшибкиВводаМарки);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ГоризонтальноеПоложениеПодчиненных",
		ГоризонтальноеПоложениеЭлемента.Центр, ГоризонтальноеПоложениеЭлемента.Авто);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ВертикальноеПоложениеПодчиненных",
		ВертикальноеПоложениеЭлемента.Низ, ВертикальноеПоложениеЭлемента.Авто);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ГоризонтальноеПоложениеВГруппе",
		ГоризонтальноеПоложениеЭлемента.Центр, ГоризонтальноеПоложениеЭлемента.Лево);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоВертикали", Истина, Неопределено);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ОтступГруппыВыполненияВозвратаБезМаркиПослеОшибкиРазбораМарки);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Видимость", Истина, Ложь);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ВернутьПозициюБезМаркиПослеОшибкиРазбораМарки);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ВертикальноеПоложениеВГруппе",
		ВертикальноеПоложениеЭлемента.Авто, ВертикальноеПоложениеЭлемента.Низ);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыПанелиОшибок(Элементы, ПараметрыЭлементов)
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ГруппаИнфоОшибка);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Группировка",
		ГруппировкаПодчиненныхЭлементовФормы.Вертикальная, ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Истина, Неопределено);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ДекорацияЛинияПредупреждение);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Видимость", Истина, Ложь);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаИнфоОшибкиКонтейнер);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоВертикали", Неопределено, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаИнфоОшибкаВертикальныйКонтейнер);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Неопределено, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаВерхнийРядИнфоОшибка);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Группировка",
		ГруппировкаПодчиненныхЭлементовФормы.Вертикальная, ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Неопределено, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ГруппаИнфоОшибкаВерх);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Группировка",
		ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда, ГруппировкаПодчиненныхЭлементовФормы.Вертикальная);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.Декорация9);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Видимость", Истина, Ложь);
	
	ОписаниеРасположения = ОписаниеРасположенияЭлемента(Элементы.ГруппаИнфоОшибкаВертикальная,
		Элементы.ТекстПредупреждениеОшибка, Элементы.ГруппаИнфоОшибкаВерх, Неопределено);
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ТекстПредупреждениеЗаголовок, ОписаниеРасположения);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "АвтоМаксимальнаяШирина", Истина, Ложь);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 23, 50);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ВертикальноеПоложениеВГруппе",
		ВертикальноеПоложениеЭлемента.Авто, ВертикальноеПоложениеЭлемента.Центр);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Ложь, Неопределено);

	ОписаниеРасположения = ОписаниеРасположенияЭлемента(Элементы.ГруппаИнфоОшибкаВерх, Неопределено,
		Элементы.ГруппаВерхнийРядИнфоОшибка, Неопределено);
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ЗакрытьСтраницуИнфоОшибка, ОписаниеРасположения);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ГоризонтальноеПоложениеВГруппе",
		ГоризонтальноеПоложениеЭлемента.Авто, ГоризонтальноеПоложениеЭлемента.Право);

	ОписаниеРасположения = ОписаниеРасположенияЭлемента(Элементы.ГруппаИнфоОшибка, Неопределено,
		Элементы.ГруппаВерхнийРядИнфоОшибка, Неопределено);
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ДекорацияОтступСправа,
		ОписаниеРасположения);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Видимость", Ложь, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаНижнийРядИнфоОшибка);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Группировка",
		ГруппировкаПодчиненныхЭлементовФормы.Вертикальная, ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоВертикали", Истина, Неопределено);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаИнфоОшибкаГоризонтальная);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 25, 0);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Ложь, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.Декорация17);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Видимость", Истина, Ложь);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаИнфоОшибкаВертикальная);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Отображение", ОтображениеОбычнойГруппы.СлабоеВыделение,
		ОтображениеОбычнойГруппы.Нет);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Неопределено, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ТекстПредупреждениеОшибка);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "АвтоМаксимальнаяШирина", Истина, Ложь);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 23, 50);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 8, 0);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "МаксимальнаяВысота", 0, 8);
	
	ОписаниеРасположения = ОписаниеРасположенияЭлемента(Элементы.ГруппаНижнийРядИнфоОшибка, Неопределено,
		Элементы.ГруппаИнфоОшибкиКонтейнер, Неопределено);
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаИнфоОшибкаДействияСЧеком, ОписаниеРасположения);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Группировка",
		ГруппировкаПодчиненныхЭлементовФормы.Вертикальная, ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ГоризонтальноеПоложениеВГруппе",
		ГоризонтальноеПоложениеЭлемента.Авто, ГоризонтальноеПоложениеЭлемента.Лево);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ПовторитьОперациюПакетнойФискализации);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 0, 20);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 0, 2);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ВыполнитьОтменуОплаты);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 25, 20);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Ложь, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаИнфоОшибкаДействияСЧекомВерх);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Группировка",
		ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда, ГруппировкаПодчиненныхЭлементовФормы.Вертикальная);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаИнфоОшибкаДействияСЧекомНиз);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Группировка",
		ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда, ГруппировкаПодчиненныхЭлементовФормы.Вертикальная);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ОтложитьЧекИзОшибки);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 0, 2);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.УдалитьЧекИзОшибки);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 0, 2);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыЭлементовКонтроляМарки(Элементы, ПараметрыЭлементов)
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаПодтвержденияКонтрольнойМарки);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ГоризонтальноеПоложениеПодчиненных",
		ГоризонтальноеПоложениеЭлемента.Авто, ГоризонтальноеПоложениеЭлемента.Лево);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Неопределено, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.РазделительПодтвержденияПродажиКонтрольнойМарки);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Видимость", Истина, Ложь);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ПодтверждениеПродажиКонтрольнойМаркиПояснениеОтступ);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Видимость", Истина, Ложь);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ПодтверждениеПродажиБезПроверкиМарки);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоВертикали", Неопределено, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ПодтверждениеПродажиБезПроверкиМаркиМарка);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 3, 2);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ВертикальноеПоложениеВГруппе",
		ВертикальноеПоложениеЭлемента.Центр, ВертикальноеПоложениеЭлемента.Верх);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ПодтверждениеПродажиБезПроверкиМаркиТекст);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "АвтоМаксимальнаяВысота", Истина, Ложь);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ПодтверждениеПродажиБезПроверкиМаркиДействия);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ВертикальноеПоложениеПодчиненных",
		ВертикальноеПоложениеЭлемента.Центр, ВертикальноеПоложениеЭлемента.Низ);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ГоризонтальноеПоложениеВГруппе",
		ГоризонтальноеПоложениеЭлемента.Центр, ГоризонтальноеПоложениеЭлемента.Лево);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ВертикальноеПоложениеВГруппе",
		ВертикальноеПоложениеЭлемента.Центр, ВертикальноеПоложениеЭлемента.Низ);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоВертикали", Истина, Неопределено);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ПродолжитьДобавлениеТовараПослеПроверкиМарки);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 0, 2);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ПодтверждениеПродажиПодтверждениеНаККМНеПройденоРазделитель);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 2, 1);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 3, 2);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ОтказатьсяОтДобавленияТовараБезПроверкиМарки);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 0, 2);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыЭлементовСопоставленияТоваров(Элементы, ПараметрыЭлементов)
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаРучноеСопоставлениеТовара);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ГоризонтальноеПоложениеПодчиненных",
		ГоризонтальноеПоложениеЭлемента.Авто, ГоризонтальноеПоложениеЭлемента.Лево);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Неопределено, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ДекорацияЛинияВыделения);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Видимость", Истина, Ложь);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаГоризонтальнаяСопоставлениеТовара);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Неопределено, Ложь);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоВертикали", Истина, Неопределено);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ДекорацияВертикальная);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Видимость", Истина, Ложь);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ДекорацияТекстСопоставлениеТовара);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 23, 24);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 5, 3);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаОперацииСопоставлениеТовара);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ГоризонтальноеПоложениеПодчиненных",
		ГоризонтальноеПоложениеЭлемента.Авто, ГоризонтальноеПоложениеЭлемента.Лево);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ВертикальноеПоложениеПодчиненных",
		ВертикальноеПоложениеЭлемента.Авто, ВертикальноеПоложениеЭлемента.Низ);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Неопределено, Истина);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоВертикали", Неопределено, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.СопоставитьТовар);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 0, 2);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ОтменаСопоставленияТовара);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 0, 2);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыПанелиПодтверждения(Элементы, ПараметрыЭлементов)
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаИнфоПодтверждение);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ГоризонтальноеПоложениеПодчиненных",
		ГоризонтальноеПоложениеЭлемента.Авто, ГоризонтальноеПоложениеЭлемента.Лево);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Неопределено, Истина);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ДекорацияЛинияИнфоПодтверждение);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Видимость", Истина, Ложь);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ДекорацияКартинкаИнфоПодтверждение);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 3, 2);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаИнфоПодтверждениеКоманды);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ВертикальноеПоложениеПодчиненных",
		ВертикальноеПоложениеЭлемента.Авто, ВертикальноеПоложениеЭлемента.Низ);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоВертикали", Неопределено, Истина);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 0, 24);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Истина, Ложь);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ПодтвердитьОперациюСотрудником);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 0, 2);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ВертикальноеПоложениеВГруппе",
		ВертикальноеПоложениеЭлемента.Авто, ВертикальноеПоложениеЭлемента.Низ);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ОтменитьОперациюСотрудником);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 0, 2);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ВертикальноеПоложениеВГруппе",
		ВертикальноеПоложениеЭлемента.Авто, ВертикальноеПоложениеЭлемента.Низ);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыЭлементовСерийИПартий(Элементы, ПараметрыЭлементов)
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ГруппаСерииИПартии);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ГоризонтальноеПоложениеПодчиненных",
		ГоризонтальноеПоложениеЭлемента.Авто, ГоризонтальноеПоложениеЭлемента.Лево);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Неопределено, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ДекорацияЛинияПредупреждение5);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Видимость", Истина, Ложь);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаСерииГоризонтальная);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Неопределено, Ложь);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.Декорация21);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Видимость", Истина, Ложь);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаСерииВертикальная);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоВертикали", Неопределено, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаСерииДекорацияНоменклатура);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ГоризонтальноеПоложениеПодчиненных",
		ГоризонтальноеПоложениеЭлемента.Авто, ГоризонтальноеПоложениеЭлемента.Лево);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ВыборСерии);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Ложь, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ВыборПартии);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Ложь, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ГруппаСерииКоманды);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ВертикальноеПоложениеВГруппе",
		ВертикальноеПоложениеЭлемента.Авто, ВертикальноеПоложениеЭлемента.Низ);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ОтменаВыбораСерии);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Ложь, Истина);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыЭлементовЗаменыПрав(Элементы, ПараметрыЭлементов)

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ГруппаЗаменаПрав);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ГоризонтальноеПоложениеПодчиненных",
		ГоризонтальноеПоложениеЭлемента.Авто, ГоризонтальноеПоложениеЭлемента.Лево);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Неопределено, Истина);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.КомандыЗаменыПрав);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ВертикальноеПоложениеПодчиненных",
		ВертикальноеПоложениеЭлемента.Авто, ВертикальноеПоложениеЭлемента.Низ);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоВертикали", Неопределено, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ДекорацияЛинияПредупреждения);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Видимость", Истина, Ложь);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.Декорация12);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Видимость", Истина, Ложь);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.Группа6);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ГоризонтальноеПоложениеПодчиненных",
		ГоризонтальноеПоложениеЭлемента.Авто, ГоризонтальноеПоложениеЭлемента.Лево);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Неопределено, Ложь);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаЗаменаПравПолеИКоманда);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоВертикали", Неопределено, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ПодтвердитьПарольКассира);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 0, 2);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ВертикальноеПоложениеВГруппе",
		ВертикальноеПоложениеЭлемента.Авто, ВертикальноеПоложениеЭлемента.Низ);
		
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ОтменитьПарольКассира);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 0, 2);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ВертикальноеПоложениеВГруппе",
		ВертикальноеПоложениеЭлемента.Авто, ВертикальноеПоложениеЭлемента.Низ);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.Декорация13);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Видимость", Истина, Ложь);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаПравоУдалитьПоШтрихкоду);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Неопределено, Ложь);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ДекорацияЛиния);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Видимость", Истина, Ложь);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ДекорацияУдалитьПоШтрихкоду);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 3, 2);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ШтрихкодДляПоиска);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Ложь, Неопределено);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаПравоУдалитьПоШтрихкодуКоманды);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ВертикальноеПоложениеПодчиненных",
		ВертикальноеПоложениеЭлемента.Авто, ВертикальноеПоложениеЭлемента.Низ);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоВертикали", Неопределено, Истина);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ПодтвердитьНайтиВЧеке);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 0, 2);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ОтменаНайтиВЧеке);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 0, 2);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ДекорацияЛинияПоискПоШтрихкоду);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Видимость", Истина, Ложь);
		
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ДекорацияПоискПоШтрихкоду);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 3, 2);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.РучнойШтрихкодДляПоиска);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Ложь, Неопределено);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаНайтиПоШтрихкодуКоманды);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ВертикальноеПоложениеПодчиненных",
		ВертикальноеПоложениеЭлемента.Авто, ВертикальноеПоложениеЭлемента.Низ);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоВертикали", Неопределено, Истина);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ПодтвердитьНайтиПоШтрихкоду);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 0, 2);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ОтменаНайтиПоШтрихкоду);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 0, 2);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ДекорацияЛинияГруппаВвестиКомментарийКЧеку);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Видимость", Истина, Ложь);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.Декорация35);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Видимость", Истина, Ложь);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, 
		Элементы.ДекорацияЗаголовокЗаменаПрав);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 22, 32);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыЭлементовЭквайринга(Элементы, ПараметрыЭлементов)

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаВопросЭквайринговаяОперация);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Неопределено, Ложь);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ДекорацияЛинияПредупреждение1);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Видимость", Истина, Ложь);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ДекорацияНадписьЭквайрингУспешно);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Истина, Неопределено);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ГруппаОтветыДаНет);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Истина, Неопределено);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоВертикали", Неопределено, Истина);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаОтменаОплатыПоКарте);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Группировка",
		ГруппировкаПодчиненныхЭлементовФормы.Вертикальная, ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ДекорацияЛинияПредупреждение2);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Видимость", Истина, Ложь);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаКартинкаКнопкаОтменаОтплатыПоКарте);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Неопределено, Ложь);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ДекорацияКартинкаЭквайринговыйТерминал1);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 25, 14);
	
	ОписаниеРасположения = ОписаниеРасположенияЭлемента(Элементы.ГруппаОтменаОплатыПоКарте, Неопределено,
		Элементы.ГруппаКартинкаКнопкаОтменаОтплатыПоКарте, Неопределено);
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаОтменаПрошлаУспешно, ОписаниеРасположения);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ВертикальноеПоложениеПодчиненных",
		ВертикальноеПоложениеЭлемента.Авто, ВертикальноеПоложениеЭлемента.Низ);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ВертикальноеПоложениеВГруппе",
		ВертикальноеПоложениеЭлемента.Авто, ВертикальноеПоложениеЭлемента.Низ);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоВертикали", Неопределено, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ДекорацияНадписьЭквайрингОшибка);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 25, 27);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 9, 10);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ВертикальноеПоложениеВГруппе",
		ВертикальноеПоложениеЭлемента.Центр, ВертикальноеПоложениеЭлемента.Авто);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Истина, Неопределено);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаЭквайринговаяОперация);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Неопределено, Ложь);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ДекорацияЛинияПредупреждение3);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Видимость", Истина, Ложь);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ДекорацияЭквОперацияЗаголовок);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 2, 1);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ВысотаЗаголовка", 2, 0);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ДекорацияКартинкаЭквОперация);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ГоризонтальноеПоложениеВГруппе",
		ГоризонтальноеПоложениеЭлемента.Авто, ГоризонтальноеПоложениеЭлемента.Центр);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ДекорацияЭквОперацияОбменДанными);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Истина, Неопределено);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ДекорацияЭквОперацияДействие);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 2, 1);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ВысотаЗаголовка", 2, 0);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Неопределено, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ГруппаСторноЭквайринг);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Группировка",
		ГруппировкаПодчиненныхЭлементовФормы.Вертикальная, ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ДекорацияЛинияПредупреждение4);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Видимость", Истина, Ложь);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.Декорация18);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Видимость", Истина, Ложь);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаИнфоОшибкаВертикальная1);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоВертикали", Неопределено, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ЗаголовокСторноЭквайринг);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 23, 36);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 3, 2);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ТекстСторноЭквайринг);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 23, 36);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 9, 6);
	
	ОписаниеРасположения = ОписаниеРасположенияЭлемента(Элементы.ГруппаСторноЭквайринг, Неопределено,
		Элементы.ГруппаИнфоОшибкаВертикальная1, Неопределено);
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ВыполнитьСторноПоКарте, ОписаниеРасположения);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Истина, Ложь);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыЭлементовПлатежнойСистемы(Элементы, ПараметрыЭлементов)
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ГруппаПлатежнаяСистема);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Группировка",
		ГруппировкаПодчиненныхЭлементовФормы.Вертикальная, ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
	
	ОписаниеРасположения = ОписаниеРасположенияЭлемента(Элементы.ГруппаПлатежнаяСистема,
		Элементы.ГруппаСлоевРазделПлатежнаяСистема, Элементы.ГруппаПлатежнаяСистема, Неопределено);
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаЗаголовокПлатежнаяСистема, ОписаниеРасположения);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Неопределено, Истина);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.НадписьЗаголовок);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Видимость", Истина, Ложь);
	
	ОписаниеРасположения = ОписаниеРасположенияЭлемента(
		Элементы.ГруппаЗаголовокПлатежнаяСистема, Неопределено,
		Элементы.ГруппаЗаголовокПлатежнаяСистема, Элементы.ГруппаСБПДополнительнаяПанель);
		
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ЗакрытьГруппуПлатежнаяСистема, ОписаниеРасположения);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(
		ПараметрыЭлементов,
		Элементы.ГруппаСБПДополнительнаяПанель);
		
	ДобавитьИзменяемыеПараметрыЭлементаФормы(
		ДанныеЭлемента, "Группировка",
		ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда, ГруппировкаПодчиненныхЭлементовФормы.Вертикальная);
		
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(
		ПараметрыЭлементов,
		Элементы.ГруппаЗаголовокПлатежнаяСистема);
		
	ДобавитьИзменяемыеПараметрыЭлементаФормы(
		ДанныеЭлемента, "Группировка",
		ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда, ГруппировкаПодчиненныхЭлементовФормы.Вертикальная);
		
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(
		ПараметрыЭлементов,
		Элементы.ГруппаПанельДействий);
		
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 24, 50);
		
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(
		ПараметрыЭлементов,
		Элементы.ГруппаПодтверждениеОплаты);
		
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 24, 50);
		
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(
		ПараметрыЭлементов,
		Элементы.ГруппаВопросПредупреждение);
		
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 24, 50);
		
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(
		ПараметрыЭлементов,
		Элементы.ГруппаВопросОтложитьЧек);
		
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 24, 50);
		
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(
		ПараметрыЭлементов,
		Элементы.ГруппаВыборПлатежнойСистемы);
		
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 24, 50);
		
	ОписаниеРасположения = ОписаниеРасположенияЭлемента(
		Элементы.ГруппаПанельДействий, Элементы.ГруппаПлатежнаяСистемаКоманднаяПанель,
		Элементы.ГруппаПанельДействий, Элементы.ГруппаПлатежнаяСистемаКоманднаяПанель);
		
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаСлоевПанелиДействийПлатежнойСистемы, ОписаниеРасположения);

	ОписаниеРасположения = ОписаниеРасположенияЭлемента(
		Элементы.ГруппаQRКод, Элементы.ГруппаПояснениеКQRКоду,
		Элементы.ГруппаQRКод, Неопределено);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
	Элементы.ДанныеQRКода, ОписаниеРасположения);

	ОписаниеРасположения = ОписаниеРасположенияЭлемента(
		Элементы.ГруппаQRКодПовтор, Элементы.ГруппаПояснениеКQRКодуПовтор,
		Элементы.ГруппаQRКодПовтор, Неопределено);
		
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
	Элементы.ДанныеQRКодаПовтор, ОписаниеРасположения);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(
		ПараметрыЭлементов,
		Элементы.ГруппаQRКод);
		
	ДобавитьИзменяемыеПараметрыЭлементаФормы(
		ДанныеЭлемента, "Группировка",
		ГруппировкаПодчиненныхЭлементовФормы.Вертикальная, ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
		
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(
		ПараметрыЭлементов,
		Элементы.ГруппаQRКодПовтор);
		
	ДобавитьИзменяемыеПараметрыЭлементаФормы(
		ДанныеЭлемента, "Группировка",
		ГруппировкаПодчиненныхЭлементовФормы.Вертикальная, ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
		
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ИдентификаторОплаты);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "АвтоМаксимальнаяШирина", Истина, Ложь);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "МаксимальнаяШирина", 0, 24);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ПлатежнаяСистема);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "МаксимальнаяШирина", 0, 24);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ДекорацияПустая);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Видимость", Истина, Ложь);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ДекорацияАвтоматическаяФискализацияНадпись);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ГоризонтальноеПоложениеВГруппе",
		ГоризонтальноеПоложениеЭлемента.Центр, ГоризонтальноеПоложениеЭлемента.Лево);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаПлатежнаяСистемаКоманднаяПанель);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Неопределено, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаДействияПлатежнаяСистема);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ВертикальноеПоложениеПодчиненных",
		ВертикальноеПоложениеЭлемента.Авто, ВертикальноеПоложениеЭлемента.Низ);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоВертикали", Неопределено, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаПлатежнаяСистемаЛево);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Отображение", ОтображениеОбычнойГруппы.СлабоеВыделение,
		ОтображениеОбычнойГруппы.Нет);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Группировка",
		ГруппировкаПодчиненныхЭлементовФормы.Вертикальная, ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ФормаЗавершитьОплату);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 12, 16);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 0, 2);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ОтображениеПодсказки", ОтображениеПодсказки.ОтображатьСнизу,
		ОтображениеПодсказки.ОтображатьСверху);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ФормаЗавершитьПринудительно);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ВысотаЗаголовка", 0, 1);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 12, 16);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 0, 2);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаПлатежнаяСистемаПраво);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Отображение",
		ОтображениеОбычнойГруппы.СлабоеВыделение, ОтображениеОбычнойГруппы.Нет);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Группировка",
		ГруппировкаПодчиненныхЭлементовФормы.Вертикальная, ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ФормаОтменитьОплату);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 0, 2);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ФормаОтложить);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 1, 2);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ГруппаВсегдаВыводить);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Видимость", Истина, Ложь);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ДекорацияЛинияПредупрежденияПодтвержденияОплаты);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Видимость", Истина, Ложь);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.Группа12);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоВертикали", Ложь, Истина);
	
	ОписаниеРасположения = ОписаниеРасположенияЭлемента(Элементы.Группа12,
		Элементы.ДекорацияТекстПодтверждениеОплатыОшибка, Элементы.Группа12, Неопределено);
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ПодтвердитьПарольКассираПодтвержденияОплаты, ОписаниеРасположения);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 0, 2);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ВертикальноеПоложениеВГруппе",
		ВертикальноеПоложениеЭлемента.Авто, ВертикальноеПоложениеЭлемента.Низ);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ДекорацияЛинияВопроса);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Видимость", Истина, Ложь);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.Группа15);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоВертикали", Ложь, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.КомандаЗакрытьПринудительно);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 0, 2);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ВертикальноеПоложениеВГруппе",
		ВертикальноеПоложениеЭлемента.Авто, ВертикальноеПоложениеЭлемента.Низ);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ДекорацияЛинияВопроса1);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Видимость", Истина, Ложь);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.Группа17);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоВертикали", Ложь, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.КомандаОтложитьПринудительно);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 0, 2);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ВертикальноеПоложениеВГруппе",
		ВертикальноеПоложениеЭлемента.Авто, ВертикальноеПоложениеЭлемента.Низ);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ПлатежнаяСистема_ИдентификаторПС);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "АвтоМаксимальнаяШирина", Истина, Ложь);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "МаксимальнаяШирина", 0, 23);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыЭлементовНСПК(Элементы, ПараметрыЭлементов)
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаПанельИдентификаторКорзиныНСПК);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоВертикали", Неопределено, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ИдентификаторКорзиныНСПК);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "АвтоМаксимальнаяШирина", Истина, Ложь);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "МаксимальнаяШирина", 0, 24);
	
	ОписаниеРасположения = ОписаниеРасположенияЭлемента(Элементы.ГруппаПанельИдентификаторКорзиныНСПК,
		Элементы.ИдентификаторКорзиныНСПК, Элементы.ГруппаПанельИдентификаторКорзиныНСПК, Неопределено);
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаИдентификаторКорзиныНСПК, ОписаниеРасположения);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ВертикальноеПоложениеВГруппе",
		ВертикальноеПоложениеЭлемента.Авто, ВертикальноеПоложениеЭлемента.Низ);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ИдентификаторКорзиныНСПКЗавершить);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 0, 2);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ИдентификаторКорзиныНСПКОтменить);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 0, 2);
	
	ОписаниеРасположения = ОписаниеРасположенияЭлемента(Элементы.ГруппаПанельИдентификаторКорзиныНСПК, Неопределено,
		Элементы.ГруппаИдентификаторКорзиныНСПК, Неопределено);
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ПолучитьИдентификаторыКорзинПокупокНСПК, ОписаниеРасположения);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 0, 2);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ОтображениеПодсказки", ОтображениеПодсказки.ОтображатьСнизу,
		ОтображениеПодсказки.Всплывающая);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыЭлементовТерминала(Элементы, ПараметрыЭлементов)
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаЭлементыСтраницыВыбораТерминала);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Неопределено, Ложь);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоВертикали", Неопределено, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ДекорацияЛинияОтсечки);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Видимость", Истина, Ложь);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ЭлементыПодтверждения);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ГоризонтальноеПоложениеПодчиненных",
		ГоризонтальноеПоложениеЭлемента.Центр, ГоризонтальноеПоложениеЭлемента.Лево);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ГоризонтальноеПоложениеВГруппе",
		ГоризонтальноеПоложениеЭлемента.Авто, ГоризонтальноеПоложениеЭлемента.Лево);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Истина, Неопределено);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ВыбратьЭквайринговыйТерминал);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 7, 12);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Истина, Ложь);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ОтказатьсяОтВыбораТерминала);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 7, 12);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Истина, Ложь);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаВопросАвтономнаяКасса);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Неопределено, Ложь);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоВертикали", Неопределено, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ДекорацияЛинияПредупреждение6);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Видимость", Истина, Ложь);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ДекорацияНадписьАвтономнаяКасса);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Истина, Неопределено);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаОтветыДаНетАвтономнаяКасса);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Истина, Неопределено);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыЭлементовКоманднойПанели(Элементы, ПараметрыЭлементов)
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаКомандПродолженияПослеПробитияДополнительно);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Неопределено, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаКомандВозвратИзПробитияЧека);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Группировка",
		ГруппировкаПодчиненныхЭлементовФормы.Вертикальная, ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ГоризонтальноеПоложениеПодчиненных",
		ГоризонтальноеПоложениеЭлемента.Авто, ГоризонтальноеПоложениеЭлемента.Лево);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ГоризонтальноеПоложениеВГруппе",
		ГоризонтальноеПоложениеЭлемента.Авто, ГоризонтальноеПоложениеЭлемента.Лево);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаДоступныеКомандыПослеПробитияЧека);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Группировка",
		ГруппировкаПодчиненныхЭлементовФормы.Вертикальная, ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ГоризонтальноеПоложениеПодчиненных",
		ГоризонтальноеПоложениеЭлемента.Авто, ГоризонтальноеПоложениеЭлемента.Право);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ГоризонтальноеПоложениеВГруппе",
		ГоризонтальноеПоложениеЭлемента.Авто, ГоризонтальноеПоложениеЭлемента.Право);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.РаспечататьТекущийТоварныйЧек);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ВысотаЗаголовка", 0, 2);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 0, 12);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "АвтоМаксимальнаяШирина", Истина, Ложь);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "МаксимальнаяШирина", 0, 18);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ПробитьТекущийЧекПовторно);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ВысотаЗаголовка", 0, 2);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 0, 12);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "АвтоМаксимальнаяШирина", Истина, Ложь);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "МаксимальнаяШирина", 0, 18);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ВернутьсяВРежимПодбораТовара);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 0, 18);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Истина, Ложь);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ВыполнитьВозвратТекущегоЧека);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 0, 12);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "АвтоМаксимальнаяШирина", Истина, Ложь);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "МаксимальнаяШирина", 0, 18);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.РаспечататьТекущееЗаявлениеНаВозврат);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ВысотаЗаголовка", 0, 2);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 0, 12);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "АвтоМаксимальнаяШирина", Истина, Ложь);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "МаксимальнаяШирина", 0, 18);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ПовторитьЧек);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ВысотаЗаголовка", 0, 2);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 0, 12);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "АвтоМаксимальнаяШирина", Истина, Ложь);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "МаксимальнаяШирина", 0, 18);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыГруппыИтог(Элементы, ПараметрыЭлементов)

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.СуммаБезСкидок);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 15, 14);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.СуммаСкидкиЗначение);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 15, 14);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ПоказатьСкидкиНаЧекРасширеннаяПодсказка);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 14, 13);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.СуммаБонусов);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 15, 14);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.СуммаОплаченоСертификатами);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 15, 14);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.СуммаИтого);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 17, 16);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.Сдача);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 17, 16);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ВыполнитьПовторноеПробитие);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ГоризонтальноеПоложениеВГруппе",
		ГоризонтальноеПоложениеЭлемента.Авто, ГоризонтальноеПоложениеЭлемента.Центр);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Ложь, Истина);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыГруппыОсновныхКоманд(Элементы, ПараметрыЭлементов)
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ПробитьЧек);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 25, 24);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ПерейтиКОплате);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 25, 24);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ВыполнитьПовторноеПробитие);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 25, 24);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ПробитьЧекНСПК);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ГоризонтальноеПоложениеВГруппе",
		ГоризонтальноеПоложениеЭлемента.Авто, ГоризонтальноеПоложениеЭлемента.Центр);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 25, 24);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаКомандЦифроваяПанель);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ГоризонтальноеПоложениеВГруппе",
		ГоризонтальноеПоложениеЭлемента.Центр, ГоризонтальноеПоложениеЭлемента.Авто);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ЗакрытьФормуДанныеПокупателя);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ГоризонтальноеПоложениеВГруппе",
		ГоризонтальноеПоложениеЭлемента.Авто, ГоризонтальноеПоложениеЭлемента.Центр);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 25, 24);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаКомандПродолженияПослеПробития);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ГоризонтальноеПоложениеВГруппе",
		ГоризонтальноеПоложениеЭлемента.Центр, ГоризонтальноеПоложениеЭлемента.Авто);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ПродолжитьПослеПробитияЧека);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 25, 24);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаКомандОплатитьБонусами);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ГоризонтальноеПоложениеВГруппе",
		ГоризонтальноеПоложениеЭлемента.Центр, ГоризонтальноеПоложениеЭлемента.Авто);
		
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ОплатитьБонусамиВПроцессеПереходаКОплате);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ГоризонтальноеПоложениеВГруппе",
		ГоризонтальноеПоложениеЭлемента.Авто, ГоризонтальноеПоложениеЭлемента.Центр);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 25, 24);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыЭлементовВыемки(Элементы, ПараметрыЭлементов)

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ГруппаЗаголовокВыемка);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Видимость", Истина, Ложь);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.СтраницаВыемка);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоВертикали", Неопределено, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ГруппаОперацииВыемка);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ВертикальноеПоложениеВГруппе",
		ВертикальноеПоложениеЭлемента.Авто, ВертикальноеПоложениеЭлемента.Низ);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ВыполнитьОперациюВыемка);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 1, 2);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ОтменаВыемки);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 0, 2);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаОтветыДаНетАвтономнаяКасса2);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоВертикали", Неопределено, Истина);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыЭлементовВнесения(Элементы, ПараметрыЭлементов)

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаЗаголовокВнесение);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Видимость", Истина, Ложь);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.СтраницаВнесение);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоВертикали", Неопределено, Истина);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ГруппаОперацииВнесение);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ВертикальноеПоложениеВГруппе",
		ВертикальноеПоложениеЭлемента.Авто, ВертикальноеПоложениеЭлемента.Низ);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ВыполнитьОперациюВнесение);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 1, 2);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ОтменаВнесения);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Высота", 0, 2);

	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаПодтверждениеОперацииВнесение);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоВертикали", Неопределено, Истина);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыЭлементовЛояльности(Элементы, ПараметрыЭлементов)
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ДекорацияРасширительГруппыДопУправленияЧеком);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Видимость", Ложь, Истина);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ОписаниеНайденнойСкидки);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Неопределено, Ложь);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ВысотаЗаголовка", 0, 2);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаИнформацияПокупателя);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Истина, Ложь);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.НадписьНайденнаяКартаФИО);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Истина, Ложь);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.НадписьНайденнаяКартаТелефон);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Истина, Ложь);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.НадписьНайденнаяКартаДатаРождения);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Истина, Ложь);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.НадписьНайденнаяКартаЭлектроннаяПочта);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Истина, Ложь);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.НадписьНайденнаяКартаНомер);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Истина, Ложь);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ГруппаКоличествоБонусов);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Истина, Неопределено);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ГруппаИнформацияБонусы);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 24, 21);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.БонусыДоступноКОплате);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Истина, Истина);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ИнформацияМожноОплатитьБонусами);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 20, 21);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Истина, Ложь);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыОплаты(Элементы, ПараметрыЭлементов)
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ДекорацияПодсказкаОплатаНаличными);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 12, 11);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ДекорацияПодсказкаОплатаКартой);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 12, 11);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ДекорацияПодсказкаОплатаСБП);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 12, 11);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ДекорацияПодсказкаОплатаСертификатомНСПК);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 12, 11);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ДекорацияПодсказкаПредоплата);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 12, 11);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ДекорацияПодсказкаОплатаВРассрочку);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 12, 11);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ДекорацияПодсказкаОплатаКредитом);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Ширина", 12, 11);
	
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыЭлементовСпискаТоваровПлитки(Элементы, ПараметрыЭлементов)
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ПлиткаГруппаИтого);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоВертикали", Неопределено, Истина);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ПлиткаГруппаДанные);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Группировка",
		ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда, ГруппировкаПодчиненныхЭлементовФормы.Вертикальная);
	
	ОписаниеРасположения = ОписаниеРасположенияЭлемента(Элементы.ГруппаЛево, Неопределено,
		Элементы.ПлиткаПанельИтоговВер, Неопределено);
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ПлиткаГруппаНиз, ОписаниеРасположения);
	
	ОписаниеРасположения = ОписаниеРасположенияЭлемента(Элементы.ГруппаЛево, Элементы.ПлиткаГруппаНиз,
		Элементы.ПлиткаТаблицаТоваровВер, Неопределено);
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.НастраиваемаяПанельЛево, ОписаниеРасположения);
	
	ОписаниеРасположения = ОписаниеРасположенияЭлемента(Элементы.ГруппаЛево, Элементы.НастраиваемаяПанельЛево,
		Элементы.ПлиткаТаблицаТоваровВер, Элементы.НастраиваемаяПанельЛево);
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ПлиткаГруппаИнфо, ОписаниеРасположения);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.ПерейтиВОплату);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "РастягиватьПоГоризонтали", Истина, Ложь);
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ПлиткаИнфоТекущейСтроки);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "ЦветФона", Новый Цвет(), Элементы.ГруппаИнфо.ЦветФона);
	
	ОписаниеРасположения = ОписаниеРасположенияЭлемента(Элементы.ПанельПодбора, Элементы.ПлиточныйИнтерфейс,
		Элементы.ОболочкаПанелиУправленияПодборомВер, Неопределено);
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
		Элементы.ПанельУправленияПодбором, ОписаниеРасположения);
	
КонецПроцедуры

Функция ПолучитьПараметрыЭлементовПанелиУправленияЧеком(Форма)
	
	Элементы = Форма.Элементы;
	ПараметрыЭлементов = Новый Массив;
	
	ЗаполнитьПараметрыГруппВерхнегоУровня(Элементы, ПараметрыЭлементов);
	ЗаполнитьПараметрыГруппСлоев(Элементы, ПараметрыЭлементов);
	ЗаполнитьПараметрыВспомогательныхЭлементов(Элементы, ПараметрыЭлементов);
	ЗаполнитьПараметрыЭлементовГруппыВидовОплат(Элементы, ПараметрыЭлементов);
	ЗаполнитьПараметрыЭлементовПокупателя(Элементы, ПараметрыЭлементов);
	ЗаполнитьПараметрыЭлементовПокупателяДляПереходаКОплате(Элементы, ПараметрыЭлементов);
	ЗаполнитьПараметрыЭлементовМаркировки(Элементы, ПараметрыЭлементов);
	ЗаполнитьПараметрыПанелиОшибок(Элементы, ПараметрыЭлементов);
	ЗаполнитьПараметрыЭлементовКонтроляМарки(Элементы, ПараметрыЭлементов);
	ЗаполнитьПараметрыПанелиПодтверждения(Элементы, ПараметрыЭлементов);
	ЗаполнитьПараметрыЭлементовСопоставленияТоваров(Элементы, ПараметрыЭлементов);
	ЗаполнитьПараметрыЭлементовСерийИПартий(Элементы, ПараметрыЭлементов);
	ЗаполнитьПараметрыЭлементовЗаменыПрав(Элементы, ПараметрыЭлементов);
	ЗаполнитьПараметрыЭлементовЭквайринга(Элементы, ПараметрыЭлементов);
	ЗаполнитьПараметрыЭлементовПлатежнойСистемы(Элементы, ПараметрыЭлементов);
	ЗаполнитьПараметрыЭлементовНСПК(Элементы, ПараметрыЭлементов);
	ЗаполнитьПараметрыЭлементовТерминала(Элементы, ПараметрыЭлементов);
	ЗаполнитьПараметрыЭлементовКоманднойПанели(Элементы, ПараметрыЭлементов);
	ЗаполнитьПараметрыГруппыИтог(Элементы, ПараметрыЭлементов);
	ЗаполнитьПараметрыГруппыОсновныхКоманд(Элементы, ПараметрыЭлементов);
	ЗаполнитьПараметрыЭлементовВыемки(Элементы, ПараметрыЭлементов);
	ЗаполнитьПараметрыЭлементовВнесения(Элементы, ПараметрыЭлементов);
	ЗаполнитьПараметрыЭлементовЛояльности(Элементы, ПараметрыЭлементов);
	ЗаполнитьПараметрыОплаты(Элементы, ПараметрыЭлементов);
	ЗаполнитьПараметрыЭлементовСпискаТоваровПлитки(Элементы, ПараметрыЭлементов);
	
	Возврат ПараметрыЭлементов;
	
КонецФункции

Функция ОписаниеРасположенияЭлемента(РодительскийЭлементГоризонтально, 
		СледующийЭлементГоризонтально,
		РодительскийЭлементВертикально,
		СледующийЭлементВертикально)
	
	РезультатФункции = Новый Структура("РодительскийЭлементГоризонтально,СледующийЭлементГоризонтально,
		|РодительскийЭлементВертикально,СледующийЭлементВертикально");
	РезультатФункции.Вставить("РодительскийЭлементГоризонтально", РодительскийЭлементГоризонтально);
	РезультатФункции.Вставить("СледующийЭлементГоризонтально", СледующийЭлементГоризонтально);
	РезультатФункции.Вставить("РодительскийЭлементВертикально", РодительскийЭлементВертикально);
	РезультатФункции.Вставить("СледующийЭлементВертикально", СледующийЭлементВертикально);
	Возврат РезультатФункции;
	
КонецФункции

Функция ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов,
				ЭлементФормы,
				ОписаниеРасположенияЭлемента = Неопределено)
				
	ДанныеЭлемента = Новый Структура("ЭлементФормы,РодительскийЭлементГоризонтально,СледующийЭлементГоризонтально,
		|РодительскийЭлементВертикально,СледующийЭлементВертикально,ИзменяемыеСвойства");
	ДанныеЭлемента.ЭлементФормы 					= ЭлементФормы;
	Если Не ОписаниеРасположенияЭлемента = Неопределено Тогда
		ДанныеЭлемента.РодительскийЭлементГоризонтально = ОписаниеРасположенияЭлемента.РодительскийЭлементГоризонтально;
		ДанныеЭлемента.СледующийЭлементГоризонтально 	= ОписаниеРасположенияЭлемента.СледующийЭлементГоризонтально;
		ДанныеЭлемента.РодительскийЭлементВертикально 	= ОписаниеРасположенияЭлемента.РодительскийЭлементВертикально;
		ДанныеЭлемента.СледующийЭлементВертикально		= ОписаниеРасположенияЭлемента.СледующийЭлементВертикально;
	КонецЕсли;
	ДанныеЭлемента.ИзменяемыеСвойства 				= Новый Массив;
	ПараметрыЭлементов.Добавить(ДанныеЭлемента);
	
	Возврат ДанныеЭлемента;
	
КонецФункции

Процедура ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, ИмяСвойства,
	ЗначениеГоризонтально, ЗначениеВертикально)
	
	СтрокаИзменяемогоСвойства = Новый Структура("ИмяСвойства,ЗначениеГоризонтально,ЗначениеВертикально");
	СтрокаИзменяемогоСвойства.ИмяСвойства = ИмяСвойства;
	СтрокаИзменяемогоСвойства.ЗначениеГоризонтально = ЗначениеГоризонтально;
	СтрокаИзменяемогоСвойства.ЗначениеВертикально = ЗначениеВертикально;
	ДанныеЭлемента.ИзменяемыеСвойства.Добавить(СтрокаИзменяемогоСвойства);
	
КонецПроцедуры

Процедура МодифицироватьЭлементФормы(Элементы, ДанныеЭлемента, ВертикальнаяОриентация)

	УстанавливаемыйРодитель = ?(ВертикальнаяОриентация,
								ДанныеЭлемента.РодительскийЭлементВертикально,
								ДанныеЭлемента.РодительскийЭлементГоризонтально);
	Если Не УстанавливаемыйРодитель = Неопределено Тогда
		
		Если Не (ДанныеЭлемента.РодительскийЭлементГоризонтально = ДанныеЭлемента.РодительскийЭлементВертикально
			И ДанныеЭлемента.СледующийЭлементГоризонтально = ДанныеЭлемента.СледующийЭлементВертикально) Тогда
			
			СледующийЭлемент = ?(ВертикальнаяОриентация,
								ДанныеЭлемента.СледующийЭлементВертикально,
								ДанныеЭлемента.СледующийЭлементГоризонтально);
			Элементы.Переместить(ДанныеЭлемента.ЭлементФормы, УстанавливаемыйРодитель, СледующийЭлемент);
			
		КонецЕсли;
	КонецЕсли;
	Для Каждого СтрокаСвойства Из ДанныеЭлемента.ИзменяемыеСвойства Цикл
		УстанавливаемоеСвойство = ?(ВертикальнаяОриентация,
									СтрокаСвойства.ЗначениеВертикально,
									СтрокаСвойства.ЗначениеГоризонтально);
		ДанныеЭлемента.ЭлементФормы[СтрокаСвойства.ИмяСвойства] = УстанавливаемоеСвойство;
	КонецЦикла;
	
КонецПроцедуры

Процедура УвеличитьРазмерПоляГруппыОплат(ЭлементПоле, ПараметрыУвеличенногоИнтерфейса)
	
	Если ЭлементПоле.Имя = "СуммаОплаченоСБП" Или ЭлементПоле.Имя = "СуммаОплаченоЮКасса" Тогда
		ЭлементПоле.Ширина = ПараметрыУвеличенногоИнтерфейса.ШиринаПоля - 1;
	ИначеЕсли ЭлементПоле.Вид = ВидПоляФормы.ПолеНадписи Тогда
		ЭлементПоле.Ширина = ПараметрыУвеличенногоИнтерфейса.ШиринаПоля + 1;
	Иначе
		ЭлементПоле.Ширина = ПараметрыУвеличенногоИнтерфейса.ШиринаПоля;
	КонецЕсли;
	ЭлементПоле.Шрифт = ПараметрыУвеличенногоИнтерфейса.ШрифтСуммОплат;
	
КонецПроцедуры

Процедура УвеличитьРазмерПолейОплат(РодительскийЭлемент, ПараметрыУвеличенногоИнтерфейса)
	
	Для Каждого ЭлементГруппыОплат Из РодительскийЭлемент.ПодчиненныеЭлементы Цикл
		Если ТипЗнч(ЭлементГруппыОплат) = Тип("ГруппаФормы") Тогда
			УвеличитьРазмерПолейОплат(ЭлементГруппыОплат, ПараметрыУвеличенногоИнтерфейса);
		ИначеЕсли ТипЗнч(ЭлементГруппыОплат) = Тип("ПолеФормы") Или ТипЗнч(ЭлементГруппыОплат) = Тип("ПолеНадписиФормы") Тогда
			УвеличитьРазмерПоляГруппыОплат(ЭлементГруппыОплат, ПараметрыУвеличенногоИнтерфейса);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция НавигационнаяСсылкаИзображения(ДанныеИзображения, ИдентификаторФормы)

	УстановитьПривилегированныйРежим(Истина);
	Возврат РаботаСФайлами.ДанныеФайла(ДанныеИзображения, ИдентификаторФормы).СсылкаНаДвоичныеДанныеФайла;

КонецФункции

Процедура УстановитьУсловноеОформлениеФормыРМК(ФормаРМК)
	
	// Оплаченные товары
	Элемент = ФормаРМК.УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ФормаРМК.Элементы.Товары.Имя);
	ДобавитьЭлементОтбораКомпоновкиДанныхРавенство(Элемент.Отбор, ФормаРМК.Элементы.ТоварыОплачена.ПутьКДанным, Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ФормаРМК.ЦветаФормы.ЗеленаяКнопка);
	
	// Оплата недоступна
	Элемент = ФормаРМК.УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ФормаРМК.Элементы.Товары.Имя);
	ДобавитьЭлементОтбораКомпоновкиДанныхРавенство(Элемент.Отбор, ФормаРМК.Элементы.ТоварыОплатаНедоступна.ПутьКДанным, Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ФормаРМК.ЦветаФормы.КраснаяКнопка);
	
	// Замена товара
	Если ФормаРМК.ИспользоватьЗаменуТоваров Тогда
		Элемент = ФормаРМК.УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ФормаРМК.Элементы.Товары.Имя);
		ДобавитьЭлементОтбораКомпоновкиДанныхРавенство(Элемент.Отбор, ФормаРМК.Элементы.ТоварыТоварКЗамене.ПутьКДанным, Истина);
		Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ФормаРМК.ЦветаФормы.ФонРежимаВозврат);
		Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	КонецЕсли;
	
	// Товары сверх заказа
	Элемент = ФормаРМК.УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ФормаРМК.Элементы.Товары.Имя);
	ГруппаОтбораЭлементаВерхнегоУровня = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбораЭлементаВерхнегоУровня.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	ЭлементОтбора = ГруппаОтбораЭлементаВерхнегоУровня.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ЗаказПокупателя");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	ЭлементОтбора = ГруппаОтбораЭлементаВерхнегоУровня.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ЗаказПокупателя");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	ЭлементОтбора = ГруппаОтбораЭлементаВерхнегоУровня.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВыделятьСтрокуСверхЗаказа");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ФормаРМК.ЦветаФормы.ТекстСверхЗаказа);
	
	// Товары без скидок и бонусов
	Элемент = ФормаРМК.УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ФормаРМК.Элементы.ТоварыСуммаСкидокОбщая.Имя);
	
	ГруппаОтбораЭлементаВерхнегоУровня = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбораЭлементаВерхнегоУровня.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ГруппаЗапретОплатыБонусамиИлиПодарок
		= ГруппаОтбораЭлементаВерхнегоУровня.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЗапретОплатыБонусамиИлиПодарок.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	
	ДобавитьЭлементОтбораКомпоновкиДанныхРавенство(ГруппаЗапретОплатыБонусамиИлиПодарок,
		"Объект.Товары.ЗапретОплатыБонусамиСкидками", Истина);
	ДобавитьЭлементОтбораКомпоновкиДанныхРавенство(ГруппаЗапретОплатыБонусамиИлиПодарок,
		"Объект.Товары.Подарок", Истина);
	
	ДобавитьЭлементОтбораКомпоновкиДанныхРавенство(ГруппаОтбораЭлементаВерхнегоУровня,
		"Объект.Товары.СуммаСкидокОбщая", 0);
	
	ЭлементОтбора = ГруппаОтбораЭлементаВерхнегоУровня.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("БонусыДоступноКОплате");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
	ЭлементОтбора.ПравоеЗначение = 0;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОтрицательногоЧисла);
	Элемент.Оформление.УстановитьЗначениеПараметра("Формат", НСтр("ru='ЧН=0.00'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ШрифтОбычныйПолужирный12РМК);
	
	// Остатки товаров в корзине РМК
	Если ЗначениеЗаполнено(ФормаРМК.Объект.ТорговыйОбъект) Тогда
		Элемент = ФормаРМК.УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ФормаРМК.Элементы.ТаблицаОстатков.Имя);
		ДобавитьЭлементОтбораКомпоновкиДанныхРавенство(Элемент.Отбор, ФормаРМК.Элементы.ТаблицаОстатковМестоХранения.ПутьКДанным, Строка(ФормаРМК.Объект.ТорговыйОбъект));
		Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ШрифтОбычныйПолужирный12РМК);
	КонецЕсли;
	
	// Дерево скидок
	Элемент = ФормаРМК.УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ФормаРМК.Элементы.ДеревоСкидок.Имя);
	ДобавитьЭлементОтбораКомпоновкиДанныхРавенство(Элемент.Отбор, ФормаРМК.Элементы.ДеревоСкидокУровень.ПутьКДанным, 0);
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ШрифтОбычныйПолужирный12РМК);
	
	// Дерево подарков
	Элемент = ФормаРМК.УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ФормаРМК.Элементы.ДеревоПодарков.Имя);
	ДобавитьЭлементОтбораКомпоновкиДанныхРавенство(Элемент.Отбор, ФормаРМК.Элементы.ДеревоПодарковУровень.ПутьКДанным, 1);
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ШрифтОбычныйПолужирный12РМК);
	
	// Доступные скидки выбор
	Элемент = ФормаРМК.УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ФормаРМК.Элементы.ТаблицаВыборУправляемыхСкидок.Имя);
	ДобавитьЭлементОтбораКомпоновкиДанныхРавенство(Элемент.Отбор, ФормаРМК.Элементы.ТаблицаВыборУправляемыхСкидокОтметка.ПутьКДанным, Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветФонаРежимаПродажиРМК);
	
	// Дерево действующих скидок
	Элемент = ФормаРМК.УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ФормаРМК.Элементы.ДеревоДействующихСкидок.Имя);
	ДобавитьЭлементОтбораКомпоновкиДанныхРавенство(Элемент.Отбор, ФормаРМК.Элементы.ДеревоДействующихСкидокУровень.ПутьКДанным, 1);
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ШрифтОбычныйПолужирный12РМК);
	
	Элемент = ФормаРМК.УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ФормаРМК.Элементы.ДеревоДействующихСкидок.Имя);
	ДобавитьЭлементОтбораКомпоновкиДанныхРавенство(Элемент.Отбор, ФормаРМК.Элементы.ДеревоДействующихСкидокУровень.ПутьКДанным, 2);
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ШрифтОбычныйНаклонный12РМК);
	
	// Отбор группа
	Элемент = ФормаРМК.УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ФормаРМК.Элементы.ОтборГруппа.Имя);
	ЭлементОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОтборГруппа.Ссылка");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Новый ПолеКомпоновкиДанных("НастройкаКаталогаТекущаяГруппа");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветФонаРежимаПродажиРМК);
	
	// Отбор категории
	Элемент = ФормаРМК.УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ФормаРМК.Элементы.ОтборКатегория.Имя);
	ЭлементОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОтборКатегория.Ссылка");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Новый ПолеКомпоновкиДанных("НастройкаКаталогаТекущаяКатегория");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветФонаРежимаПродажиРМК);
	
	// Объединенная строка номенклатуры в каталоге
	Элемент = ФормаРМК.УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ФормаРМК.Элементы.СписокТоваров.Имя);
	ДобавитьЭлементОтбораКомпоновкиДанныхРавенство(Элемент.Отбор, ФормаРМК.Элементы.СписокТоваровВидСтроки.ПутьКДанным, 1);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветАктивнойКнопкиРМК);
	
КонецПроцедуры

Процедура НастроитьКомандыРежимИЕще(Форма)
	
	Элементы = Форма.Элементы;
	
	Элементы.КомандаРежим.Видимость = Истина;
	Элементы.КомандаЕще.Видимость = Истина;
	
	Форма.СписокКомандРежим.Очистить();
	Форма.СписокКомандРежим.Добавить("Продажа", , , БиблиотекаКартинок.Sell);
	Форма.СписокКомандРежим.Добавить("Возврат", , , БиблиотекаКартинок.Return);
	Если Элементы.Скупка.Видимость Тогда
		Форма.СписокКомандРежим.Добавить("Скупка", , , БиблиотекаКартинок.Buy);
		Форма.СписокКомандРежим.Добавить("ВозвратСкупки", НСтр("ru = 'Возврат скупки'"),, БиблиотекаКартинок.ReturnBuy);
	КонецЕсли;
	Если Элементы.Заказ.Видимость Тогда
		Форма.СписокКомандРежим.Добавить("Заказ", , , БиблиотекаКартинок.Order);
	КонецЕсли;
	Форма.СписокКомандРежим.Добавить("ЧекКоррекции",
		НСтр("ru = 'Чек коррекции'"), , БиблиотекаКартинок.CorrectionCheque);
	Форма.СписокКомандРежим.Добавить("ПроверкаЧека",
		НСтр("ru = 'Проверка чека'"), , БиблиотекаКартинок.РМКПроверитьЧек16);
	
	ПечататьТоварныйЧек = ПечататьТоварныйЧек(Форма);
	ВесыПодключены = Форма.ПоддерживаемыеТипыПодключаемогоОборудования.ЭлектронныеВесы;
	ИспользуетсяОбучениеУстройствРаспознавания = Элементы.ОбучениеУстройствРаспознавания.Видимость;
	ИспользуютсяЗаказы = Элементы.ПродажаПоЗаказу.Видимость;
	ИспользуютсяБезналПлатежи = Элементы.БезналичныеПлатежи.Видимость;
	ИспользуютсяАвансы = Элементы.ПриемАванса.Видимость;
	ИспользуютсяРасчетыСПокупателями = Элементы.ДокументРасчета.Видимость;
	ИспользуютсяРассрочки = Элементы.ОплатаРассрочки.Видимость;
	ПечататьЗаявлениеНаВозврат = Не ОбщегоНазначенияРМК.ЭтоВидОперацииПродажа(Форма.Объект.ВидОперации);
	ИспользуетсяСписаниеАлкоголя = Элементы.СписатьАлкогольнуюПродукцию.Видимость;
	ДоступнаСменаМагазина = Элементы.СменитьМагазин.Видимость;
	ИспользуетсяОбменДанными = Элементы.ОткрытьФормуОбменаДанными.Видимость;
	ИспользуетсяОтчетЗаСмену = Элементы.ОтчетЗаСмену.Видимость;
	ИспользуетсяОборудованиеРозлива = Элементы.ГруппаЕщеОборудованиеРозлива.Видимость;
	
	Форма.СписокКомандЕще.Очистить();
	Форма.СписокКомандЕще.Добавить("Внесение",,, БиблиотекаКартинок.Внесение);
	Форма.СписокКомандЕще.Добавить("Выемка",,, БиблиотекаКартинок.Выемка);
	Форма.СписокКомандЕще.Добавить("ПовторнаяПечатьЧека", НСтр("ru = 'Повторная печать чека'"),,
		БиблиотекаКартинок.ПовторнаяПечатьЧека);
	Если ПечататьТоварныйЧек Тогда
		Форма.СписокКомандЕще.Добавить("РаспечататьТоварныйЧек", НСтр("ru = 'Распечатать товарный чек'"),,
			БиблиотекаКартинок.ПечатьТоварногоЧека);
	КонецЕсли;
	Если ВесыПодключены Тогда
		Форма.СписокКомандЕще.Добавить("ОткрытьПараметрыТарирования", НСтр("ru = 'Тарирование'"),,
			БиблиотекаКартинок.НастройкиТарированияВесов);
	КонецЕсли;
	Если ИспользуетсяОбучениеУстройствРаспознавания Тогда
		Форма.СписокКомандЕще.Добавить("ОбучениеУстройствРаспознавания", НСтр("ru = 'Обучение устройств распознавания'"),,
			БиблиотекаКартинок.РМКУстройствоРаспознавания24);
	КонецЕсли;
	Если ИспользуютсяЗаказы Тогда 
		Форма.СписокКомандЕще.Добавить("ПродажаПоЗаказу", НСтр("ru = 'Продажа по заказу'"),,
			БиблиотекаКартинок.ПродажаПоЗаказу);
	КонецЕсли;
	Если ИспользуютсяБезналПлатежи Тогда
		Форма.СписокКомандЕще.Добавить("БезналичныеПлатежи", НСтр("ru = 'Безналичные платежи'"),,
			БиблиотекаКартинок.БезналичнаяОплата);
	КонецЕсли;
	Если ИспользуютсяАвансы Тогда
		Форма.СписокКомандЕще.Добавить("ПриемАванса", НСтр("ru = 'Прием аванса'"),,
			БиблиотекаКартинок.ПриемАванса);
	КонецЕсли;
	Если ИспользуютсяРасчетыСПокупателями Тогда
		Форма.СписокКомандЕще.Добавить("ДокументРасчета", НСтр("ru = 'Документ расчета'"),,
			БиблиотекаКартинок.ДокументРасчета);
	КонецЕсли;
	Если ИспользуютсяРассрочки Тогда
		Форма.СписокКомандЕще.Добавить("ОплатаРассрочки", НСтр("ru = 'Оплата рассрочки'"),,
			БиблиотекаКартинок.ОплатаРассрочки);
	КонецЕсли;
	Если ПечататьЗаявлениеНаВозврат Тогда
		Форма.СписокКомандЕще.Добавить("РаспечататьЗаявлениеНаВозврат", НСтр("ru = 'Заявление на возврат'"),,
			БиблиотекаКартинок.ЗаявлениеНаВозврат);
	КонецЕсли;
	Форма.СписокКомандЕще.Добавить("НайтиПоШтрихкоду", НСтр("ru = 'Найти по штрихкоду'"),,
		БиблиотекаКартинок.УдалитьПоШтрихкоду);
	Если ИспользуетсяСписаниеАлкоголя Тогда
		Форма.СписокКомандЕще.Добавить("СписатьАлкогольнуюПродукцию", НСтр("ru = 'Списать алкогольную продукцию'"),,
			БиблиотекаКартинок.АлкогольнаяПродукцияКега);
	КонецЕсли;
	Форма.СписокКомандЕще.Добавить("СменитьКассира", НСтр("ru = 'Сменить кассира'"),, БиблиотекаКартинок.СменитьКассира);
	Если ДоступнаСменаМагазина Тогда
		Форма.СписокКомандЕще.Добавить("СменитьМагазин", НСтр("ru = 'Сменить магазин'"),, БиблиотекаКартинок.СменитьМагазин);
	КонецЕсли;
	Если Форма.ИспользоватьОплатуСертификатамиНСПК Тогда
		Форма.СписокКомандЕще.Добавить("ОтправитьПодтверждениеНСПК", НСтр("ru = 'Отправить подтверждение ЭС (ФЗ-491)'"),,
			БиблиотекаКартинок.НСПК_МИР);
		Форма.СписокКомандЕще.Добавить("СписокСертификатовНСПК", НСтр("ru = 'Подбор товаров ЭС (ФЗ-491)'"),,
			БиблиотекаКартинок.РМККартаМИР);
	КонецЕсли;
	Если Форма.ИспользоватьКонтрольПродаж Тогда
		Форма.СписокКомандЕще.Добавить("ОбновитьОграниченияПродаж", НСтр("ru = 'Обновить контроль продаж'"),,
			БиблиотекаКартинок.ОбновлениеОграниченийПродаж);
	КонецЕсли;
	Если ИспользуетсяОбменДанными Тогда
		Форма.СписокКомандЕще.Добавить("ОткрытьФормуОбменаДанными", НСтр("ru = 'Выполнить обмен'"),,
			БиблиотекаКартинок.СинхронизацияДанных);
	КонецЕсли;
	Если ИспользуетсяОборудованиеРозлива Тогда
		Форма.СписокКомандЕще.Добавить("ПодключитьКегКОборудованиюРозлива", НСтр("ru = 'Подключить кегу'"),,
			БиблиотекаКартинок.Plus);
		Форма.СписокКомандЕще.Добавить("ОтключитьКегОтОборудованияРозлива", НСтр("ru = 'Отключить кегу'"),,
			БиблиотекаКартинок.Minus);
	КонецЕсли;
	Если Форма.ИспользоватьОплатуНаличными Тогда
		Форма.СписокКомандЕще.Добавить("ОткрытьДенежныйЯщик", НСтр("ru = 'Открыть денежный ящик'"),,
			БиблиотекаКартинок.РМКОткрытьДенежныйЯщик);
	КонецЕсли;
	Форма.СписокКомандЕще.Добавить("ЗакрытьСмену", НСтр("ru = 'Закрыть смену (Z-отчет)'"),,
		БиблиотекаКартинок.ЗакрытьСмену);
	Форма.СписокКомандЕще.Добавить("СнятьОтчетБезГашения", НСтр("ru = 'Отчёт без гашения (X-отчет)'"),,
		БиблиотекаКартинок.XОтчет);
	Если Форма.ИспользоватьОплатуПлатежнымиКартами Тогда
		Форма.СписокКомандЕще.Добавить("СверкаИтогов", НСтр("ru = 'Сверка итогов'"),, БиблиотекаКартинок.СверкаИтогов);
	КонецЕсли;
	Если ИспользуетсяОтчетЗаСмену Тогда
		Форма.СписокКомандЕще.Добавить("ОтчетЗаСмену", НСтр("ru = 'Отчет за смену'"),, БиблиотекаКартинок.РМКОтчетЗаСмену);
	КонецЕсли;
	Форма.СписокКомандЕще.Добавить("ЗавершитьРаботуРМК", НСтр("ru = 'Завершить работу'"),, БиблиотекаКартинок.Закрыть);
	
КонецПроцедуры

Функция ПечататьТоварныйЧек(Форма)
	
	ПечататьТоварныйЧек = Ложь;
	
	ЭтоПечатьТоварногоЧекаНаКассовомОборудовании = (Форма.СпособФормированияТоварногоЧека = 2);
	ЭтоПечатьТоварногоЧекаНаОфисномПринтере = (Форма.СпособФормированияТоварногоЧека = 1);
	Если (ЭтоПечатьТоварногоЧекаНаКассовомОборудовании
		И (ЗначениеЗаполнено(Форма.ПринтерЧеков) ИЛИ ЗначениеЗаполнено(Форма.ПодключаемоеОборудование)))
		Или ЭтоПечатьТоварногоЧекаНаОфисномПринтере Тогда
		ПечататьТоварныйЧек = Истина;
	КонецЕсли;
	
	Возврат ПечататьТоварныйЧек;
	
КонецФункции

Процедура ОчиститьПанельКупюр(Форма)
	
	ЭлементыФормы = Форма.Элементы;
	ОчиститьГруппуКупюр(ЭлементыФормы, ЭлементыФормы.ГруппаКупюр);
	ОчиститьГруппуКупюр(ЭлементыФормы, ЭлементыФормы.ГруппаКупюрРяд1);
	ОчиститьГруппуКупюр(ЭлементыФормы, ЭлементыФормы.ГруппаКупюрРяд2);
	
КонецПроцедуры

Процедура ОчиститьГруппуКупюр(ЭлементыФормы, ЭлементГруппаКупюр)
	КоличествоЭлементовКупюр = ЭлементГруппаКупюр.ПодчиненныеЭлементы.Количество();
	Позиция = 0;
	Пока Позиция < КоличествоЭлементовКупюр Цикл
		ИндексЭлемента = КоличествоЭлементовКупюр - Позиция - 1;
		ТекущийЭлемент = ЭлементГруппаКупюр.ПодчиненныеЭлементы.Получить(ИндексЭлемента);
		ЭлементыФормы.Удалить(ТекущийЭлемент);
		
		Позиция = Позиция + 1;
	КонецЦикла;
КонецПроцедуры

Процедура ДобавитьКупюруНаПанельВводаНаличных(Элементы, Команды, ГруппаРядКупюр, ДанныеКупюры)
	
	ИмяГруппыКупюры = "ГруппаКупюры" + ДанныеКупюры.НоминалКупюры;
	НоваяГруппаКупюры = Элементы.Добавить(ИмяГруппыКупюры, Тип("ГруппаФормы"), ГруппаРядКупюр);
	НоваяГруппаКупюры.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппаКупюры.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	НоваяГруппаКупюры.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
	НоваяГруппаКупюры.ОтображатьЗаголовок = Ложь;
	НоваяГруппаКупюры.Отображение = ОтображениеОбычнойГруппы.Нет;
	
	ИмяКоманды = "ВыборКупюры" + ДанныеКупюры.НоминалКупюры;
	НоваяКоманда = Команды.Найти(ИмяКоманды);
	Если НоваяКоманда = Неопределено Тогда
		НоваяКоманда = Команды.Добавить(ИмяКоманды);
		НоваяКоманда.Действие = "Подключаемый_ВыбратьКупюру";
		Если Не ДанныеКупюры.ГорячаяКлавиша = Неопределено Тогда
			НоваяКоманда.СочетаниеКлавиш = ДанныеКупюры.ГорячаяКлавиша;
		КонецЕсли;
	КонецЕсли;
	
	ИмяГруппыДекораций = "ГруппаДекорацийКупюры" + ДанныеКупюры.НоминалКупюры;
	НоваяГруппаДекораций = Элементы.Добавить(ИмяГруппыДекораций, Тип("ГруппаФормы"), НоваяГруппаКупюры);
	НоваяГруппаДекораций.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппаДекораций.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НоваяГруппаДекораций.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;
	НоваяГруппаДекораций.ОтображатьЗаголовок = Ложь;
	НоваяГруппаДекораций.Отображение = ОтображениеОбычнойГруппы.Нет;
	
	ИмяДекорации = "КоличествоНажатийКупюры" + ДанныеКупюры.НоминалКупюры;
	ДекорацияКупюры = Элементы.Добавить(ИмяДекорации, Тип("ДекорацияФормы"), НоваяГруппаДекораций);
	ДекорацияКупюры.Вид = ВидДекорацииФормы.Надпись;
	ДекорацияКупюры.Шрифт = ШрифтыСтиля.ШрифтОбычныйПолужирныйРМК;
	ДекорацияКупюры.Ширина = 4;
	ДекорацияКупюры.Высота = 1;
	ДекорацияКупюры.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Низ;
	ДекорацияКупюры.ВертикальноеПоложение = ВертикальноеПоложениеЭлемента.Низ;
	ДекорацияКупюры.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Право;
	ДекорацияКупюры.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
	
	ИмяДекорацииОтступ = "КоличествоНажатийКупюрыОтступ" + ДанныеКупюры.НоминалКупюры;
	ДекорацияКупюрыОтступ = Элементы.Добавить(ИмяДекорацииОтступ, Тип("ДекорацияФормы"), НоваяГруппаДекораций);
	ДекорацияКупюрыОтступ.Вид = ВидДекорацииФормы.Надпись;
	ДекорацияКупюрыОтступ.Заголовок = " ";
	
	ИмяКнопкиКупюры = "Купюра" + ДанныеКупюры.НоминалКупюры;
	КнопкаКупюры = Элементы.Добавить(ИмяКнопкиКупюры, Тип("КнопкаФормы"), НоваяГруппаКупюры);
	КнопкаКупюры.ИмяКоманды = ИмяКоманды;
	КнопкаКупюры.Картинка = ДанныеКупюры.КартинкаКупюры;
	КнопкаКупюры.Ширина = 5;
	КнопкаКупюры.Высота = 5;
	КнопкаКупюры.Отображение = ОтображениеКнопки.Картинка;
	
КонецПроцедуры

Функция ДобавитьРядКнопок(РодительскийЭлемент, ИндексРяда, Элементы)
	
	ИмяРяда = СтрШаблон("РядКнопок_%1", ИндексРяда);
	НовыйРяд = Элементы.Найти(ИмяРяда);
	Если НовыйРяд = Неопределено Тогда
		НовыйРяд = Элементы.Добавить(ИмяРяда, Тип("ГруппаФормы"), РодительскийЭлемент);
	КонецЕсли;
	НовыйРяд.Вид 								= ВидГруппыФормы.ОбычнаяГруппа;
	НовыйРяд.ГоризонтальноеПоложениеПодчиненных	= ГоризонтальноеПоложениеЭлемента.Центр;
	НовыйРяд.Группировка						= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НовыйРяд.ОтображатьЗаголовок 				= Ложь;
	НовыйРяд.Отображение						= ОтображениеОбычнойГруппы.Нет;
	НовыйРяд.РастягиватьПоГоризонтали			= Истина;
	НовыйРяд.РастягиватьПоВертикали				= Ложь;
	НовыйРяд.Видимость							= Ложь;
	
	Возврат НовыйРяд;
	
КонецФункции

Процедура ДобавитьКнопкуВРяд(РядКнопок, ИндексКнопки, ГорячаяКлавиша, Форма)
	
	ИмяКомандыНажатия = "Подключаемый_ИзбранноеВыбор";
	ПутьКДаннымПустойКартинки = "ПустаяКартинка";
	
	СочетаниеКлавиш = Неопределено;
	Если Не ГорячаяКлавиша = Неопределено Тогда
		Если (ГорячаяКлавиша.Alt ИЛИ ГорячаяКлавиша.Shift ИЛИ ГорячаяКлавиша.Ctrl) И ИндексКнопки < 10 Тогда
			
			ИмяКлавиши = СтрШаблон("_%1", ИндексКнопки);
			ДополнительнаяКлавиша = Клавиша[ИмяКлавиши];
			
			СочетаниеКлавиш = Новый СочетаниеКлавиш(ДополнительнаяКлавиша,
				ГорячаяКлавиша.Alt, ГорячаяКлавиша.Ctrl, ГорячаяКлавиша.Shift);
		КонецЕсли;
	КонецЕсли;
	
	ШрифтТекста = ШрифтыСтиля.ОбычныйШрифтТекста;
	ШрифтЦены = ШрифтыСтиля.ШрифтОбычныйПолужирныйРМК;
	ШрифтГорячейКлавиши = ШрифтыСтиля.ШрифтОбычныйПолужирный12РМК;
	БезРамки = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки);
	ЭлементыФормы = Форма.Элементы;
	
	ИмяЭлемента = СтрШаблон("Избранное_Элемент01_%1", ИндексКнопки);
	ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), РядКнопок);
	ЭлементФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ЭлементФормы.ОтображатьЗаголовок = Ложь;
	ЭлементФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ЭлементФормы.РастягиватьПоВертикали = Ложь;
	ЭлементФормы.РастягиватьПоГоризонтали = Истина;
	ЭлементФормы.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
	ЭлементФормы.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
	ЭлементФормы.Ширина = 35;
	ЭлементФормы.Высота = 4;
	ГруппаОсновная = ЭлементФормы;
	
	ИмяЭлемента = СтрШаблон("Избранное_Элемент02_%1", ИндексКнопки);
	ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаОсновная);
	ЭлементФормы.Вид 						= ВидПоляФормы.ПолеКартинки;
	ЭлементФормы.Рамка 						= БезРамки;
	ЭлементФормы.ПоложениеЗаголовка 		= ПоложениеЗаголовкаЭлементаФормы.Нет;
	ЭлементФормы.Гиперссылка 				= Истина;
	ЭлементФормы.АвтоМаксимальнаяШирина		= Ложь;
	ЭлементФормы.МаксимальнаяШирина			= 7;
	ЭлементФормы.РастягиватьПоВертикали		= Истина;
	ЭлементФормы.РастягиватьПоГоризонтали	= Ложь;
	ЭлементФормы.Ширина						= 7;
	ЭлементФормы.РазмерКартинки 			= РазмерКартинки.Пропорционально;
	ЭлементФормы.УстановитьДействие("Нажатие", ИмяКомандыНажатия);
	ЭлементФормы.ПутьКДанным = СтрШаблон("ДанныеКнопок[%1].АдресИзображения", ИндексКнопки);
	
	ИмяЭлемента = СтрШаблон("Избранное_Элемент03_%1", ИндексКнопки);
	ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), ГруппаОсновная);
	ЭлементФормы.Вид 						= ВидГруппыФормы.ОбычнаяГруппа;
	ЭлементФормы.ОтображатьЗаголовок 		= Ложь;
	ЭлементФормы.Группировка				= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаПравая = ЭлементФормы;
	
	ИмяЭлемента = СтрШаблон("Избранное_Элемент04_%1", ИндексКнопки);
	ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), ГруппаПравая);
	ЭлементФормы.Вид 						= ВидГруппыФормы.ОбычнаяГруппа;
	ЭлементФормы.ОтображатьЗаголовок 		= Ложь;
	ЭлементФормы.Группировка				= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаВерхняя = ЭлементФормы;
	
	ИмяЭлемента = СтрШаблон("Избранное_Элемент05_%1", ИндексКнопки);
	ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаВерхняя);
	ЭлементФормы.Вид 						= ВидПоляФормы.ПолеКартинки;
	ЭлементФормы.Рамка 						= БезРамки;
	ЭлементФормы.ПоложениеЗаголовка 		= ПоложениеЗаголовкаЭлементаФормы.Нет;
	ЭлементФормы.Гиперссылка 				= Истина;
	ЭлементФормы.Шрифт						= ШрифтТекста;
	ЭлементФормы.ПутьКДанным 				= ПутьКДаннымПустойКартинки;
	ЭлементФормы.УстановитьДействие("Нажатие", ИмяКомандыНажатия);
	
	ИмяЭлемента = СтрШаблон("Избранное_Элемент06_%1", ИндексКнопки);
	ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), ГруппаВерхняя);
	ЭлементФормы.Вид 						= ВидГруппыФормы.ОбычнаяГруппа;
	ЭлементФормы.ОтображатьЗаголовок 		= Ложь;
	ЭлементФормы.Группировка				= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ЭлементФормы.РастягиватьПоГоризонтали	= Ложь;
	ЭлементФормы.Ширина						= 2;
	ГруппаПраваяВерхняя = ЭлементФормы;
	
	ИмяЭлемента = СтрШаблон("Избранное_Элемент07_%1", ИндексКнопки);
	ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаПраваяВерхняя);
	ЭлементФормы.Вид 						= ВидПоляФормы.ПолеКартинки;
	ЭлементФормы.Рамка 						= БезРамки;
	ЭлементФормы.ПоложениеЗаголовка 		= ПоложениеЗаголовкаЭлементаФормы.Нет;
	ЭлементФормы.Гиперссылка 				= Истина;
	ЭлементФормы.Шрифт						= ШрифтГорячейКлавиши;
	ЭлементФормы.ЦветТекста					= Новый Цвет(160,160,160);
	ЭлементФормы.ПутьКДанным 				= ПутьКДаннымПустойКартинки;
	ЭлементФормы.УстановитьДействие("Нажатие", ИмяКомандыНажатия);
	
	Если Не СочетаниеКлавиш = Неопределено Тогда
		ЭлементФормы.СочетаниеКлавиш = СочетаниеКлавиш;
		ЭлементФормы.ТекстНевыбраннойКартинки = ИндексКнопки;
	КонецЕсли;
	
	ИмяЭлемента = СтрШаблон("Избранное_Элемент20_%1", ИндексКнопки);
	ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), ГруппаПраваяВерхняя);
	ЭлементФормы.Вид = ВидГруппыФормы.Страницы;
	ЭлементФормы.Отображениестраниц = ОтображениеСтраницФормы.Нет;
	Страницы = ЭлементФормы;
	
	ИмяЭлемента = СтрШаблон("Избранное_Элемент21_%1", ИндексКнопки);
	ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), Страницы);
	ЭлементФормы.Вид = ВидГруппыФормы.Страница;
	ЭлементФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Страница = ЭлементФормы;
	
	ИмяЭлемента = СтрШаблон("Избранное_Элемент23_%1", ИндексКнопки);
	ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), Страница);
	ЭлементФормы.Вид = ВидДекорацииФормы.Картинка;
	ЭлементФормы.Высота = 1;
	ЭлементФормы.Гиперссылка = Истина;
	ЭлементФормы.Картинка = БиблиотекаКартинок.УровеньВниз;
	ЭлементФормы.РазмерКартинки = РазмерКартинки.Пропорционально;
	ЭлементФормы.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки);
	ЭлементФормы.УстановитьДействие("Нажатие", ИмяКомандыНажатия);
	
	ИмяЭлемента = СтрШаблон("Избранное_Элемент22_%1", ИндексКнопки);
	ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), Страницы);
	ЭлементФормы.Вид = ВидГруппыФормы.Страница;
	ЭлементФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Страница = ЭлементФормы;

	ИмяЭлемента = СтрШаблон("Избранное_Элемент24_%1", ИндексКнопки);
	ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), Страница);
	ЭлементФормы.Вид = ВидДекорацииФормы.Картинка;
	ЭлементФормы.Высота = 1;
	ЭлементФормы.Гиперссылка = Истина;
	ЭлементФормы.Картинка = БиблиотекаКартинок.УровеньВверх;
	ЭлементФормы.РазмерКартинки = РазмерКартинки.Пропорционально;
	ЭлементФормы.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки);
	ЭлементФормы.УстановитьДействие("Нажатие", ИмяКомандыНажатия);
	
	ИмяЭлемента = СтрШаблон("Избранное_Элемент09_%1", ИндексКнопки);
	ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), ГруппаПравая);
	ЭлементФормы.Вид 						= ВидГруппыФормы.ОбычнаяГруппа;
	ЭлементФормы.ОтображатьЗаголовок 		= Ложь;
	ЭлементФормы.Группировка				= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ЭлементФормы.РастягиватьПоВертикали		= Ложь;
	ЭлементФормы.Высота						= 1;
	ГруппаНижняя = ЭлементФормы;
	
	ИмяЭлемента = СтрШаблон("Избранное_Элемент10_%1", ИндексКнопки);
	ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаНижняя);
	ЭлементФормы.Вид 						= ВидПоляФормы.ПолеКартинки;
	ЭлементФормы.Рамка 						= БезРамки;
	ЭлементФормы.ПоложениеЗаголовка 		= ПоложениеЗаголовкаЭлементаФормы.Нет;
	ЭлементФормы.Гиперссылка 				= Истина;
	ЭлементФормы.ПутьКДанным 				= ПутьКДаннымПустойКартинки;
	ЭлементФормы.Ширина						= 1;
	ЭлементФормы.УстановитьДействие("Нажатие", ИмяКомандыНажатия);
	
	ИмяЭлемента = СтрШаблон("Избранное_Элемент11_%1", ИндексКнопки);
	ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаНижняя);
	ЭлементФормы.Вид 						= ВидПоляФормы.ПолеКартинки;
	ЭлементФормы.Рамка 						= БезРамки;
	ЭлементФормы.ПоложениеЗаголовка 		= ПоложениеЗаголовкаЭлементаФормы.Нет;
	ЭлементФормы.Гиперссылка 				= Истина;
	ЭлементФормы.ПутьКДанным 				= ПутьКДаннымПустойКартинки;
	ЭлементФормы.АвтоМаксимальнаяШирина		= Ложь;
	ЭлементФормы.Ширина						= 7;
	ЭлементФормы.МаксимальнаяШирина			= 7;
	ЭлементФормы.РастягиватьПоГоризонтали	= Истина;
	ЭлементФормы.Шрифт						= ШрифтЦены;
	ЭлементФормы.УстановитьДействие("Нажатие", ИмяКомандыНажатия);
	
КонецПроцедуры

Функция ПараметрыРазмеровКомандУправленияЧекомДляОбычногоРежима(ПараметрыУвеличенногоИнтерфейса)
	
	ПараметрыРазмеров = Новый Структура;
	
	ПараметрыРазмеров.Вставить("ВысотаКоманды", ПараметрыУвеличенногоИнтерфейса.ВысотаКоманды);
	ПараметрыРазмеров.Вставить("ШиринаКоманды", ПараметрыУвеличенногоИнтерфейса.ШиринаКоманды);
	ПараметрыРазмеров.Вставить("ВысотаКомандыОперации", ПараметрыУвеличенногоИнтерфейса.ВысотаКоманды);
	ПараметрыРазмеров.Вставить("ШиринаКомандыОперации", ПараметрыУвеличенногоИнтерфейса.ШиринаКоманды);
	
	Возврат ПараметрыРазмеров;
	
КонецФункции

Функция ПринадлежитГруппеОпераций(Элементы, ЭлементФормы)
	
	РезультатФункции = Ложь;
	ГруппаОперации = Элементы.ГруппаОперации;
	Если ЭлементФормы.Родитель = ГруппаОперации
		Или (ТипЗнч(ЭлементФормы.Родитель) = Тип("ГруппаФормы") И ЭлементФормы.Родитель.Родитель = ГруппаОперации) Тогда
		
		РезультатФункции = Истина;
		
	КонецЕсли;
	Возврат РезультатФункции;
	
КонецФункции

Функция ИгнорироватьЭлементДляУвеличенияРазмера(РежимКСО, Элементы, ЭлементФормы)
	
	РезультатФункции = Ложь;

	Если (Не ТипЗнч(ЭлементФормы) = Тип("КнопкаФормы")) Или ЭлементФормы.Вид = ВидКнопкиФормы.Гиперссылка 
		Или ЭлементФормы = Элементы.ЦифроваяПанельПоиск
		Или (РежимКСО И ПринадлежитГруппеОпераций(Элементы, ЭлементФормы)) Тогда
		
		РезультатФункции = Истина;
		
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ДобавитьРядКнопокПлиток(РодительскийЭлемент, ИндексРяда, Элементы)
	
	ИмяРяда = СтрШаблон("ПлиткаРядКнопок_%1", ИндексРяда);
	НовыйРяд = Элементы.Найти(ИмяРяда);
	Если НовыйРяд = Неопределено Тогда
		НовыйРяд = Элементы.Добавить(ИмяРяда, Тип("ГруппаФормы"), РодительскийЭлемент);
	КонецЕсли;
	НовыйРяд.Вид 						= ВидГруппыФормы.ОбычнаяГруппа;
	НовыйРяд.Группировка				= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НовыйРяд.ОтображатьЗаголовок 		= Ложь;
	НовыйРяд.РастягиватьПоГоризонтали	= Истина;
	НовыйРяд.РастягиватьПоВертикали		= Истина;
	НовыйРяд.Высота 					= 10;
	
	Возврат НовыйРяд;
	
КонецФункции

Функция ПолучитьШрифтПлиткиПоУмолчанию(Форма)
	
	ШрифтТекстом = "";
	ПалитраФормы = Неопределено;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "СтруктураПлиточногоИнтерфейсаПодбора") Тогда
		ШрифтТекстом
			= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Форма.СтруктураПлиточногоИнтерфейсаПодбора, "ШрифтЭлементовПодбора");
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ТекущаяНастройкаРМК") Тогда
		ШрифтТекстом = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Форма.ТекущаяНастройкаРМК,
			"СтруктураПлиточногоИнтерфейсаПодбора.ШрифтЭлементовПодбора");
	КонецЕсли;
	БазовыйШрифт = ШрифтыСтиля.ШрифтОбычныйПолужирный12РМК;
	Если ЗначениеЗаполнено(ШрифтТекстом) Тогда
		БазовыйШрифт = ОбщегоНазначения.ЗначениеИзСтрокиXML(ШрифтТекстом);
	КонецЕсли;
	Возврат БазовыйШрифт;
	
КонецФункции

Процедура ДобавитьКнопкуВРядПлиток(РядКнопок, ИндексКнопки, Форма, БазовыйШрифт)
	
	ЭлементыФормы = Форма.Элементы;
	ИмяКомандыНажатия = "Подключаемый_ПлиткаВыбор";
	ЦветФона = ЦветаСтиля.ЦветФонаФормы;
	ЦветШрифта = ЦветаСтиля.ЦветФонаФормы;
	ШрифтЦены = Новый Шрифт(БазовыйШрифт, , , Ложь);
	ШрифтЛинии = Новый Шрифт(, , 12);
	Шрифт1 = Новый Шрифт(БазовыйШрифт, , 1, , , , ,1);
	ОтображатьОстаток = Ложь;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ОтображатьОстаток") Тогда
		ОтображатьОстаток = Форма.ОтображатьОстаток;
	КонецЕсли;
	
	ИмяЭлемента = СтрШаблон("Плитка_Элемент01_%1", ИндексКнопки);
	
	ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), РядКнопок);
	ЭлементФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ЭлементФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ЭлементФормы.ОтображатьЗаголовок = Ложь; 
	ЭлементФормы.РастягиватьПоГоризонтали = Истина;
	ЭлементФормы.РастягиватьПоВертикали = Истина;
	ЭлементФормы.Ширина = 26;
	ЭлементФормы.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
	ЭлементФормы.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
	ГруппаОсновная = ЭлементФормы;
	
	// Полоса выбранной плитки слева
	ИмяЭлемента = СтрШаблон("Плитка_Элемент02_%1", ИндексКнопки);
	ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), ГруппаОсновная);
	ЭлементФормы.Вид = ВидГруппыФормы.Страницы;
	ЭлементФормы.Отображениестраниц = ОтображениеСтраницФормы.Нет;
	Страницы = ЭлементФормы;
	
	ИмяЭлемента = СтрШаблон("Плитка_Элемент03_%1", ИндексКнопки);
	ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), Страницы);
	ЭлементФормы.Вид = ВидГруппыФормы.Страница;
	ЭлементФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Страница = ЭлементФормы;
	
	ИмяЭлемента = СтрШаблон("Плитка_Элемент04_%1", ИндексКнопки);
	ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), Страница);
	ЭлементФормы.Вид = ВидДекорацииФормы.Надпись;
	ЭлементФормы.Шрифт = ШрифтЛинии;
	ЭлементФормы.ЦветФона = ЦветФона;
	ЭлементФормы.РастягиватьПоВертикали = Истина;
	ЭлементФормы.Заголовок = " ";
	
	ИмяЭлемента = СтрШаблон("Плитка_Элемент05_%1", ИндексКнопки);
	ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), Страницы);
	ЭлементФормы.Вид = ВидГруппыФормы.Страница;
	ЭлементФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Страница = ЭлементФормы;
	
	ИмяЭлемента = СтрШаблон("Плитка_Элемент06_%1", ИндексКнопки);
	ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), Страница);
	ЭлементФормы.Вид = ВидДекорацииФормы.Надпись;
	ЭлементФормы.Шрифт = ШрифтЛинии;
	ЭлементФормы.ЦветФона = ЦветаСтиля.ЦветАктивизированногоПунктаРМК;
	ЭлементФормы.РастягиватьПоВертикали = Истина;
	ЭлементФормы.Заголовок = " ";
	
	// Страницы элемента, папки и пустой плитки
	ИмяЭлемента = СтрШаблон("Плитка_Элемент60_%1", ИндексКнопки);
	ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), ГруппаОсновная);
	ЭлементФормы.Вид = ВидГруппыФормы.Страницы;
	ЭлементФормы.Отображениестраниц = ОтображениеСтраницФормы.Нет;
	СтраницыФон = ЭлементФормы;
	
	ИмяЭлемента = СтрШаблон("Плитка_Элемент63_%1", ИндексКнопки);
	ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), СтраницыФон);
	ЭлементФормы.Вид = ВидГруппыФормы.Страница;
	ЭлементФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Страница = ЭлементФормы;
	
	ИмяЭлемента = СтрШаблон("Плитка_Элемент68_%1", ИндексКнопки);
	ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), Страница);
	ЭлементФормы.Вид = ВидДекорацииФормы.Надпись;
	ЭлементФормы.ЦветФона = ЦветФона;
	ЭлементФормы.РастягиватьПоВертикали = Истина;
	ЭлементФормы.РастягиватьПоГоризонтали = Истина;
	ЭлементФормы.Заголовок = " ";
	
	ИмяЭлемента = СтрШаблон("Плитка_Элемент61_%1", ИндексКнопки);
	ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), СтраницыФон);
	ЭлементФормы.Вид = ВидГруппыФормы.Страница;
	ЭлементФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ЭлементФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ЭлементФормы.РастягиватьПоГоризонтали = Истина;
	ЭлементФормы.РастягиватьПоВертикали = Истина;
	ЭлементФормы.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
	ЭлементФормы.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
	ЭлементФормы.ЦветФона = ЦветаСтиля.ЦветАктивнойКнопкиРМК;
	ГруппаДанных = ЭлементФормы;
	
	// Страницы поля текста
	ИмяЭлемента = СтрШаблон("Плитка_Элемент20_%1", ИндексКнопки);
	ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), ГруппаДанных);
	ЭлементФормы.Вид = ВидГруппыФормы.Страницы;
	ЭлементФормы.Отображениестраниц = ОтображениеСтраницФормы.Нет;
	Страницы = ЭлементФормы;
	
	ИмяЭлемента = СтрШаблон("Плитка_Элемент21_%1", ИндексКнопки);
	ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), Страницы);
	ЭлементФормы.Вид = ВидГруппыФормы.Страница;
	ЭлементФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Страница = ЭлементФормы;
	
	ИмяЭлемента = СтрШаблон("Плитка_Элемент25_%1", ИндексКнопки);
	ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), Страница);
	ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементФормы.ПутьКДанным = СтрШаблон("ДанныеКнопокПлиток[%1].ИмяЭлемента", ИндексКнопки);
	ЭлементФормы.ПоложениеЗаголовка 		= ПоложениеЗаголовкаЭлементаФормы.Нет;
	ЭлементФормы.ЦветРамки = ЦветФона;
	ЭлементФормы.МногострочныйРежим = Истина;
	ЭлементФормы.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
	ЭлементФормы.УстановитьДействие("АвтоПодбор", ИмяКомандыНажатия);
	ЭлементФормы.РастягиватьПоВертикали = Истина;
	ЭлементФормы.РастягиватьПоГоризонтали = Истина;
	ЭлементФормы.Шрифт = БазовыйШрифт;
	ЭлементФормы.Высота = 2;
	ЭлементФормы.АвтоМаксимальнаяВысота = Ложь;
	ЭлементФормы.МаксимальнаяВысота = 2;
	ЭлементФормы.РедактированиеТекста = Ложь;
	
	ИмяЭлемента = СтрШаблон("Плитка_Элемент22_%1", ИндексКнопки);
	ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), Страницы);
	ЭлементФормы.Вид = ВидГруппыФормы.Страница;
	ЭлементФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Страница = ЭлементФормы;
	
	ИмяЭлемента = СтрШаблон("Плитка_Элемент26_%1", ИндексКнопки);
	ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), Страница);
	ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементФормы.ПутьКДанным = СтрШаблон("ДанныеКнопокПлиток[%1].ИмяЭлемента", ИндексКнопки);
	ЭлементФормы.ПоложениеЗаголовка 		= ПоложениеЗаголовкаЭлементаФормы.Нет;
	ЭлементФормы.ЦветРамки = ЦветФона;
	ЭлементФормы.МногострочныйРежим = Истина;
	ЭлементФормы.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
	ЭлементФормы.УстановитьДействие("АвтоПодбор", ИмяКомандыНажатия);
	ЭлементФормы.РастягиватьПоВертикали = Истина;
	ЭлементФормы.РастягиватьПоГоризонтали = Истина;
	ЭлементФормы.Шрифт = БазовыйШрифт;
	ЭлементФормы.Высота = 2;
	ЭлементФормы.АвтоМаксимальнаяВысота = Ложь;
	ЭлементФормы.МаксимальнаяВысота = 2;
	ЭлементФормы.РедактированиеТекста = Ложь;
	ГруппаДанныхНиз = ГруппаДанных;
	
	ИмяЭлемента = СтрШаблон("Плитка_Элемент09_%1", ИндексКнопки);
	ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаДанныхНиз);
	ЭлементФормы.Вид = ВидПоляФормы.ПолеКартинки;
	ЭлементФормы.Высота = 1;
	ЭлементФормы.Ширина = 1;
	ЭлементФормы.Гиперссылка = Истина;
	ЭлементФормы.РастягиватьПоВертикали = Истина;
	ЭлементФормы.РастягиватьПоГоризонтали = Истина;
	ЭлементФормы.Видимость = Истина;
	ЭлементФормы.ПутьКДанным = СтрШаблон("ДанныеКнопокПлиток[%1].АдресИзображения", ИндексКнопки);
	ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ЭлементФормы.РазмерКартинки = РазмерКартинки.Пропорционально;
	ЭлементФормы.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки);
	ЭлементФормы.УстановитьДействие("Нажатие", ИмяКомандыНажатия);
	
	Если ОтображатьОстаток Тогда
		
		ИмяЭлемента = СтрШаблон("Плитка_Элемент13_%1", ИндексКнопки);
		ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), ГруппаДанныхНиз);
		ЭлементФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ЭлементФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		ЭлементФормы.ОтображатьЗаголовок = Ложь;
		ЭлементФормы.РастягиватьПоГоризонтали = Истина;
		ЭлементФормы.РастягиватьПоВертикали = Истина;
		ЭлементФормы.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
		ЭлементФормы.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
		ГруппаДанныхЦенаКоличество = ЭлементФормы;
		
		ИмяЭлемента = СтрШаблон("Плитка_Элемент12_%1", ИндексКнопки);
		ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаДанныхЦенаКоличество);
		ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементФормы.РастягиватьПоГоризонтали = Истина;
		ЭлементФормы.РастягиватьПоВертикали = Ложь;
		ЭлементФормы.Шрифт = ШрифтЦены;
		ЭлементФормы.Высота = 1;
		ЭлементФормы.Ширина = 1;
		ЭлементФормы.ПутьКДанным = СтрШаблон("ДанныеКнопокПлиток[%1].КоличествоТекст", ИндексКнопки);
		ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		ЭлементФормы.ЦветФона = ЦветаСтиля.ЦветАктивнойКнопкиРМК;
		ЭлементФормы.ЦветРамки = ЦветаСтиля.ЦветАктивнойКнопкиРМК;
		ЭлементФормы.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Лево;
		ЭлементФормы.УстановитьДействие("АвтоПодбор", ИмяКомандыНажатия);
		
		ИмяЭлемента = СтрШаблон("Плитка_Элемент11_%1", ИндексКнопки);
		ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаДанныхЦенаКоличество);
		ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементФормы.РастягиватьПоГоризонтали = Истина;
		ЭлементФормы.РастягиватьПоВертикали = Ложь;
		ЭлементФормы.Шрифт = ШрифтЦены;
		ЭлементФормы.Высота = 1;
		ЭлементФормы.Ширина = 1;
		ЭлементФормы.ПутьКДанным = СтрШаблон("ДанныеКнопокПлиток[%1].ЦенаТекст", ИндексКнопки);
		ЭлементФормы.ПоложениеЗаголовка 		= ПоложениеЗаголовкаЭлементаФормы.Нет;
		ЭлементФормы.ЦветФона = ЦветаСтиля.ЦветАктивнойКнопкиРМК;
		ЭлементФормы.ЦветРамки = ЦветаСтиля.ЦветАктивнойКнопкиРМК;
		ЭлементФормы.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Право;
		ЭлементФормы.УстановитьДействие("АвтоПодбор", ИмяКомандыНажатия);
		
	Иначе
		
		ИмяЭлемента = СтрШаблон("Плитка_Элемент11_%1", ИндексКнопки);
		ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаДанныхНиз);
		ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;  
		ЭлементФормы.РастягиватьПоГоризонтали = Истина;
		ЭлементФормы.РастягиватьПоВертикали = Ложь;
		ЭлементФормы.Шрифт = ШрифтЦены;
		ЭлементФормы.Высота = 1;
		ЭлементФормы.Ширина = 1;
		ЭлементФормы.ПутьКДанным = СтрШаблон("ДанныеКнопокПлиток[%1].ЦенаТекст", ИндексКнопки);
		ЭлементФормы.ПоложениеЗаголовка 		= ПоложениеЗаголовкаЭлементаФормы.Нет;
		ЭлементФормы.ЦветФона = ЦветаСтиля.ЦветАктивнойКнопкиРМК;
		ЭлементФормы.ЦветРамки = ЦветаСтиля.ЦветАктивнойКнопкиРМК;
		ЭлементФормы.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
		ЭлементФормы.УстановитьДействие("АвтоПодбор", ИмяКомандыНажатия);
		
	КонецЕсли;
	
	ИмяЭлемента = СтрШаблон("Плитка_Элемент62_%1", ИндексКнопки);
	ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), СтраницыФон);
	ЭлементФормы.Вид = ВидГруппыФормы.Страница;
	ЭлементФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ЭлементФормы.РастягиватьПоГоризонтали = Истина;
	ЭлементФормы.РастягиватьПоВертикали = Истина;
	ЭлементФормы.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
	ЭлементФормы.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
	ЭлементФормы.ЦветФона = ЦветаСтиля.ЦветПапкиКнопкиРМК;
	ГруппаДанных = ЭлементФормы;
	
	// Группа наименования и иконка справа
	ИмяЭлемента = СтрШаблон("Плитка_Элемент66_%1", ИндексКнопки);
	ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), ГруппаДанных);
	ЭлементФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ЭлементФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ЭлементФормы.ОтображатьЗаголовок = Ложь; 
	ЭлементФормы.РастягиватьПоГоризонтали = Истина;
	ЭлементФормы.РастягиватьПоВертикали = Истина;
	ЭлементФормы.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
	ЭлементФормы.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
	ГруппаДанныхВерх = ЭлементФормы;
	
	// Страницы поля текста
	ИмяЭлемента = СтрШаблон("Плитка_Элемент30_%1", ИндексКнопки);
	ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), ГруппаДанныхВерх);
	ЭлементФормы.Вид = ВидГруппыФормы.Страницы;
	ЭлементФормы.Отображениестраниц = ОтображениеСтраницФормы.Нет;
	Страницы = ЭлементФормы;
	
	ИмяЭлемента = СтрШаблон("Плитка_Элемент31_%1", ИндексКнопки);
	ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), Страницы);
	ЭлементФормы.Вид = ВидГруппыФормы.Страница;
	ЭлементФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Страница = ЭлементФормы;
	
	ИмяЭлемента = СтрШаблон("Плитка_Элемент35_%1", ИндексКнопки);
	ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), Страница);
	ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементФормы.ПутьКДанным = СтрШаблон("ДанныеКнопокПлиток[%1].ИмяЭлемента", ИндексКнопки);
	ЭлементФормы.ПоложениеЗаголовка 		= ПоложениеЗаголовкаЭлементаФормы.Нет;
	ЭлементФормы.ЦветРамки = ЦветФона;
	ЭлементФормы.МногострочныйРежим = Истина;
	ЭлементФормы.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
	ЭлементФормы.УстановитьДействие("АвтоПодбор", ИмяКомандыНажатия);
	ЭлементФормы.РастягиватьПоВертикали = Истина;
	ЭлементФормы.РастягиватьПоГоризонтали = Истина;
	ЭлементФормы.Шрифт = БазовыйШрифт;
	ЭлементФормы.Высота = 2;
	ЭлементФормы.АвтоМаксимальнаяВысота = Ложь;
	ЭлементФормы.МаксимальнаяВысота = 2;
	ЭлементФормы.РедактированиеТекста = Ложь;
	
	ИмяЭлемента = СтрШаблон("Плитка_Элемент32_%1", ИндексКнопки);
	ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), Страницы);
	ЭлементФормы.Вид = ВидГруппыФормы.Страница;
	ЭлементФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Страница = ЭлементФормы;
	
	ИмяЭлемента = СтрШаблон("Плитка_Элемент36_%1", ИндексКнопки);
	ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), Страница);
	ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементФормы.ПутьКДанным = СтрШаблон("ДанныеКнопокПлиток[%1].ИмяЭлемента", ИндексКнопки);
	ЭлементФормы.ПоложениеЗаголовка 		= ПоложениеЗаголовкаЭлементаФормы.Нет;
	ЭлементФормы.ЦветРамки = ЦветФона;
	ЭлементФормы.МногострочныйРежим = Истина;
	ЭлементФормы.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
	ЭлементФормы.УстановитьДействие("АвтоПодбор", ИмяКомандыНажатия);
	ЭлементФормы.РастягиватьПоВертикали = Истина;
	ЭлементФормы.РастягиватьПоГоризонтали = Истина;
	ЭлементФормы.Шрифт = БазовыйШрифт;
	ЭлементФормы.Высота = 2;
	ЭлементФормы.АвтоМаксимальнаяВысота = Ложь;
	ЭлементФормы.МаксимальнаяВысота = 2;
	ЭлементФормы.РедактированиеТекста = Ложь;
	
	ИмяЭлемента = СтрШаблон("Плитка_Элемент40_%1", ИндексКнопки);
	ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), ГруппаДанныхВерх);
	ЭлементФормы.Вид = ВидГруппыФормы.Страницы;
	ЭлементФормы.Отображениестраниц = ОтображениеСтраницФормы.Нет;
	Страницы = ЭлементФормы;
	
	ИмяЭлемента = СтрШаблон("Плитка_Элемент41_%1", ИндексКнопки);
	ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), Страницы);
	ЭлементФормы.Вид = ВидГруппыФормы.Страница;
	ЭлементФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Страница = ЭлементФормы;
	
	ИмяЭлемента = СтрШаблон("Плитка_Элемент45_%1", ИндексКнопки);
	ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), Страница);
	ЭлементФормы.Вид = ВидДекорацииФормы.Картинка;
	ЭлементФормы.Высота = 1;
	ЭлементФормы.Ширина = 2;
	ЭлементФормы.Гиперссылка = Истина;
	ЭлементФормы.РастягиватьПоВертикали = Ложь;
	ЭлементФормы.РастягиватьПоГоризонтали = Ложь;
	ЭлементФормы.Картинка = БиблиотекаКартинок.УровеньВниз;
	ЭлементФормы.РазмерКартинки = РазмерКартинки.Пропорционально;
	ЭлементФормы.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки);
	ЭлементФормы.УстановитьДействие("Нажатие", ИмяКомандыНажатия);
	
	ИмяЭлемента = СтрШаблон("Плитка_Элемент42_%1", ИндексКнопки);
	ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), Страницы);
	ЭлементФормы.Вид = ВидГруппыФормы.Страница;
	ЭлементФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Страница = ЭлементФормы;
	
	ИмяЭлемента = СтрШаблон("Плитка_Элемент46_%1", ИндексКнопки);
	ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), Страница);
	ЭлементФормы.Вид = ВидДекорацииФормы.Картинка;
	ЭлементФормы.Высота = 1;
	ЭлементФормы.Ширина = 2;
	ЭлементФормы.Гиперссылка = Истина;
	ЭлементФормы.РастягиватьПоВертикали = Ложь;
	ЭлементФормы.РастягиватьПоГоризонтали = Ложь;
	ЭлементФормы.Картинка = БиблиотекаКартинок.УровеньВверх;
	ЭлементФормы.РазмерКартинки = РазмерКартинки.Пропорционально;
	ЭлементФормы.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки);
	ЭлементФормы.УстановитьДействие("Нажатие", ИмяКомандыНажатия);
	ГруппаДанныхНиз = ГруппаДанных;
	
	ИмяЭлемента = СтрШаблон("Плитка_Элемент69_%1", ИндексКнопки);
	ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаДанныхНиз);
	ЭлементФормы.Вид = ВидПоляФормы.ПолеКартинки;
	ЭлементФормы.Высота = 1;
	ЭлементФормы.Ширина = 1;
	ЭлементФормы.Гиперссылка = Истина;
	ЭлементФормы.РастягиватьПоВертикали = Истина;
	ЭлементФормы.РастягиватьПоГоризонтали = Истина;
	ЭлементФормы.Видимость = Истина;
	ЭлементФормы.ПутьКДанным = СтрШаблон("ДанныеКнопокПлиток[%1].АдресИзображенияГруппы", ИндексКнопки);
	ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ЭлементФормы.РазмерКартинки = РазмерКартинки.Пропорционально;
	ЭлементФормы.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки);
	ЭлементФормы.УстановитьДействие("Нажатие", ИмяКомандыНажатия);
	
КонецПроцедуры

Процедура ЗаполнитьСоставПалитрыИзбранногоПоДаннымДереваВУзле(СоставПалитры, ЭлементыДерева, НомерКатегории, НомерСтроки)
	
	ТекущийИндексПозиции = 0;
	ТекущийНомерКатегории = НомерКатегории;
	
	Для Каждого ЭлементДерева Из ЭлементыДерева Цикл
		
		НовыйЭлементСостава = СоставПалитры.Добавить();
		ЗаполнитьЗначенияСвойств(НовыйЭлементСостава, ЭлементДерева);
		Если Не НомерСтроки = Неопределено Тогда
			НомерСтроки = НомерСтроки + 1;
			НовыйЭлементСостава.НомерСтроки = ЭлементДерева.НомерСтроки;
		КонецЕсли;
		ТекущийИндексПозиции = ТекущийИндексПозиции + 1;
		НовыйЭлементСостава.ИндексПозиции = ТекущийИндексПозиции;
		
		НовыйЭлементСостава.НомерКатегорииРазмещения = НомерКатегории;
		
		ЭтоЭлементГруппа = ЭлементДерева.ЭтоКатегория ИЛИ ЭлементДерева.ИмеетсяВложенность;
		Если ЭтоЭлементГруппа И НЕ ЗначениеЗаполнено(ЭлементДерева.ВидМодификатора) Тогда
			
			ТекущийНомерКатегории = ТекущийНомерКатегории + 1;
			НовыйЭлементСостава.НомерКатегории = ТекущийНомерКатегории;
			ЗаполнитьСоставПалитрыИзбранногоПоДаннымДереваВУзле(СоставПалитры,
				ЭлементДерева.Строки, ТекущийНомерКатегории, НомерСтроки);
			
		КонецЕсли;
		
		ИменаСвойствЗаполнения = "ИндексПозиции, НомерКатегорииРазмещения, НомерКатегории";
		ЗаполнитьЗначенияСвойств(ЭлементДерева,
			НовыйЭлементСостава, ИменаСвойствЗаполнения);
			
		НовыйЭлементСостава.ЦветШрифта = ОбщегоНазначения.ЗначениеВСтрокуXML(ЭлементДерева.ЦветШрифта);
		НовыйЭлементСостава.ЦветФона = ОбщегоНазначения.ЗначениеВСтрокуXML(ЭлементДерева.ЦветФона);
		
	КонецЦикла;
	
	НомерКатегории = ТекущийНомерКатегории;
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыЭлементовГруппыВидовОплат(Элементы, ПараметрыЭлементов)
	
	ДанныеЭлемента = ДобавитьЭлементФормыВМассивИзменяемыхПараметров(ПараметрыЭлементов, Элементы.СжатаяПанельСдача);
	ДобавитьИзменяемыеПараметрыЭлементаФормы(ДанныеЭлемента, "Видимость", Ложь, Истина);
	
КонецПроцедуры

Функция ЭтоРежимРаботыПослеВводаТоваров(Форма)
	РезультатФункции = Не (Форма.РежимРаботыСЧеком = Форма.РежимыРаботыСЧеком.ВводТоваров
						Или Форма.РежимРаботыСЧеком = Форма.РежимыРаботыСЧеком.ЧекПустой);
	Возврат РезультатФункции;
КонецФункции

Функция КоличествоДоступныхВидовОплат(Форма)
	КоличествоВидовОплат = 0;
	МассивГруппИсключений = Новый Массив;
	МассивГруппИсключений.Добавить("ГруппаКоманднаяПанельКарта");
	МассивГруппИсключений.Добавить("СжатаяПанельСдача");
	
	Элементы = Форма.Элементы;

	Для Каждого ГруппаВидаОплаты Из Элементы.ГруппаВидовОплат.ПодчиненныеЭлементы Цикл
		Если МассивГруппИсключений.Найти(ГруппаВидаОплаты.Имя) = Неопределено И ГруппаВидаОплаты.Видимость Тогда
			КоличествоВидовОплат = КоличествоВидовОплат + 1;
		КонецЕсли;
	КонецЦикла;

	ГруппаСлоевВспомогательнаяПанель = Элементы.ГруппаСлоевЛеваяВерхняяВспомогательнаяПанель;
	Если ИнтерфейсРМКСлужебныйКлиентСервер.ПолучитьТекущийСлойГруппы(ГруппаСлоевВспомогательнаяПанель)
			= Элементы.ГруппаПоискСертификатов Тогда
			
		КоличествоВидовОплат = КоличествоВидовОплат + Форма.ТаблицаПодарочныхСертификатов.Количество();
			
	КонецЕсли;
	
	Возврат КоличествоВидовОплат;
КонецФункции

Процедура НастроитьИспользованиеКнопкиВыбораПоля(Элементы, ИмяПоля, ПоказатьКнопкуВыбора, УвеличитьШирину)
	
	ДельтаШирины = 2;
	Элементы[ИмяПоля].КнопкаВыбора = ПоказатьКнопкуВыбора;
	Если УвеличитьШирину Тогда
		Элементы[ИмяПоля].Ширина = Элементы[ИмяПоля].Ширина + ДельтаШирины;
	КонецЕсли;
	
КонецПроцедуры

Функция ОпределитьДоступноеКоличествоВидовОплатыЦифровойПанели(Форма)
	РезультатФункции = 5;
	
	Если Форма.ВидОтображения = Перечисления.ВидыОтображения.Уменьшенный Тогда
		РезультатФункции = 6;
	ИначеЕсли Форма.ВидОтображения = Перечисления.ВидыОтображения.Увеличенный Тогда
		РезультатФункции = 4;
	КонецЕсли;
	Если Форма.РежимКассыСамообслуживания Тогда
		РезультатФункции = РезультатФункции + 1;
	КонецЕсли;
	
	Возврат РезультатФункции;
КонецФункции

Функция НеобходимоСжиматьПанельИтогов(Форма, ТребуетсяГоризонтальноеСжатиеВсегда)
	РезультатФункции = Ложь;
	ДопустимоеКоличествоВидовОплатЦифровойПанели = ОпределитьДоступноеКоличествоВидовОплатыЦифровойПанели(Форма);
	
	Если Форма.ВертикальнаяОриентация Или ТребуетсяГоризонтальноеСжатиеВсегда
		Или (ЭтоРежимРаботыПослеВводаТоваров(Форма)
			И КоличествоДоступныхВидовОплат(Форма) >= ДопустимоеКоличествоВидовОплатЦифровойПанели) Тогда
			
		РезультатФункции = Истина;
			
	КонецЕсли;
	
	Возврат РезультатФункции;
КонецФункции

Процедура ДобавитьОтборРазделаГорячихКлавиш(Элементы, Элемент)
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение =
		Новый ПолеКомпоновкиДанных(Элементы.ДеревоГорячиеКлавишиНомерСтроки.ПутьКДанным);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;
	
КонецПроцедуры

Процедура ДобавитьОтборНекорректныхКомбинацийГорячихКлавиш(Элемент, ТиНарушения)
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоГорячиеКлавиши.ТипНарушения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ОтборЭлемента.ПравоеЗначение = ТиНарушения;
	
КонецПроцедуры

Процедура ДобавитьОтборНекорректныхКомбинацийГорячихКлавишКупюр(Элемент, ТиНарушения)
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НастройкаРМК.ВводНаличных.ТипНарушения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = ТиНарушения;
	
КонецПроцедуры

Функция ПодготовитьСочетаниеГорячейКлавиши(АкселераторыКупюр, КлавишаСтрокой)
	СочетаниеКлавиш = Неопределено;
	ПустаяКлавиша = ИнтерфейсРМКСлужебныйКлиентСервер.ПредставлениеПустойКлавиши();
	Если ЗначениеЗаполнено(КлавишаСтрокой) И Не КлавишаСтрокой = ПустаяКлавиша Тогда
		
		ДополнительнаяКлавиша = Клавиша[КлавишаСтрокой];
		СочетаниеКлавиш = Новый СочетаниеКлавиш(ДополнительнаяКлавиша,
			АкселераторыКупюр.Alt, АкселераторыКупюр.Ctrl, АкселераторыКупюр.Shift);
				
	КонецЕсли;
	Возврат СочетаниеКлавиш;
КонецФункции

Процедура НастроитьЭлементыРаботыСДисконтнымиКартами(Форма)
	
	Элементы = Форма.Элементы;
	
	ПоказыватьДанныеПокупателя = (Форма.ВводДисконтныхКарт Или Не Форма.РежимКассыСамообслуживания);
	
	Элементы.ВвестиДанныеПокупателя.Видимость = ПоказыватьДанныеПокупателя;
	Элементы.РежимПанелиДанныеПокупателя.Видимость = ПоказыватьДанныеПокупателя;
	Элементы.СтрокаПоискаКарты.Видимость = Форма.ВводДисконтныхКарт;
	Элементы.ДекорацияПоискКартыЗаголовок.Видимость = Форма.ВводДисконтныхКарт;
	
	ЗаполнитьРежимыПанелиДанныхПокупателя(Форма);
	
КонецПроцедуры

Процедура ЗаполнитьРежимыПанелиДанныхПокупателя(Форма)
	
	ШиринаЭлементаВРежимеКСО = 12;
	ЭлементыФормы = Форма.Элементы;
	Если Форма.РежимКассыСамообслуживания Или Не Форма.ВводДисконтныхКарт Тогда
		СписокВыбораРежимов = Форма.Элементы.РежимПанелиДанныеПокупателя.СписокВыбора;
		СписокВыбораРежимов.Очистить();
		Если Форма.ВводДисконтныхКарт Или Не Форма.РежимКассыСамообслуживания Тогда
			ЗаголовокСтраницыПоиска = ?(Форма.ВводДисконтныхКарт, НСтр("ru='Поиск карты'"), НСтр("ru='Выбор покупателя'"));
			ЭлементыФормы.РежимПанелиДанныеПокупателя.СписокВыбора.Добавить(0, ЗаголовокСтраницыПоиска);
		КонецЕсли;
		ЭлементыФормы.РежимПанелиДанныеПокупателя.СписокВыбора.Добавить(2, НСтр("ru='Отправка чека'"));
		ЭлементыФормы.РежимПанелиДанныеПокупателя.ШиринаЭлемента = ШиринаЭлементаВРежимеКСО;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьСлужебныеГруппыВесовогоТовараВОпорныеДанные(Форма)
	
	ИмяПапкиДругихВесовыхТоваров = ИнтерфейсРМКСлужебныйКлиентСервер.ИмяГруппыДругихВесовыхТоваров();
	ИсточникиДанныхПлитки = ИнтерфейсРМКСлужебныйКлиентСервер.ИсточникиДанныхДляПлитки();
	ИсточникСлужебныеГруппы = ИсточникиДанныхПлитки.СлужебныеГруппы;
	
	ОтборДанных = Новый Структура("ИсточникПлитки", ИсточникСлужебныеГруппы);
	СлужебныеСтроки = Форма.ОпорныеДанные.НайтиСтроки(ОтборДанных);
	Если СлужебныеСтроки.Количество() = 0 Тогда
		ДобавитьСлужебнуюГруппуВОпорныеДанные(Форма, ИмяПапкиДругихВесовыхТоваров, Ложь, ИсточникСлужебныеГруппы);
		ДобавитьСлужебнуюГруппуВОпорныеДанные(Форма, ИмяПапкиДругихВесовыхТоваров, Истина, ИсточникСлужебныеГруппы);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьСлужебнуюГруппуВОпорныеДанные(Форма, ИмяЭлемента, ОбратнаяГруппа, ИсточникПлитки)
	
	ОпорныеДанные = Форма.ОпорныеДанные;
	НоваяСтрока = ОпорныеДанные.Добавить();
	НоваяСтрока.НомерКатегории = ?(ОбратнаяГруппа, 0, 1);
	НоваяСтрока.ИндексПозицииВКатегории = ?(ОбратнаяГруппа, 1, 0);
	НоваяСтрока.НомерКатегорииРазмещенияЭлемента = ?(ОбратнаяГруппа, 1, 0);
	НоваяСтрока.ЭтоКатегория = Истина;
	НоваяСтрока.ЦветФона = Форма.ЦветаФормы.ПапкаКнопка;
	НоваяСтрока.ИмяЭлемента = ИмяЭлемента;
	НоваяСтрока.ДоступностьКоманды = Истина;
	НоваяСтрока.ПервыйИндексПлитки = 0;
	НоваяСтрока.ИмеетсяВложенность = Истина;
	НоваяСтрока.ИсточникПлитки = ИсточникПлитки;
	НоваяСтрока.ЭтоТекущаяКатегория = ?(ОбратнаяГруппа, Истина, Ложь);
	
КонецПроцедуры

Процедура ЗаполнитьОпорныеДанныеСтрокамиПалитры(Форма, Выборка, ПалитраПлитки)

	УникальныйИдентификаторФормы = Форма.УникальныйИдентификатор;
	ИсточникиДанныхПлитки = ИнтерфейсРМКСлужебныйКлиентСервер.ИсточникиДанныхДляПлитки();
	
	КоличествоЭлементовВРяду = 4;
	КоличествоРядовНаСтранице = 3;
	
	Если Не ПалитраПлитки = Неопределено Тогда
		ВертикальнаяОриентация = Ложь;
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ВертикальнаяОриентация") Тогда
			ВертикальнаяОриентация = Форма.ВертикальнаяОриентация;
		КонецЕсли;
		
		Если Не ВертикальнаяОриентация Тогда
			КоличествоЭлементовВРяду = ПалитраПлитки.КоличествоЭлементовВРяду;
			КоличествоРядовНаСтранице = ПалитраПлитки.КоличествоРядов;
			КоличествоЭлементовВРяду = 4;
			КоличествоРядовНаСтранице = 3;
		Иначе
			КоличествоЭлементовВРяду = ПалитраПлитки.КоличествоРядов;
			КоличествоРядовНаСтранице = ПалитраПлитки.КоличествоЭлементовВРяду;
			КоличествоЭлементовВРяду = 3;
			КоличествоРядовНаСтранице = 4;
		КонецЕсли;
	КонецЕсли;
	
	ТекущийНомерКатегорииРазмещения = -1;
	ТекущийИсточникДанныхПалитры = -1;
	ОпорныеДанные = Форма.ОпорныеДанные;
	НовыйИндекс = 0;
	МаксимальноеКоличествоИзбранных = 0;
	
	Пока Выборка.Следующий() Цикл
		
		Если Не ТекущийНомерКатегорииРазмещения = Выборка.НомерКатегорииРазмещенияЭлемента
			Или Не ТекущийИсточникДанныхПалитры = Выборка.ИсточникПлитки Тогда
			НовыйИндекс = 0;
			ТекущийНомерКатегорииРазмещения = Выборка.НомерКатегорииРазмещенияЭлемента;
			ТекущийИсточникДанныхПалитры = Выборка.ИсточникПлитки;
		КонецЕсли;
		
		НовыйИндекс = НовыйИндекс + 1;
		
		СтрокаОпорныхДанных = ОпорныеДанные.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаОпорныхДанных, Выборка);
		СтрокаОпорныхДанных.ИндексПозицииВКатегории = НовыйИндекс;
		СтрокаОпорныхДанных.ДоступностьКоманды = Истина;
		СтрокаОпорныхДанных.ПервыйИндексПлитки = ОпорныеДанные.Индекс(СтрокаОпорныхДанных);
		
		СтрокаОпорныхДанных.ЦветШрифта = ОбщегоНазначения.ЗначениеИзСтрокиXML(Выборка.ЦветШрифта);
		СтрокаОпорныхДанных.ЦветФона = ОбщегоНазначения.ЗначениеИзСтрокиXML(Выборка.ЦветФона);
		
		СсылкаНаПрисоединенныйФайл = Выборка.ИзображениеЭлемента;
		Если Не СсылкаНаПрисоединенныйФайл.Пустая() Тогда
			АдресКартинки = НавигационнаяСсылкаИзображения(СсылкаНаПрисоединенныйФайл, УникальныйИдентификаторФормы);
			СтрокаОпорныхДанных.АдресИзображения = АдресКартинки;
		КонецЕсли;
		
		Если Выборка.ИсточникПлитки = ИсточникиДанныхПлитки.Избранное Тогда
			МаксимальноеКоличествоИзбранных = Макс(МаксимальноеКоличествоИзбранных, СтрокаОпорныхДанных.ИндексПозицииВКатегории);
		КонецЕсли;
		
	КонецЦикла;
	
	Попытка
		КоличествоПлитокНаСтранице = КоличествоЭлементовВРяду * КоличествоРядовНаСтранице;
		КоличествоИзбранныхНаСтранице = 12;
		Фильтр = Новый Структура;
		Фильтр.Вставить("ИмеетсяВложенность", Истина);
		Фильтр.Вставить("ЭтоТекущаяКатегория", Ложь);
		СтрокиПлитки = ОпорныеДанные.НайтиСтроки(Фильтр);
		ФильтрЭлемента = Новый Структура;
		
		Для Каждого СтрокаПлитки Из СтрокиПлитки Цикл
			
			Фильтр = Новый Структура;
			Фильтр.Вставить("ЭтоТекущаяКатегория", Истина);
			Фильтр.Вставить("НомерКатегорииРазмещенияЭлемента", СтрокаПлитки.НомерКатегории);
			Фильтр.Вставить("ИсточникПлитки", СтрокаПлитки.ИсточникПлитки);
			
			КоличествоЭлементовНаСтранице = ?(СтрокаПлитки.ИсточникПлитки = ИсточникиДанныхПлитки.Палитра,
				КоличествоПлитокНаСтранице, КоличествоИзбранныхНаСтранице);
			
			ЭлементыОпорныхДанных = ОпорныеДанные.НайтиСтроки(Фильтр);
			Если ЭлементыОпорныхДанных.Количество() Тогда
				ПервыйЭлементКатегорииПлитки = ЭлементыОпорныхДанных[0];
				СтрокаПлитки.ПервыйИндексПлитки = ОпорныеДанные.Индекс(ПервыйЭлементКатегорииПлитки);
				
				НомерСтраницыВКатегории = Цел((СтрокаПлитки.ИндексПозицииВКатегории-1) / КоличествоЭлементовНаСтранице);
				НачальныйИндексПозицииНаСтранице = (НомерСтраницыВКатегории * КоличествоЭлементовНаСтранице) + 1;
				ФильтрЭлемента.Вставить("НомерКатегорииРазмещенияЭлемента", СтрокаПлитки.НомерКатегорииРазмещенияЭлемента);
				ФильтрЭлемента.Вставить("ИндексПозицииВКатегории", НачальныйИндексПозицииНаСтранице);
				ФильтрЭлемента.Вставить("ИсточникПлитки", СтрокаПлитки.ИсточникПлитки);
				СтрокаНачальнойПозиции = ОпорныеДанные.НайтиСтроки(ФильтрЭлемента)[0];
				ПервыйЭлементКатегорииПлитки.ПервыйИндексПлитки = ОпорныеДанные.Индекс(СтрокаНачальнойПозиции);
			КонецЕсли;
			
		КонецЦикла;
	Исключение
		ОпорныеДанные.Очистить();
	КонецПопытки;
	
	ТекущийПервыйИндексПлитки = -1;
	ТекущаяСтраницаКнопок = -1;
	Фильтр = Новый Структура;
	Фильтр.Вставить("НомерКатегорииРазмещенияЭлемента", 0);
	Фильтр.Вставить("ИндексПозицииВКатегории", 1);
	Фильтр.Вставить("ИсточникПлитки", ИсточникиДанныхПлитки.Палитра);
	СтрокиПлитки = ОпорныеДанные.НайтиСтроки(Фильтр);
	
	Если СтрокиПлитки.Количество() > 0 Тогда
		ТекущийПервыйИндексПлитки = ОпорныеДанные.Индекс(СтрокиПлитки[0]);
	КонецЕсли;
	
	Фильтр.Вставить("ИсточникПлитки", ИсточникиДанныхПлитки.Избранное);
	СтрокиПлитки = ОпорныеДанные.НайтиСтроки(Фильтр);
	
	Если СтрокиПлитки.Количество() > 0 Тогда
		ТекущаяСтраницаКнопок = ОпорныеДанные.Индекс(СтрокиПлитки[0]);
	КонецЕсли;
	
	СтруктураРеквизитовФормы = Новый Структура;
	СтруктураРеквизитовФормы.Вставить("КоличествоЭлементовВРяду", КоличествоЭлементовВРяду);
	СтруктураРеквизитовФормы.Вставить("КоличествоРядовНаСтранице", КоличествоРядовНаСтранице);
	СтруктураРеквизитовФормы.Вставить("ТекущийПервыйИндексПлитки", ТекущийПервыйИндексПлитки);
	СтруктураРеквизитовФормы.Вставить("ТекущаяСтраницаКнопок", ТекущаяСтраницаКнопок);
	СтруктураРеквизитовФормы.Вставить("МаксимальноеКоличествоИзбранныхНаСтранице", МаксимальноеКоличествоИзбранных);
	ЗаполнитьЗначенияСвойств(Форма, СтруктураРеквизитовФормы);
	
КонецПроцедуры

Функция ТекстЗапросаТоваровДляУстройствИзПалитры()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТоварыУстройств.Номенклатура КАК Номенклатура,
	|	ТоварыУстройств.Характеристика КАК Характеристика,
	|	ТоварыУстройств.Весовой КАК Весовой,
	|	ТоварыУстройств.SKU КАК SKU
	|ПОМЕСТИТЬ втТоварыУстройств
	|ИЗ
	|	&ТоварыУстройств КАК ТоварыУстройств
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПалитраТоваровРМКСостав.НомерСтроки КАК НомерСтроки,
	|	ПалитраТоваровРМКСостав.Номенклатура КАК Номенклатура,
	|	ПалитраТоваровРМКСостав.Характеристика КАК Характеристика,
	|	ПалитраТоваровРМКСостав.НомерКатегории КАК НомерКатегории,
	|	ПалитраТоваровРМКСостав.НомерКатегорииРазмещения КАК НомерКатегорииРазмещения,
	|	ПалитраТоваровРМКСостав.ИндексПозиции КАК ИндексПозиции,
	|	ПалитраТоваровРМКСостав.ЦветШрифта КАК ЦветШрифта,
	|	ПалитраТоваровРМКСостав.ЦветФона КАК ЦветФона,
	|	ПалитраТоваровРМКСостав.ЭтоКатегория КАК ЭтоКатегория,
	|	ПалитраТоваровРМКСостав.ИмяЭлемента КАК ИмяЭлемента,
	|	ПалитраТоваровРМКСостав.ИзображениеЭлемента КАК ИзображениеЭлемента,
	|	ПалитраТоваровРМКСостав.ВидМодификатора КАК ВидМодификатора,
	|	ПалитраТоваровРМКСостав.ЭтоКатегория КАК ИмеетсяВложенность,
	|	ПалитраТоваровРМКСостав.Упаковка КАК Упаковка,
	|	ПалитраТоваровРМКСостав.СкрыватьОстаток КАК СкрыватьОстаток,
	|	ЕСТЬNULL(ТоварыУстройств.SKU, 0) КАК SKU,
	|	ЕСТЬNULL(ТоварыУстройств.Весовой, ЛОЖЬ) КАК Весовой
	|ПОМЕСТИТЬ ПалитраТоваровРМКСостав
	|ИЗ
	|	Справочник.ПалитраТоваровРМК.Состав КАК ПалитраТоваровРМКСостав
	|		ЛЕВОЕ СОЕДИНЕНИЕ втТоварыУстройств КАК ТоварыУстройств
	|		ПО (ТоварыУстройств.Номенклатура = ПалитраТоваровРМКСостав.Номенклатура
	|					И ТоварыУстройств.Характеристика = ПалитраТоваровРМКСостав.Характеристика)
	|ГДЕ
	|	ПалитраТоваровРМКСостав.Ссылка = &ПалитраТоваров
	|	И (ЕСТЬNULL(ТоварыУстройств.SKU, 0) > 0 ИЛИ ПалитраТоваровРМКСостав.ЭтоКатегория)
	|	И ПалитраТоваровРМКСостав.ВидМодификатора = ЗНАЧЕНИЕ(Перечисление.ВидыМодификаторовРМК.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПалитраТоваровРМКСостав.НомерСтроки КАК НомерСтроки,
	|	ПалитраТоваровРМКСостав.НомерКатегории КАК НомерКатегории,
	|	ПалитраТоваровРМКСостав.НомерКатегорииРазмещения КАК НомерКатегорииРазмещения,
	|	ПалитраТоваровРМКСостав.ИндексПозиции КАК ИндексПозиции,
	|	ПалитраТоваровРМКСостав.ЭтоКатегория КАК ЭтоКатегория,
	|	ПалитраТоваровРМКСостав.ИмеетсяВложенность КАК ИмеетсяВложенность,
	|	ПалитраТоваровРМКСостав.SKU КАК SKU
	|ПОМЕСТИТЬ СтруктураПалитрыБезМодификаторов
	|ИЗ
	|	ПалитраТоваровРМКСостав КАК ПалитраТоваровРМКСостав
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПалитраТоваровРМКСостав.НомерСтроки КАК НомерСтроки,
	|	0 КАК НомерКатегории,
	|	ПалитраТоваровРМКСостав.НомерКатегории КАК НомерКатегорииРазмещенияЭлемента,
	|	1 КАК ИндексПозицииВКатегории,
	|	ПалитраТоваровРМКСостав.ЭтоКатегория КАК ЭтоКатегория,
	|	ПалитраТоваровРМКСостав.ИмеетсяВложенность КАК ИмеетсяВложенность,
	|	ИСТИНА КАК ЭтоТекущаяКатегория,
	|	1 КАК ПорядокВидов
	|ПОМЕСТИТЬ ИтоговаяСтруктура
	|ИЗ
	|	ПалитраТоваровРМКСостав КАК ПалитраТоваровРМКСостав
	|ГДЕ
	|	ПалитраТоваровРМКСостав.НомерКатегории > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтруктураПалитрыБезМодификаторов.НомерСтроки,
	|	СтруктураПалитрыБезМодификаторов.НомерКатегории,
	|	СтруктураПалитрыБезМодификаторов.НомерКатегорииРазмещения,
	|	СтруктураПалитрыБезМодификаторов.ИндексПозиции,
	|	СтруктураПалитрыБезМодификаторов.ЭтоКатегория,
	|	СтруктураПалитрыБезМодификаторов.ИмеетсяВложенность,
	|	ЛОЖЬ,
	|	3
	|ИЗ
	|	СтруктураПалитрыБезМодификаторов КАК СтруктураПалитрыБезМодификаторов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК ИсточникПлитки,
	|	ИтоговаяСтруктура.НомерСтроки КАК НомерСтроки,
	|	ИтоговаяСтруктура.НомерКатегорииРазмещенияЭлемента КАК НомерКатегорииРазмещенияЭлемента,
	|	ИтоговаяСтруктура.ПорядокВидов КАК ПорядокВидов,
	|	ИтоговаяСтруктура.ИндексПозицииВКатегории КАК ИндексПозицииВКатегории,
	|	ИтоговаяСтруктура.НомерКатегории КАК НомерКатегории,
	|	ИтоговаяСтруктура.ИмеетсяВложенность КАК ИмеетсяВложенность,
	|	ИтоговаяСтруктура.ЭтоКатегория КАК ЭтоКатегория,
	|	ИтоговаяСтруктура.ЭтоТекущаяКатегория КАК ЭтоТекущаяКатегория,
	|	ПалитраТоваровРМКСостав.ИмяЭлемента КАК ИмяЭлемента,
	|	ПалитраТоваровРМКСостав.ВидМодификатора КАК ВидМодификатора,
	|	ПалитраТоваровРМКСостав.Номенклатура КАК Номенклатура,
	|	ПалитраТоваровРМКСостав.Характеристика КАК Характеристика,
	|	ПалитраТоваровРМКСостав.ЦветШрифта КАК ЦветШрифта,
	|	ПалитраТоваровРМКСостав.ЦветФона КАК ЦветФона,
	|	ПалитраТоваровРМКСостав.ИзображениеЭлемента КАК ИзображениеЭлемента,
	|	ПалитраТоваровРМКСостав.Упаковка КАК Упаковка,
	|	ПалитраТоваровРМКСостав.СкрыватьОстаток КАК СкрыватьОстаток,
	|	ПалитраТоваровРМКСостав.SKU КАК SKU,
	|	ПалитраТоваровРМКСостав.Весовой КАК Весовой
	|ИЗ
	|	ИтоговаяСтруктура КАК ИтоговаяСтруктура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПалитраТоваровРМКСостав КАК ПалитраТоваровРМКСостав
	|		ПО ИтоговаяСтруктура.НомерСтроки = ПалитраТоваровРМКСостав.НомерСтроки
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерКатегорииРазмещенияЭлемента,
	|	ПорядокВидов,
	|	ИндексПозицииВКатегории";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ВыделитьНеПопавшиеВПалитруТовары(ТаблицаТоваровПолная, ТаблицаТоваровПалитры)
	
	РезультатФункции = Новый ТаблицаЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаТоваровПолная.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваровПолная.Характеристика КАК Характеристика,
	|	ТаблицаТоваровПолная.Весовой КАК Весовой,
	|	ТаблицаТоваровПолная.SKU КАК SKU
	|ПОМЕСТИТЬ втТаблицаТоваровПолная
	|ИЗ
	|	&ТаблицаТоваровПолная КАК ТаблицаТоваровПолная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваровПалитры.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваровПалитры.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ втТаблицаТоваровПалитры
	|ИЗ
	|	&ТаблицаТоваровПалитры КАК ТаблицаТоваровПалитры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваровПолная.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваровПолная.Характеристика КАК Характеристика,
	|	ТаблицаТоваровПолная.Весовой КАК Весовой,
	|	ТаблицаТоваровПолная.SKU КАК SKU
	|ИЗ
	|	втТаблицаТоваровПолная КАК ТаблицаТоваровПолная
	|		ЛЕВОЕ СОЕДИНЕНИЕ втТаблицаТоваровПалитры КАК втТаблицаТоваровПалитры
	|		ПО ТаблицаТоваровПолная.Номенклатура = втТаблицаТоваровПалитры.Номенклатура
	|			И ТаблицаТоваровПолная.Характеристика = втТаблицаТоваровПалитры.Характеристика
	|ГДЕ
	|	втТаблицаТоваровПалитры.Номенклатура ЕСТЬ NULL";
	Запрос.УстановитьПараметр("ТаблицаТоваровПолная", ТаблицаТоваровПолная);
	Запрос.УстановитьПараметр("ТаблицаТоваровПалитры", ТаблицаТоваровПалитры);

	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		РезультатФункции = РезультатЗапроса.Выгрузить();
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура ДобавитьВОпорныеДанныеТоварыНеИзПалитры(Форма,
		ТаблицаТоваров,
		НужнаОтдельнаяГруппа,
		ДополнительныеПараметры = Неопределено)
		
	ОпорныеДанные = Форма.ОпорныеДанные;
	НомерКатагорииГруппы = 0;
	Если НужнаОтдельнаяГруппа Тогда
		ДобавитьГруппуОстальныхТоваровВОпорныеДанные(Форма, ДополнительныеПараметры, НомерКатагорииГруппы);
	КонецЕсли;
	ИдентификаторФормы = Форма.УникальныйИдентификатор;
	
	ЗапросИзображений = Новый Запрос;
	ЗапросИзображений.Текст =
	"ВЫБРАТЬ
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	ТаблицаТоваров.Весовой КАК Весовой,
	|	ТаблицаТоваров.SKU КАК SKU
	|ПОМЕСТИТЬ втТаблицаТоваров
	|ИЗ
	|	&ТаблицаТоваров КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПалитраТоваровРМКСостав.Номенклатура КАК Номенклатура,
	|	ПалитраТоваровРМКСостав.Характеристика КАК Характеристика,
	|	МАКСИМУМ(ПалитраТоваровРМКСостав.ИзображениеЭлемента) КАК ИзображениеЭлемента
	|ПОМЕСТИТЬ втИзображенияТовара
	|ИЗ
	|	Справочник.ПалитраТоваровРМК.Состав КАК ПалитраТоваровРМКСостав
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втТаблицаТоваров КАК ТаблицаТоваров
	|		ПО ПалитраТоваровРМКСостав.Номенклатура = ТаблицаТоваров.Номенклатура
	|			И ПалитраТоваровРМКСостав.Характеристика = ТаблицаТоваров.Характеристика
	|ГДЕ
	|	НЕ ПалитраТоваровРМКСостав.Ссылка.ПометкаУдаления
	|	И НЕ ПалитраТоваровРМКСостав.ИзображениеЭлемента = ЗНАЧЕНИЕ(Справочник.ПалитраТоваровРМКПрисоединенныеФайлы.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПалитраТоваровРМКСостав.Номенклатура,
	|	ПалитраТоваровРМКСостав.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Номенклатура.Наименование КАК НоменклатураНаименование,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	ТаблицаТоваров.Характеристика.Наименование КАК ХарактеристикаНаименование,
	|	ТаблицаТоваров.Весовой КАК Весовой,
	|	ТаблицаТоваров.SKU КАК SKU,
	|	ЕСТЬNULL(втИзображенияТовара.ИзображениеЭлемента, ЗНАЧЕНИЕ(Справочник.ПалитраТоваровРМКПрисоединенныеФайлы.ПустаяСсылка)) КАК Изображение
	|ИЗ
	|	втТаблицаТоваров КАК ТаблицаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ втИзображенияТовара КАК втИзображенияТовара
	|		ПО ТаблицаТоваров.Номенклатура = втИзображенияТовара.Номенклатура
	|			И ТаблицаТоваров.Характеристика = втИзображенияТовара.Характеристика";
	ЗапросИзображений.УстановитьПараметр("ТаблицаТоваров", ТаблицаТоваров);
	
	ЦветЧерный = ЦветаСтиля.ЦветТекстаПодсказки;
	ИсточникиПлитки = ИнтерфейсРМКСлужебныйКлиентСервер.ИсточникиДанныхДляПлитки();
	ИндексПозицииВКатегории = ?(НужнаОтдельнаяГруппа, 2, 1);
	Выборка = ЗапросИзображений.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаОпорныхДанных = ОпорныеДанные.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаОпорныхДанных, Выборка);
		СтрокаОпорныхДанных.НомерКатегории = 0;
		СтрокаОпорныхДанных.ИндексПозицииВКатегории = ИндексПозицииВКатегории;
		СтрокаОпорныхДанных.НомерКатегорииРазмещенияЭлемента = НомерКатагорииГруппы;
		СтрокаОпорныхДанных.ЦветШрифта = ЦветЧерный;
		СтрокаОпорныхДанных.ЦветФона = Форма.ЦветаФормы.АктивнаяКнопка;
		ИмяХарактеристики = "";
		Если ЗначениеЗаполнено(Выборка.Характеристика) Тогда
			ИмяХарактеристики = СтрШаблон(", %1", Выборка.ХарактеристикаНаименование);
		КонецЕсли;
		ИмяЭлемента = СтрШаблон("%1%2", Выборка.НоменклатураНаименование, ИмяХарактеристики);
		СтрокаОпорныхДанных.ИмяЭлемента = ИмяЭлемента;
		СтрокаОпорныхДанных.ДоступностьКоманды = Истина;
		СтрокаОпорныхДанных.ПервыйИндексПлитки = ОпорныеДанные.Индекс(СтрокаОпорныхДанных);
		СтрокаОпорныхДанных.ИсточникПлитки = ИсточникиПлитки.ВесовойТовар;
		Если ЗначениеЗаполнено(Выборка.Изображение) Тогда
			АдресКартинки = РаботаСФайлами.ДанныеФайла(Выборка.Изображение, ИдентификаторФормы).СсылкаНаДвоичныеДанныеФайла;
			СтрокаОпорныхДанных.АдресИзображения = АдресКартинки;
		КонецЕсли;
		
		ИндексПозицииВКатегории = ИндексПозицииВКатегории + 1;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьГруппуОстальныхТоваровВОпорныеДанные(Форма, ДополнительныеПараметры, НомерКатагорииГруппы)
	
	ИсточникиПлитки = ИнтерфейсРМКСлужебныйКлиентСервер.ИсточникиДанныхДляПлитки();
	ОпорныеДанные = Форма.ОпорныеДанные;
	НомерКатагорииГруппы = 1;
	ИндексПозицииВКатегории = 1;
	Если Не ДополнительныеПараметры = Неопределено Тогда
		НомерКатагорииГруппы = ДополнительныеПараметры.МаксимальныйНомерКатегории + 1;
		ИндексПозицииВКатегории = ДополнительныеПараметры.МаксимальныйИндексПозицииВНулевойКатегории + 1;
	КонецЕсли;
	
	ЦветЧерный = ЦветаСтиля.ЦветТекстаПодсказки;
	ИмяГруппыОстальныхТоваров = НСтр("ru = 'Остальные товары'");
	ТекущееКоличествоЭлементов = ОпорныеДанные.Количество();

	// Добавление группы
	СтрокаОпорныхДанных = ОпорныеДанные.Добавить();
	СтрокаОпорныхДанных.НомерКатегории = НомерКатагорииГруппы;
	СтрокаОпорныхДанных.ИндексПозицииВКатегории = ИндексПозицииВКатегории;
	СтрокаОпорныхДанных.НомерКатегорииРазмещенияЭлемента = 0;
	СтрокаОпорныхДанных.ЭтоКатегория = Истина;
	СтрокаОпорныхДанных.ЦветШрифта = ЦветЧерный;
	СтрокаОпорныхДанных.ЦветФона = Форма.ЦветаФормы.ПапкаКнопка;
	СтрокаОпорныхДанных.ИмяЭлемента = ИмяГруппыОстальныхТоваров;
	СтрокаОпорныхДанных.ДоступностьКоманды = Истина;
	СтрокаОпорныхДанных.ПервыйИндексПлитки = ТекущееКоличествоЭлементов + 1;
	СтрокаОпорныхДанных.ИмеетсяВложенность = Истина;
	СтрокаОпорныхДанных.ИсточникПлитки = ИсточникиПлитки.ВесовойТовар;
	СтрокаОпорныхДанных.ЭтоТекущаяКатегория = Ложь;
	
	// Добавление обратной группы
	СтрокаОпорныхДанных = ОпорныеДанные.Добавить();
	СтрокаОпорныхДанных.НомерКатегории = 0;
	СтрокаОпорныхДанных.ИндексПозицииВКатегории = 1;
	СтрокаОпорныхДанных.НомерКатегорииРазмещенияЭлемента = НомерКатагорииГруппы;
	СтрокаОпорныхДанных.ЭтоКатегория = Истина;
	СтрокаОпорныхДанных.ЦветШрифта = ЦветЧерный;
	СтрокаОпорныхДанных.ЦветФона = Форма.ЦветаФормы.ПапкаКнопка;
	СтрокаОпорныхДанных.ИмяЭлемента = ИмяГруппыОстальныхТоваров;
	СтрокаОпорныхДанных.ДоступностьКоманды = Истина;
	СтрокаОпорныхДанных.ПервыйИндексПлитки = 0;
	СтрокаОпорныхДанных.ИмеетсяВложенность = Истина;
	СтрокаОпорныхДанных.ИсточникПлитки = ИсточникиПлитки.ВесовойТовар;
	СтрокаОпорныхДанных.ЭтоТекущаяКатегория = Истина;
	
КонецПроцедуры

Функция ПолучитьТаблицуТоваровОпорныхДанных(ОпорныеДанные, ДополнительныеПараметры)
	
	ТаблицаТоваров = ОпорныеДанные.Выгрузить(Новый Массив, "Номенклатура,Характеристика");
	Для Каждого СтрокаОпорныхДанных Из ОпорныеДанные Цикл
		Если ЗначениеЗаполнено(СтрокаОпорныхДанных.Номенклатура) Тогда
			НоваяСтрока = ТаблицаТоваров.Добавить();
			НоваяСтрока.Номенклатура = СтрокаОпорныхДанных.Номенклатура;
			НоваяСтрока.Характеристика = СтрокаОпорныхДанных.Характеристика;
		КонецЕсли;
		Если СтрокаОпорныхДанных.НомерКатегории > ДополнительныеПараметры.МаксимальныйНомерКатегории Тогда
			ДополнительныеПараметры.МаксимальныйНомерКатегории = СтрокаОпорныхДанных.НомерКатегории;
		КонецЕсли;
		Если СтрокаОпорныхДанных.ИндексПозицииВКатегории > ДополнительныеПараметры.МаксимальныйИндексПозицииВНулевойКатегории
				И СтрокаОпорныхДанных.НомерКатегорииРазмещенияЭлемента = 0 Тогда
			ДополнительныеПараметры.МаксимальныйИндексПозицииВНулевойКатегории = СтрокаОпорныхДанных.ИндексПозицииВКатегории;
		КонецЕсли;
	КонецЦикла;
	Возврат ТаблицаТоваров;
	
КонецФункции

Процедура ПрименитьИсключенияОбработкиПорядкаОбластей(Форма, ТаблицаПорядка)
	
	УстановитьНастройкиПорядкаОбластейПоУмолчанию(Форма);
	Если Форма.ВертикальнаяОриентация Тогда
		ПрименитьИсключенияОбработкиПорядкаОбластейВертикальнаяОриентация(Форма, ТаблицаПорядка);
	Иначе
		ПрименитьИсключенияОбработкиПорядкаОбластейГоризонтальнаяОриентация(Форма, ТаблицаПорядка);
	КонецЕсли;
	
КонецПроцедуры

Функция ОпределитьПорядокГоризонтальныхПанелей(ТаблицаПорядка)
	
	ПорядокПанелей = Новый Структура();

	ИмяКорневойГруппы = "ГоризонтальнаяОриентация";
	ИмяПанелиОпераций = "ГруппаУправленияСтатическая_Горизонтальная";
	ИмяГруппыРодителяКоманднойПанели = "ГруппаУправленияЧекомГор_Горизонтальная";
	ИмяГруппыКоманднойПанели = "КоманднаяПанельУправленияЧекомГор_Горизонтальная";
	ИмяГруппыВводИнформацииИтоговЧека = "ВводИнформацииИтоговЧекаГор_Горизонтальная";
	ИмяГруппыИтоговЧека = "СводнаяПанельИтоговЧекаГор_Горизонтальная";
	ИмяРабочейОбласти = "Страницы_Горизонтальная";
	ИмяГруппыВводИнформацииИОплат = "ВводИнформацииИОплатГор_Горизонтальная";
	
	ПорядокПанелей.Вставить("ПорядокКоманднойПанели",
		ОпределитьПорядокПанелиВГруппе(ТаблицаПорядка, ИмяГруппыРодителяКоманднойПанели, ИмяГруппыКоманднойПанели));
	ПорядокПанелей.Вставить("ПорядокВводаИнформацииИОплат",
		ОпределитьПорядокПанелиВГруппе(ТаблицаПорядка, ИмяГруппыРодителяКоманднойПанели, ИмяГруппыВводИнформацииИОплат));
	ПорядокПанелей.Вставить("ПорядокВводаИнформацииИтоговЧека",
		ОпределитьПорядокПанелиВГруппе(ТаблицаПорядка, ИмяГруппыВводИнформацииИОплат, ИмяГруппыВводИнформацииИтоговЧека));
	ПорядокПанелей.Вставить("ПорядокСводныхИтоговЧека",
		ОпределитьПорядокПанелиВГруппе(ТаблицаПорядка, ИмяГруппыВводИнформацииИОплат, ИмяГруппыИтоговЧека));
	ПорядокПанелей.Вставить("ПорядокГруппыОпераций",
		ОпределитьПорядокПанелиВГруппе(ТаблицаПорядка, ИмяКорневойГруппы, ИмяПанелиОпераций));
	ПорядокПанелей.Вставить("ПорядокПанелиУправления",
		ОпределитьПорядокПанелиВГруппе(ТаблицаПорядка, ИмяРабочейОбласти, ИмяГруппыРодителяКоманднойПанели));
	
	Возврат ПорядокПанелей;
	
КонецФункции

Процедура ПрименитьИсключенияОбработкиПорядкаОбластейГоризонтальнаяОриентация(Форма, ТаблицаПорядка)
	
	Элементы = Форма.Элементы;
	Элементы.ГруппаЦифроваяПанель.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Низ;
	Элементы.Переместить(Элементы.ПлиткаГруппаИнфо, Элементы.ГруппаЛево, Элементы.НастраиваемаяПанельЛево);
	Элементы.Переместить(Элементы.ПанельУправленияПодбором, Элементы.ПанельПодбора, Элементы.ПлиточныйИнтерфейс);
	
	ПорядокПанелей = ОпределитьПорядокГоризонтальныхПанелей(ТаблицаПорядка);
	
	Если ПорядокПанелей.ПорядокГруппыОпераций > 1 Тогда
		Элементы.Переместить(Элементы.ПанельУправленияПодбором, Элементы.ПанельПодбора, Неопределено);
		Элементы.Переместить(Элементы.ПлиткаГруппаИнфо, Элементы.ГруппаЛево, Неопределено);
	КонецЕсли;
	Если ПорядокПанелей.ПорядокПанелиУправления = 1 Тогда
		УстановитьГоризонтальноеПоложениеЭлемента(Элементы, "ГруппаКупюр", ГоризонтальноеПоложениеЭлемента.Лево);
		Элементы.Переместить(Элементы.ГруппаРаботаСТоварамиПлитки, Элементы.ПлиткаГруппаДанные, Элементы.ПанельПодбора);
		Элементы.ПлиткаИнфоТекущейСтроки.ГоризонтальноеПоложениеПодчиненных = ГоризонтальноеПоложениеЭлемента.Лево;
	КонецЕсли;
	Если ПорядокПанелей.ПорядокКоманднойПанели = 1 Тогда
		Элементы.ОтступКоманднойПанели.Видимость = Истина;
		ГруппаЦифроваяПанель = Элементы.ГруппаЦифроваяПанель;
		ГруппаЦифроваяПанель.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Верх;
		Элементы.Переместить(ГруппаЦифроваяПанель, ГруппаЦифроваяПанель.Родитель,
			Элементы.ГруппаСлоевСлужебнаяИнформацияЧека);
		Элементы.Переместить(Элементы.ПлиткаГруппаОплатить, Элементы.ГруппаЛево, Элементы.НастраиваемаяПанельЛево);
			
		Элементы.ОтказатьсяОтВводаКартыПоиск.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Авто;
		Элементы.ОтказатьсяОтВводаКартыНеНайдена.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Авто;
		Элементы.ОтказатьсяОтОплатыБонусами.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Авто;
		
		УстановитьВидимостьРазрывовОперацииОтказаться(Элементы, Истина);
	КонецЕсли;
	ВводИнформацииЧекаВНачале = (ПорядокПанелей.ПорядокВводаИнформацииИОплат = 1
							И ПорядокПанелей.ПорядокВводаИнформацииИтоговЧека = 1);
	Если (ПорядокПанелей.ПорядокВводаИнформацииИОплат > 1 И ПорядокПанелей.ПорядокСводныхИтоговЧека > 1)
			Или ВводИнформацииЧекаВНачале Тогда
		Элементы.СводнаяПанельИтоговЧекаГор.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Низ;
	КонецЕсли;
	Если ПорядокПанелей.ПорядокКоманднойПанели = 1 Тогда
		Элементы.КоманднаяПанельУправленияЧекомГор.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Авто;
	КонецЕсли;
	
КонецПроцедуры

Функция ОпределитьПорядокВертикальныхПанелей(ТаблицаПорядка)
	
	ПорядокПанелей = Новый Структура();
	
	ИмяКорневойГруппы = "ВертикальнаяОриентация";
	ИмяПанелиОпераций = "ГруппаУправленияСтатическая_Вертикальная";
	ИмяОсновнойПанели = "ГруппаСлоевОсновнаяКоманднаяПанельУправленияЧеком_Вертикальная";
	ИмяДополнительнойПанели = "ГруппаСлоевДополнительнаяКоманднаяПанель_Вертикальная";
	ИмяРодителяОсновнойПанели = "ПраваяКолонкаУправленияЧеком_Вертикальная";
	ИмяРодителяДополнительнойПанели = "ЛеваяСредняяКолонкиУправленияЧеком_Вертикальная";
	ИмяРодителяПанелиИтоговЧека = "ГруппаУправленияЧекомВер_Вертикальная";
	ИмяПанелиИтогоЧека = "ПраваяКолонкаУправленияЧеком_Вертикальная";
	ИмяРодителяПанелиВидовОплат = "ГруппаСлоевСлужебнаяИнформацияЧека_Вертикальная";
	ИмяПанелиВидовОплат = "ГруппаПанелейВидовОплатВер_Вертикальная";
	ИмяРабочейОбласти = "Страницы_Вертикальная";
	ИмяГруппыРаботыСТоварами = "ГруппаПанельИнформацииВер_Вертикальная";
	ИмяГруппыДанныхТовара = "ГруппаИнфо_Вертикальная";
	ИмяГруппыСпискаТоваров = "ПанельТаблицыТоваров_Вертикальная";
	
	ПорядокПанелей.Вставить("ПорядокОсновнойКоманднойПанели",
		ОпределитьПорядокПанелиВГруппе(ТаблицаПорядка, ИмяРодителяОсновнойПанели, ИмяОсновнойПанели));
	ПорядокПанелей.Вставить("ПорядокДополнительнойКоманднойПанели",
		ОпределитьПорядокПанелиВГруппе(ТаблицаПорядка, ИмяРодителяДополнительнойПанели, ИмяДополнительнойПанели));
	ПорядокПанелей.Вставить("ПорядокПанелиИтоговЧека",
		ОпределитьПорядокПанелиВГруппе(ТаблицаПорядка, ИмяРодителяПанелиИтоговЧека, ИмяПанелиИтогоЧека));
	ПорядокПанелей.Вставить("ПорядокГруппыОпераций",
		ОпределитьПорядокПанелиВГруппе(ТаблицаПорядка, ИмяКорневойГруппы, ИмяПанелиОпераций));
	ПорядокПанелей.Вставить("ПорядокПанелиУправления",
		ОпределитьПорядокПанелиВГруппе(ТаблицаПорядка, ИмяРабочейОбласти, ИмяРодителяПанелиИтоговЧека));
	ПорядокПанелей.Вставить("ПорядокДанныхТекущегоТовара",
		ОпределитьПорядокПанелиВГруппе(ТаблицаПорядка, ИмяГруппыРаботыСТоварами, ИмяГруппыДанныхТовара));
	ПорядокПанелей.Вставить("ПорядокСпискаТоваров",
		ОпределитьПорядокПанелиВГруппе(ТаблицаПорядка, ИмяГруппыРаботыСТоварами, ИмяГруппыСпискаТоваров));
	
	Возврат ПорядокПанелей;
	
КонецФункции

Процедура ПрименитьИсключенияОбработкиПорядкаОбластейВертикальнаяОриентация(Форма, ТаблицаПорядка)
	
	Элементы = Форма.Элементы;
	Элементы.Переместить(Элементы.СжатаяПанельИтогов, Элементы.ДанныеИтоговЧекаВер, Элементы.ПанельИтоговПоЧекам);
	Элементы.Переместить(Элементы.СжатаяПанельСдача, Элементы.ГруппаСдачиИВидовОплат, Элементы.ГруппаВидовОплат);
	Элементы.Переместить(Элементы.ПлиткаГруппаИнфо, Элементы.ПлиткаТаблицаТоваровВер, Элементы.НастраиваемаяПанельЛево);
	Элементы.Переместить(Элементы.ОболочкаПанелиУправленияПодборомВер,
		Элементы.ПлиткаГруппаОбщая, Элементы.ПлиткаГруппаДанные);
	
	НаправлениеВерх = ВертикальноеПоложениеЭлемента.Верх;
	НаправлениеПраво = ГоризонтальноеПоложениеЭлемента.Право;
	
	ПорядокПанелей = ОпределитьПорядокВертикальныхПанелей(ТаблицаПорядка);
	
	Если ПорядокПанелей.ПорядокГруппыОпераций > 1 Тогда
		Элементы.Переместить(Элементы.ОболочкаПанелиУправленияПодборомВер, Элементы.ПлиткаГруппаОбщая, Неопределено);
	КонецЕсли;
	Если ПорядокПанелей.ПорядокОсновнойКоманднойПанели = 1 Тогда
		УстановитьВертикальноеПоложениеЭлемента(Элементы,
			"ГруппаСлоевОсновнаяКоманднаяПанельУправленияЧеком", НаправлениеВерх);
		Элементы.Переместить(Элементы.СжатаяПанельИтогов, Элементы.ДанныеИтоговЧекаВер, Неопределено);
		Элементы.Переместить(Элементы.ПлиткаГруппаОплатить, Элементы.ПлиткаГруппаНиз, Элементы.ПлиткаГруппаИтого);
	КонецЕсли;
	Если ПорядокПанелей.ПорядокДополнительнойКоманднойПанели = 1 Тогда
		
		УстановитьВертикальноеПоложениеЭлемента(Элементы, "ГруппаСлоевДополнительнаяКоманднаяПанель", НаправлениеВерх);
		УстановитьВертикальноеПоложениеЭлемента(Элементы, "ГруппаВозвратВПодборИзПанелиНаличных", НаправлениеВерх);
		УстановитьВертикальноеПоложениеЭлемента(Элементы, "ГруппаВозвратВПодборИзСертификатов", НаправлениеВерх);
		УстановитьВертикальноеПоложениеЭлемента(Элементы, "ГруппаВозвратВПодборИзУправления", НаправлениеВерх);
		
		Элементы.Переместить(Элементы.ВернутьсяВРежимПодбораИзПанелиNFCОсновная,
			Элементы.ГруппаОсновнаяСтраницаNFC, Элементы.ГруппаПродажаNFC);
		Элементы.Переместить(Элементы.ГруппаВозвратВПодборИзУправления,
			Элементы.ГруппаДополнительноеУправлениеЧеком, Элементы.ГруппаСНО);
		Элементы.Переместить(Элементы.ГруппаВозвратВПодборИзСертификатов,
			Элементы.ГруппаПоискСертификатов, Элементы.ГруппаСуммаОплатаСертификатами);
		Элементы.Переместить(Элементы.ГруппаВозвратВПодборИзПанелиНаличных,
			Элементы.ПанельВводаНаличныхВертикальная, Элементы.ГруппаКупюрРяд1);
		Элементы.Переместить(Элементы.СжатаяПанельСдача, Элементы.ГруппаСдачиИВидовОплат, Неопределено);
		Элементы.ГруппаВидовОплат.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Низ;
		Элементы.ГруппаВидовОплат.РастягиватьПоВертикали = Истина;
		Элементы.ГруппаДополнительноеУправлениеЧеком.РастягиватьПоВертикали = Истина;
		Элементы.ГруппаДополнительноеУправлениеЧеком.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Низ;
		
	КонецЕсли;
	
	Если ПорядокПанелей.ПорядокПанелиИтоговЧека = 1 Тогда
		Элементы.ЛеваяСредняяКолонкиУправленияЧеком.ГоризонтальноеПоложениеВГруппе = НаправлениеПраво;
		Элементы.ПраваяКолонкаУправленияЧеком.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Лево;
		Элементы.ГруппаСдачиИВидовОплат.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
		Элементы.ГруппаДополнительноеУправлениеЧеком.ГоризонтальноеПоложениеПодчиненных
			= ГоризонтальноеПоложениеЭлемента.Право;
		
		УстановитьГоризонтальноеПоложениеЭлемента(Элементы, "ГруппаВозвратВПодборИзПанелиНаличных", НаправлениеПраво);
		УстановитьГоризонтальноеПоложениеЭлемента(Элементы, "ГруппаВозвратВПодборИзСертификатов", НаправлениеПраво);
		УстановитьГоризонтальноеПоложениеЭлемента(Элементы, "ГруппаВозвратВПодборИзУправления", НаправлениеПраво);
		Элементы.ГруппаПоискСертификатов.ГоризонтальноеПоложениеВГруппе = НаправлениеПраво;
		Элементы.ВернутьсяВРежимПодбораИзПанелиNFCОсновная.ГоризонтальноеПоложениеВГруппе = НаправлениеПраво;
		Элементы.Переместить(Элементы.ГруппаДанныеПокупателяОсновнаяПанельВыбор,
			Элементы.ПанельДанныхПокупателя, Неопределено);
		Элементы.ПанельВидовОплат.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Лево;
		Элементы.Переместить(Элементы.ГруппаПанелейВидовОплатВер, Элементы.ОбластьОперативногоУправленияЧеком,
			Элементы.ГруппаСлоевЛеваяВерхняяВспомогательнаяПанель);
		Элементы.ГруппаСлоевЛеваяВерхняяВспомогательнаяПанель.ГоризонтальноеПоложениеВГруппе
			= ГоризонтальноеПоложениеЭлемента.Право;
		Элементы.ГруппаВидОплатыКартойГоризонтально.Ширина = 26;
		Элементы.ГруппаВидОплатыСБПГоризонтально.Ширина = 26;
		Элементы.Переместить(Элементы.ПлиткаПанельИтоговВер, Элементы.ОболочкаПлиткиВер, Элементы.ПлиткаТаблицаТоваровВер);
	КонецЕсли;
	
	Если ПорядокПанелей.ПорядокДанныхТекущегоТовара > ПорядокПанелей.ПорядокСпискаТоваров Тогда
		Элементы.Переместить(Элементы.ПлиткаГруппаИнфо, Элементы.ПлиткаТаблицаТоваровВер, Неопределено);
	КонецЕсли;
	
	Если ПорядокПанелей.ПорядокПанелиУправления = 1 Тогда
		Элементы.Переместить(Элементы.ГруппаРаботаСТоварамиПлитки, Элементы.ПлиткаГруппаДанные, Элементы.ПанельПодбора);
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьВертикальноеПоложениеЭлемента(Элементы, ИмяЭлемента, Направление)
	
	Элементы[ИмяЭлемента].ВертикальноеПоложениеВГруппе = Направление;
	Элементы[ИмяЭлемента].ВертикальноеПоложениеПодчиненных = Направление;
	
КонецПроцедуры

Процедура УстановитьГоризонтальноеПоложениеЭлемента(Элементы, ИмяЭлемента, Направление)
	
	Элементы[ИмяЭлемента].ГоризонтальноеПоложениеВГруппе = Направление;
	Элементы[ИмяЭлемента].ГоризонтальноеПоложениеПодчиненных = Направление;
	
КонецПроцедуры

Функция ОпределитьПорядокПанелиВГруппе(ТаблицаПорядка, ИмяРодительскойГруппы, ИмяПанели)
	
	РезультатФункции = 0;
	
	ОтборСтрокРодителя = Новый Структура("ОбластьРодитель", ИмяРодительскойГруппы);
	СтрокиГруппы = ТаблицаПорядка.НайтиСтроки(ОтборСтрокРодителя);
	КоличествоСтрок = СтрокиГруппы.Количество();
	ИндексСтроки = 0;
	Пока ИндексСтроки < КоличествоСтрок И РезультатФункции = 0 Цикл
		СтрокаГруппы = СтрокиГруппы[ИндексСтроки];
		Если СтрокаГруппы.Область = ИмяПанели Тогда
			РезультатФункции = СтрокаГруппы.Порядок;
		КонецЕсли;
		
		ИндексСтроки = ИндексСтроки + 1;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура УстановитьНастройкиПорядкаОбластейПоУмолчанию(Форма)
	
	Элементы = Форма.Элементы;
	НаправлениеНиз = ВертикальноеПоложениеЭлемента.Низ;
	НаправлениеЛево = ГоризонтальноеПоложениеЭлемента.Лево;
	НаправлениеПраво = ГоризонтальноеПоложениеЭлемента.Право;
	Элементы.ОтступКоманднойПанели.Видимость = Ложь;
	Элементы.СводнаяПанельИтоговЧекаГор.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Авто;
	Элементы.КоманднаяПанельУправленияЧекомГор.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Низ;
	Элементы.ОтказатьсяОтВводаКартыПоиск.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Низ;
	Элементы.ОтказатьсяОтВводаКартыНеНайдена.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Низ;
	Элементы.ОтказатьсяОтОплатыБонусами.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Низ;
	Элементы.ЛеваяСредняяКолонкиУправленияЧеком.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Авто;
	Элементы.ПраваяКолонкаУправленияЧеком.ГоризонтальноеПоложениеВГруппе = НаправлениеПраво;
	Элементы.ВернутьсяВРежимПодбораИзПанелиNFCОсновная.ГоризонтальноеПоложениеВГруппе
		= ГоризонтальноеПоложениеЭлемента.Авто;
	Элементы.ГруппаСдачиИВидовОплат.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Авто;
	Элементы.ГруппаСлоевЛеваяВерхняяВспомогательнаяПанель.ГоризонтальноеПоложениеВГруппе
		= ГоризонтальноеПоложениеЭлемента.Авто;
	Элементы.ГруппаВидОплатыКартойГоризонтально.Ширина = 0;
	Элементы.ГруппаВидОплатыСБПГоризонтально.Ширина = 0;
	Элементы.ПлиткаИнфоТекущейСтроки.ГоризонтальноеПоложениеПодчиненных = НаправлениеПраво;
	
	УстановитьГоризонтальноеПоложениеЭлемента(Элементы, "ГруппаВозвратВПодборИзПанелиНаличных", НаправлениеЛево);
	УстановитьГоризонтальноеПоложениеЭлемента(Элементы, "ГруппаВозвратВПодборИзСертификатов", НаправлениеЛево);
	УстановитьГоризонтальноеПоложениеЭлемента(Элементы, "ГруппаВозвратВПодборИзУправления", НаправлениеЛево);
	УстановитьГоризонтальноеПоложениеЭлемента(Элементы, "ГруппаПоискСертификатов", ГоризонтальноеПоложениеЭлемента.Авто);
	УстановитьГоризонтальноеПоложениеЭлемента(Элементы, "ГруппаКупюр", ГоризонтальноеПоложениеЭлемента.Право);
	
	УстановитьВидимостьРазрывовОперацииОтказаться(Элементы, Ложь);
	УстановитьВертикальноеПоложениеЭлемента(Элементы,
		"ГруппаСлоевОсновнаяКоманднаяПанельУправленияЧеком", НаправлениеНиз);
	УстановитьВертикальноеПоложениеЭлемента(Элементы, "ГруппаСлоевДополнительнаяКоманднаяПанель", НаправлениеНиз);
	УстановитьВертикальноеПоложениеЭлемента(Элементы, "ГруппаВозвратВПодборИзПанелиНаличных", НаправлениеНиз);
	УстановитьВертикальноеПоложениеЭлемента(Элементы, "ГруппаВозвратВПодборИзСертификатов", НаправлениеНиз);
	УстановитьВертикальноеПоложениеЭлемента(Элементы, "ГруппаВозвратВПодборИзУправления", НаправлениеНиз);
	
	Элементы.Переместить(Элементы.ВернутьсяВРежимПодбораИзПанелиNFCОсновная,
		Элементы.ГруппаОсновнаяСтраницаNFC, Неопределено);
	Элементы.Переместить(Элементы.ГруппаВозвратВПодборИзУправления,
		Элементы.ГруппаДополнительноеУправлениеЧеком, Неопределено);
	Элементы.Переместить(Элементы.ГруппаВозвратВПодборИзСертификатов,
		Элементы.ГруппаПоискСертификатов, Неопределено);
	Элементы.Переместить(Элементы.ГруппаВозвратВПодборИзПанелиНаличных,
		Элементы.ПанельВводаНаличныхВертикальная, Неопределено);
	Элементы.Переместить(Элементы.ГруппаДанныеПокупателяОсновнаяПанельВыбор,
		Элементы.ПанельДанныхПокупателя,
		Элементы.ГруппаСлоевДанныеПокупателяДополнительнаяОбласть);
	Элементы.Переместить(Элементы.ГруппаПанелейВидовОплатВер, Элементы.ОбластьОперативногоУправленияЧеком, Неопределено);
	Элементы.Переместить(Элементы.ГруппаРаботаСТоварамиПлитки, Элементы.ПлиткаГруппаДанные, Неопределено);
	Элементы.Переместить(Элементы.ПлиткаГруппаОплатить, Элементы.ПлиткаГруппаНиз, Неопределено);
	Элементы.Переместить(Элементы.ПлиткаПанельИтоговВер, Элементы.ОболочкаПлиткиВер, Неопределено);
	
	Элементы.ГруппаВидовОплат.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Авто;
	Элементы.ГруппаВидовОплат.РастягиватьПоВертикали = Неопределено;
	Элементы.ГруппаДополнительноеУправлениеЧеком.РастягиватьПоВертикали = Неопределено;
	Элементы.ГруппаДополнительноеУправлениеЧеком.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Авто;
	
КонецПроцедуры

Процедура УстановитьВидимостьРазрывовОперацииОтказаться(Элементы, ЗначениеВидимости)
	
	Элементы.ДекорацияОтступЦифроваяПанль.Видимость = ЗначениеВидимости;
	Элементы.ДекорацияОтказатьсяОтВводаКартыПоиск.Видимость = ЗначениеВидимости;
	Элементы.ДекорацияОтказатьсяОтВводаКартыНеНайдена.Видимость = ЗначениеВидимости;
	Элементы.ДекорацияОтказатьсяОтОплатыБонусами.Видимость = ЗначениеВидимости;
	
КонецПроцедуры

Функция СформироватьСоставПалитрыСУчетомВложенныхПалитр(Форма)

	ИсточникиДанныхПлитки = ИнтерфейсРМКСлужебныйКлиентСервер.ИсточникиДанныхДляПлитки();
	ПалитраПлитки = Справочники.ПалитраТоваровРМК.ПустаяСсылка();
	МассивПалитр = Новый СписокЗначений;
	ЗаполнитьПараметрыПалитрыДляСКД(Форма, ПалитраПлитки, МассивПалитр);
	
	СхкмаИерархииПалитры = Справочники.ПалитраТоваровРМК.ПолучитьМакет("МакетПалитрыСКД");
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.ЗагрузитьНастройки(СхкмаИерархииПалитры.НастройкиПоУмолчанию);

	ПараметрПалитраПлитка = Новый ПараметрКомпоновкиДанных("ПалитраПлитка");
	ПараметрМассивПалитр = Новый ПараметрКомпоновкиДанных("МассивПалитр");
	ПараметрИсточникПалитрыПлитка = Новый ПараметрКомпоновкиДанных("ИсточникПалитрыПлитка");
	ПараметрИсточникПалитрыИзбранное = Новый ПараметрКомпоновкиДанных("ИсточникПалитрыИзбранное");
	
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(ПараметрПалитраПлитка, ПалитраПлитки);
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(ПараметрМассивПалитр, МассивПалитр);
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(ПараметрИсточникПалитрыПлитка,
		ИсточникиДанныхПлитки.Палитра);
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(ПараметрИсточникПалитрыИзбранное,
		ИсточникиДанныхПлитки.Избранное);
	
	ТекущиеНастройки = КомпоновщикНастроек.ПолучитьНастройки();
	ТипГенератораДляКоллекции = Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений");
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхкмаИерархииПалитры, ТекущиеНастройки, , , ТипГенератораДляКоллекции);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	ДеревоИерархииПалитры = Новый ДеревоЗначений;
	ПроцессорВывода.УстановитьОбъект(ДеревоИерархииПалитры);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Возврат СформироватьЛинейныйИерархическийСоставПалитр(ДеревоИерархииПалитры);
	
КонецФункции

Процедура ОбойтиСтрокиДереваСоставаПалитры(ТаблицаПалитры, СтрокиУровня, ДанныеПреобразования,
		Знач УровеньДерева, ИсточникПалитры)
	
	УровеньДерева = УровеньДерева + 1;
	Для Каждого СтрокаДерева Из СтрокиУровня Цикл
		
		Если УровеньДерева = 1 Тогда
			Если ИсточникПалитры <> СтрокаДерева.ИсточникПалитры Тогда
				Если ИсточникПалитры > 0 Тогда
					ОчиститьДанныеПреобразования(ДанныеПреобразования);
					ДанныеПреобразования = ИнициализироватьДанныеПреобразования();
				КонецЕсли;
				ИсточникПалитры = СтрокаДерева.ИсточникПалитры;
				ДобавитьКорневуюКатегориюВДанныеПреобразования(ДанныеПреобразования, СтрокаДерева.ПалитраВладелец);
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаДерева.ЭтоПалитра Тогда
			ОбойтиСтрокиДереваСоставаПалитры(ТаблицаПалитры, СтрокаДерева.Строки,
				ДанныеПреобразования, УровеньДерева, ИсточникПалитры);
		Иначе
			НоваяСтрокаПалитры = ТаблицаПалитры.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаПалитры, СтрокаДерева);
			СкорректироватьДанныеСтрокиСоставаПалитры(НоваяСтрокаПалитры, СтрокаДерева,
				ДанныеПреобразования, ИсточникПалитры);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СкорректироватьДанныеСтрокиСоставаПалитры(СтрокаСоставаПалитры, СтрокаДерева,
		ДанныеПреобразования, ИсточникПалитры)
		
	ДанныеПреобразования.НомерСтроки = ДанныеПреобразования.НомерСтроки + 1;
	
	ДанныеРазмещенияДерева = ПолучитьДанныеРазмещенияСтрокиДерева(СтрокаДерева, ДанныеПреобразования);
	НовыеДанныеРазмещения = ПолучитьНовыеДанныеКатегорииРазмещения(ДанныеПреобразования, ДанныеРазмещенияДерева);
	ПрисвоитьКатегорию = Ложь;
	Если Не НовыеДанныеРазмещения = Неопределено Тогда
		СтрокаСоставаПалитры.НомерКатегорииРазмещения = НовыеДанныеРазмещения.НовыйНомер;
		НовыеДанныеРазмещения.ТекущийИндексВКатегории = НовыеДанныеРазмещения.ТекущийИндексВКатегории + 1;
		СтрокаСоставаПалитры.ИндексПозиции = НовыеДанныеРазмещения.ТекущийИндексВКатегории;
		ПрисвоитьКатегорию = НовыеДанныеРазмещения.ИмеетсяГрупповойМодификатор;
	КонецЕсли;
	СтрокаСоставаПалитры.НомерСтроки = ДанныеПреобразования.НомерСтроки;
	СтрокаСоставаПалитры.ИсточникПалитры = ИсточникПалитры;
	
	Если СтрокаДерева.НомерКатегории > 0 Тогда
		ИмеетсяГрупповойМодификатор = ГруппаИмеетГрупповойМодификатор(СтрокаДерева);
		НовыйНомерКатегории = ЗарегистрироватьНовыйНомерКатегории(ДанныеПреобразования,
			СтрокаДерева, ИмеетсяГрупповойМодификатор);
		СтрокаСоставаПалитры.НомерКатегории = НовыйНомерКатегории;
	ИначеЕсли ПрисвоитьКатегорию И ЗначениеЗаполнено(СтрокаДерева.Номенклатура)
			И Не ЗначениеЗаполнено(СтрокаДерева.ВидМодификатора) Тогда
			
		ДанныеПреобразования.ВыделенныйНомерКатегории = ДанныеПреобразования.ВыделенныйНомерКатегории + 1;
		СтрокаСоставаПалитры.НомерКатегории = ДанныеПреобразования.ВыделенныйНомерКатегории;
		СтрокаСоставаПалитры.ИмеетсяВложенность = Истина;
	КонецЕсли;
	
КонецПроцедуры

Функция ЗарегистрироватьНовыйНомерКатегории(ДанныеПреобразования, СтрокаДерева, ИмеетсяГрупповойМодификатор)
	
	НовыйНомерКатегории = 0;
	КатегорииПалитры = ДанныеПреобразования.СоответствиеКатегорий.Получить(СтрокаДерева.ПалитраВладелец);
	Если КатегорииПалитры = Неопределено Тогда
		КатегорииПалитры = Новый Соответствие();
		ДанныеПреобразования.СоответствиеКатегорий.Вставить(СтрокаДерева.ПалитраВладелец, КатегорииПалитры);
	КонецЕсли;
	ДанныеКатегории = КатегорииПалитры.Получить(СтрокаДерева.НомерКатегории);
	Если ДанныеКатегории = Неопределено Тогда
		ДанныеПреобразования.ВыделенныйНомерКатегории = ДанныеПреобразования.ВыделенныйНомерКатегории + 1;
		Если СтрокаДерева.НомерКатегории > 0 Тогда
			ДанныеКатегории = Новый Структура();
			ДанныеКатегории.Вставить("НовыйНомер", ДанныеПреобразования.ВыделенныйНомерКатегории);
			ДанныеКатегории.Вставить("ТекущийИндексВКатегории", 0);
			ДанныеКатегории.Вставить("ИмеетсяГрупповойМодификатор", ИмеетсяГрупповойМодификатор);
			КатегорииПалитры.Вставить(СтрокаДерева.НомерКатегории, ДанныеКатегории);
		КонецЕсли;
		НовыйНомерКатегории = ДанныеПреобразования.ВыделенныйНомерКатегории;
	Иначе
		НовыйНомерКатегории = ДанныеКатегории.НовыйНомер;
	КонецЕсли;
	Возврат НовыйНомерКатегории;
	
КонецФункции

Функция ПолучитьНовыеДанныеКатегорииРазмещения(ДанныеПреобразования, ДанныеРазмещенияДерева)
	
	РезультатФункции = Неопределено;
	
	КатегорииПалитры
		= ДанныеПреобразования.СоответствиеКатегорий.Получить(ДанныеРазмещенияДерева.ПалитраКатегорииРазмещения);
	Если Не КатегорииПалитры = Неопределено Тогда
		РезультатФункции = КатегорииПалитры.Получить(ДанныеРазмещенияДерева.НомерКатегорииРазмещения);
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ПолучитьДанныеРазмещенияСтрокиДерева(СтрокаДерева, ДанныеПреобразования)
	
	РезультатФункции = Новый Структура();
	НомерКатегорииРазмещения = 0;
	ПалитраКатегорииРазмещения = Неопределено;
	ПроверяемаяСтрока = СтрокаДерева;
	Пока НомерКатегорииРазмещения = 0 И Не ПроверяемаяСтрока = Неопределено Цикл
		НомерКатегорииРазмещения = ПроверяемаяСтрока.НомерКатегорииРазмещения;
		Если НомерКатегорииРазмещения > 0 Тогда
			ПалитраКатегорииРазмещения = ПроверяемаяСтрока.ПалитраВладелец;
		КонецЕсли;
		ПроверяемаяСтрока = ПроверяемаяСтрока.Родитель;
	КонецЦикла;
	Если НомерКатегорииРазмещения = 0 Тогда
		ПалитраКатегорииРазмещения = ДанныеПреобразования.ПалитраВладелец;
	КонецЕсли;
	РезультатФункции.Вставить("НомерКатегорииРазмещения", НомерКатегорииРазмещения);
	РезультатФункции.Вставить("ПалитраКатегорииРазмещения", ПалитраКатегорииРазмещения);
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура ДобавитьКорневуюКатегориюВДанныеПреобразования(ДанныеПреобразования, ПалитраВладелец)
	
	ДанныеНулевойКатегории = Новый Структура("НовыйНомер,ТекущийИндексВКатегории", 0, 0);
	ДанныеНулевойКатегории.Вставить("ИмеетсяГрупповойМодификатор", Ложь);
	КатегорииПалитры = Новый Соответствие();
	КатегорииПалитры.Вставить(0, ДанныеНулевойКатегории);
	
	ДанныеПреобразования.ПалитраВладелец = ПалитраВладелец;
	ДанныеПреобразования.СоответствиеКатегорий.Вставить(ПалитраВладелец, КатегорииПалитры);
	
КонецПроцедуры

Функция ИнициализироватьДанныеПреобразования()
	
	РезультатФункции = Новый Структура();
	РезультатФункции.Вставить("НомерСтроки", 0);
	РезультатФункции.Вставить("ВыделенныйНомерКатегории", 0);
	РезультатФункции.Вставить("СоответствиеКатегорий", Новый Соответствие());
	РезультатФункции.Вставить("ПалитраВладелец", Справочники.ПалитраТоваровРМК.ПустаяСсылка());
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура ОчиститьДанныеПреобразования(ДанныеПреобразования)
	
	Для Каждого КлючЗначение Из ДанныеПреобразования.СоответствиеКатегорий Цикл
		КлючЗначение.Значение.Очистить();
	КонецЦикла;
	ДанныеПреобразования.СоответствиеКатегорий.Очистить();
	
КонецПроцедуры

Функция СформироватьЛинейныйИерархическийСоставПалитр(ДеревоИерархииПалитры)
	
	ДанныеПреобразования = ИнициализироватьДанныеПреобразования();
	УровеньДерева = 0;
	ИсточникПалитры = 0;
	ТаблицаПалитры = ШаблонЛинейногоИерархическогоСоставаПалитр();
	
	ОбойтиСтрокиДереваСоставаПалитры(ТаблицаПалитры,
		ДеревоИерархииПалитры.Строки, ДанныеПреобразования, УровеньДерева, ИсточникПалитры);
	ОчиститьДанныеПреобразования(ДанныеПреобразования);
	Возврат ТаблицаПалитры;
	
КонецФункции

Функция ШаблонЛинейногоИерархическогоСоставаПалитр()
	
	ШаблонСостава = Справочники.ПалитраТоваровРМК.ПустаяСсылка().Состав.ВыгрузитьКолонки();
	ШаблонСостава.Колонки.Удалить("КатегорияРазмещения");
	ШаблонСостава.Колонки.Удалить("Шрифт");
	ШаблонСостава.Колонки.Удалить("ХарактеристикиИспользуются");
	ШаблонСостава.Колонки.Удалить("ЗаголовокЭлемента");
	ШаблонСостава.Колонки.Удалить("Палитра");
	
	ШаблонСостава.Колонки.Добавить("ИсточникПалитры", ОбщегоНазначения.ОписаниеТипаЧисло(2, 0, ДопустимыйЗнак.Неотрицательный));
	
	Возврат ШаблонСостава;
	
КонецФункции

Процедура ЗаполнитьПараметрыПалитрыДляСКД(Форма, ПалитраПлитки, МассивПалитр)
	
	ПалитраИзбранных = Неопределено;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "СтруктураПлиточногоИнтерфейсаПодбора") Тогда
		ПалитраПлитки = Форма.СтруктураПлиточногоИнтерфейсаПодбора;
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "СтруктураПлиточногоИнтерфейса") Тогда
		ПалитраПлитки = Форма.СтруктураПлиточногоИнтерфейса;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "НастройкаРМК") Тогда
		ПалитраИзбранных = Форма.НастройкаРМК.СтруктураБыстрыхТоваров;
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ТекущаяНастройкаРМК") Тогда
		ПалитраИзбранных = Форма.ТекущаяНастройкаРМК.СтруктураБыстрыхТоваров;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПалитраПлитки) Тогда
		МассивПалитр.Добавить(ПалитраПлитки);
	КонецЕсли;
	Если ЗначениеЗаполнено(ПалитраИзбранных) Тогда
		МассивПалитр.Добавить(ПалитраИзбранных);
	КонецЕсли;
	
КонецПроцедуры

Функция ГруппаИмеетГрупповойМодификатор(СтрокаДерева)

	РезультатФункции = Ложь;
	
	СтрокиУровня = ?(СтрокаДерева.Родитель = Неопределено, СтрокаДерева.Владелец().Строки, СтрокаДерева.Родитель.Строки);
	ОтборПодчиненныхСтрок = Новый Структура("НомерКатегорииРазмещения,ИсточникПалитры",
		СтрокаДерева.НомерКатегории, СтрокаДерева.ИсточникПалитры);
	ПодчиненныеЭлементы = СтрокиУровня.НайтиСтроки(ОтборПодчиненныхСтрок);
	ИндексПодчиненногоЭлемента = 0;
	КоличествоЭлементов = ПодчиненныеЭлементы.Количество();
	Пока ИндексПодчиненногоЭлемента < КоличествоЭлементов И Не РезультатФункции Цикл
		ПодчиненныйЭлемент = ПодчиненныеЭлементы.Получить(ИндексПодчиненногоЭлемента);
		Если ЗначениеЗаполнено(ПодчиненныйЭлемент.ВидМодификатора) Тогда
			РезультатФункции = Истина;
		КонецЕсли;
		ИндексПодчиненногоЭлемента = ИндексПодчиненногоЭлемента + 1;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

#КонецОбласти

#Область ПодборЗначений

Процедура СформироватьЭлементыПодбораЗначений(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	ОсновнаяГруппаЭлементов = Элементы.ПлиткаПанельПодбораЗначений;
	БазовыйШрифт = ПолучитьШрифтПлиткиПоУмолчанию(Форма);
	КоличествоКнопокВРяду = 6;
	ИндексКнопки = 0;
	Для ИндексРяда = 1 По 2 Цикл
		
		РядКнопок = ДобавитьРядКнопокПодборЗначений(ОсновнаяГруппаЭлементов, ИндексРяда, Элементы);
		
		Для СчетчикКнопок = 1 По КоличествоКнопокВРяду Цикл
			
			ДобавитьКнопкуПодборЗначений(РядКнопок, ИндексКнопки, Форма, БазовыйШрифт);
			ИндексКнопки = ИндексКнопки + 1;
			
		КонецЦикла;
		
	КонецЦикла;
		
КонецПроцедуры

Процедура ДобавитьКнопкуПодборЗначений(РядКнопок, ИндексКнопки, Форма, БазовыйШрифт)
	
	ПутьКДаннымПустойКартинки = "ПустаяКартинка";

	ШрифтТекста = ШрифтыСтиля.ОбычныйШрифтТекста;
	ШрифтЦены = ШрифтыСтиля.ШрифтОбычныйПолужирныйРМК;
	ШрифтГорячейКлавиши = ШрифтыСтиля.ШрифтОбычныйПолужирный12РМК;
	БезРамки = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки);
	ЭлементыФормы = Форма.Элементы;
	
	//Основная группа элемента
	ИмяЭлемента = СтрШаблон("ПодборЗначений_Элемент01_%1", ИндексКнопки);
	ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), РядКнопок);
	ЭлементФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ЭлементФормы.ОтображатьЗаголовок = Ложь;
	ЭлементФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ЭлементФормы.РастягиватьПоВертикали = Ложь;
	ЭлементФормы.РастягиватьПоГоризонтали = Истина;
	ЭлементФормы.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
	ЭлементФормы.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
	ЭлементФормы.Ширина = 35;
	ЭлементФормы.Высота = 4;
	ГруппаОсновная = ЭлементФормы;
	
	ИмяЭлемента = СтрШаблон("ПодборЗначений_Элемент12_%1", ИндексКнопки);
	ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), ГруппаОсновная);
	ЭлементФормы.Вид 						= ВидГруппыФормы.ОбычнаяГруппа;
	ЭлементФормы.ОтображатьЗаголовок 		= Ложь;
	ЭлементФормы.Группировка				= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаВерхняя = ЭлементФормы;
	
	//Элемент основная
	ИмяЭлемента = СтрШаблон("ПодборЗначений_Элемент02_%1", ИндексКнопки);
	ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаВерхняя);
	ЭлементФормы.Вид 						= ВидПоляФормы.ПолеКартинки;
	ЭлементФормы.Рамка 						= БезРамки;
	ЭлементФормы.ПоложениеЗаголовка 		= ПоложениеЗаголовкаЭлементаФормы.Нет;
	ЭлементФормы.Гиперссылка 				= Истина;
	ЭлементФормы.Шрифт						= ШрифтТекста;
	ЭлементФормы.ПутьКДанным 				= ПутьКДаннымПустойКартинки;
	ЭлементФормы.УстановитьДействие("Нажатие", "Подключаемый_ЗначениеВыбор");
	
	ИмяЭлемента = СтрШаблон("ПодборЗначений_Элемент13_%1", ИндексКнопки);
	ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), ГруппаОсновная);
	ЭлементФормы.Вид 						= ВидГруппыФормы.ОбычнаяГруппа;
	ЭлементФормы.ОтображатьЗаголовок 		= Ложь;
	ЭлементФормы.Группировка				= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ЭлементФормы.РастягиватьПоВертикали		= Ложь;
	ЭлементФормы.Высота						= 1;
	ГруппаНижняя = ЭлементФормы;
	
	//Элемент цена
	ИмяЭлемента = СтрШаблон("ПодборЗначений_Элемент03_%1", ИндексКнопки);
	ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаНижняя);
	ЭлементФормы.Вид 						= ВидПоляФормы.ПолеКартинки;
	ЭлементФормы.Рамка 						= БезРамки;
	ЭлементФормы.ПоложениеЗаголовка 		= ПоложениеЗаголовкаЭлементаФормы.Нет;
	ЭлементФормы.Гиперссылка 				= Истина;
	ЭлементФормы.ПутьКДанным 				= ПутьКДаннымПустойКартинки;
	ЭлементФормы.АвтоМаксимальнаяШирина		= Ложь;
	ЭлементФормы.Ширина						= 7;
	ЭлементФормы.МаксимальнаяШирина			= 7;
	ЭлементФормы.РастягиватьПоГоризонтали	= Истина;
	ЭлементФормы.Шрифт						= ШрифтЦены;
	ЭлементФормы.УстановитьДействие("Нажатие", "Подключаемый_ЗначениеВыбор");
	
	//Элемент остаток
	ИмяЭлемента = СтрШаблон("ПодборЗначений_Элемент04_%1", ИндексКнопки);
	ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаНижняя);
	ЭлементФормы.Вид 						= ВидПоляФормы.ПолеКартинки;
	ЭлементФормы.Рамка 						= БезРамки;
	ЭлементФормы.ПоложениеЗаголовка 		= ПоложениеЗаголовкаЭлементаФормы.Нет;
	ЭлементФормы.Гиперссылка 				= Истина;
	ЭлементФормы.ПутьКДанным 				= ПутьКДаннымПустойКартинки;
	ЭлементФормы.Ширина						= 1;
	ЭлементФормы.УстановитьДействие("Нажатие", "Подключаемый_ЗначениеВыбор");
	
КонецПроцедуры

Функция ДобавитьРядКнопокПодборЗначений(РодительскийЭлемент, ИндексРяда, Элементы)
	
	ИмяРяда = СтрШаблон("ПодборЗначенийРядКнопок_%1", ИндексРяда);
	НовыйРяд = Элементы.Найти(ИмяРяда);
	Если НовыйРяд = Неопределено Тогда
		НовыйРяд = Элементы.Добавить(ИмяРяда, Тип("ГруппаФормы"), РодительскийЭлемент);
	КонецЕсли;
	НовыйРяд.Вид 						= ВидГруппыФормы.ОбычнаяГруппа;
	НовыйРяд.Группировка				= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НовыйРяд.ОтображатьЗаголовок 		= Ложь;
	НовыйРяд.РастягиватьПоГоризонтали	= Истина;
	НовыйРяд.РастягиватьПоВертикали		= Истина;
	НовыйРяд.Высота 					= 2;
	
	Возврат НовыйРяд;
	
КонецФункции
#КонецОбласти
