#Область ПрограммныйИнтерфейс

Функция ПроверитьНаличиеДоговораОнлайнОплаты(Организация) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =  
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НастройкиОнлайнОплат.СДоговором КАК СДоговором
	|ИЗ
	|	Справочник.НастройкиОнлайнОплат КАК НастройкиОнлайнОплат
	|ГДЕ
	|	НастройкиОнлайнОплат.Организация = &Организация"; 
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса 			= Запрос.Выполнить();
	ВыборкаИзРезультатаЗапроса 	= РезультатЗапроса.Выбрать();
	
	НаличиеДоговора 			= ?(ВыборкаИзРезультатаЗапроса.Следующий(), ВыборкаИзРезультатаЗапроса.СДоговором, Ложь);
	
	Возврат НаличиеДоговора;
	
КонецФункции

#КонецОбласти
