
Функция ПолучитьДолжностьСотрудникаНаДату(Сотрудник, Дата) Экспорт
	
	Должность = Неопределено;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ОтветственныеЛицаОрганизацийСрезПоследних.Должность КАК Должность
	|ИЗ
	|	РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&Дата, ФизическоеЛицо = &Сотрудник) КАК ОтветственныеЛицаОрганизацийСрезПоследних";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Должность = Выборка.Должность;
	КонецЕсли;
	
	Возврат Должность;
	
КонецФункции