#Область СлужебныйПрограммныйИнтерфейс

// Определяет имя плана обмена, в котором будет сохранены настройки
// обмена данными с внешними системами.
//
// Параметры:
//   ИмяПланаОбмена - Строка - имя метаданных плана обмена.
//
// Пример:
//	ИмяПланаОбмена = "ОбменСМобильнымиПриложениями";
//
Процедура ПриОпределенииИмениПланаОбмена(ИмяПланаОбмена) Экспорт
	
КонецПроцедуры

// Переопредеяет имя формы настроек обмена с мобильным приложением.
//
// Параметры:
//   ВариантНастройки - Строка - значение реквизита справочника "Мобильные приложения"
//   ИмяФормыНастроек - Строка - имя формы настроек обмена с мобильным приложением
//   НеобходимПереходПоСсылке - Булево - признак необходимости перейти по навигационной ссылке ИмяФормыНастроек
//
Процедура ПриОпределенииФормыНастроекПриложения(ВариантНастройки, ИмяФормыНастроек, НеобходимПереходПоСсылке) Экспорт
	
	Если ВариантНастройки = "ПроверкаЦенников" Тогда
		ИмяФормыНастроек = "Справочник.ПодключаемоеОборудование.ФормаСписка";
	КонецЕсли;
	
	Если ВариантНастройки = "МобильнаяКасса" Тогда
		ИмяФормыНастроек = "https://v8.1c.ru/upload/1ckassa/mk_rt_ed.pdf";
		НеобходимПереходПоСсылке = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

