
#Область СлужебныеПроцедурыИФункции

Функция ПроверятьНеобходимостьСозданияДокументовЕГАИС() Экспорт
	
	Возврат Константы.ПроверятьНеобходимостьСозданияДокументовЕГАИС.Получить();
	
КонецФункции

Функция ТипыДокументовГосИС() Экспорт
	
	ТипыДокументов = Новый Массив;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ГосИС") Тогда
		
		ПодсистемыГосИС = Метаданные.Подсистемы.ГосИС.Подсистемы;
		ДокуентыВсе = Метаданные.Документы;
		
		Для Каждого Документ Из ДокуентыВсе Цикл
			Для Каждого ПодсистемаГосИС Из ПодсистемыГосИС Цикл
				Если ПодсистемаГосИС.Состав.Содержит(Документ) Тогда
					ТипДокументаСтрокой = СтрШаблон("ДокументСсылка.%1", Документ.Имя);
					ТипыДокументов.Добавить(Тип(ТипДокументаСтрокой));
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ТипыДокументов;
	
КонецФункции

#КонецОбласти