
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидимостьКомандУправленияКлассификатором = ПравоДоступа("Изменение", Метаданные.РегистрыСведений.АдресныеОбъекты);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ФормаЗагрузитьКлассификатор", "Видимость", ВидимостьКомандУправленияКлассификатором);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ФормаОчиститьКлассификатор", "Видимость", ВидимостьКомандУправленияКлассификатором);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ЗагруженАдресныйКлассификатор" Или ИмяСобытия = "ОчищенАдресныйКлассификатор" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьКлассификатор(Команда)
	
	АдресныйКлассификаторКлиент.ЗагрузитьАдресныйКлассификатор();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКлассификатор(Команда)
	
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("РегистрСведений.АдресныеОбъекты.Форма.ОчисткаАдресногоКлассификатора", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти
