
&Вместо("ПолучитьИнформациюПоГрупповомуКоду")
Функция EF_00_00061054_ПолучитьИнформациюПоГрупповомуКоду(ДанныеПоГрупповомуКоду, КодАгрегата, ВидУпаковки, ФорматBase64)
	
	СтруктураКода = Новый Структура("GTIN, GTINВерхнегоУровня, EAN, EANВерхнегоУровня, Номенклатура, Характеристика, ВидУпаковки, ВидПродукции, Количество", 
									 "", "", "", Неопределено, Неопределено, Неопределено, Неопределено, Неопределено, 1);
	
	Если ФорматBase64 Тогда
		КодАгрегатаСтрока = РазборИОбработкаКодовМаркировкиИСМПТКСлужебныйКлиентСервер.Base64ВШтрихкод(КодАгрегата);
	КонецЕсли;
	
	ВложенныеКоды = ДанныеПоГрупповомуКоду.ДанныеОбАгрегации[КодАгрегатаСтрока];
	Если ВложенныеКоды = Неопределено И ВидУпаковки = Перечисления.ВидыУпаковокИСМПТК.Групповая Тогда
		Если СтрНачинаетсяС(КодАгрегатаСтрока, "(") Тогда 
			ВложенныеКоды = ДанныеПоГрупповомуКоду.ДанныеОбАгрегации[СтрШаблон("%1%2%3",
			Сред(КодАгрегатаСтрока, 2, 2), Сред(КодАгрегатаСтрока, 5,14), Сред(КодАгрегатаСтрока, 23))];
		Иначе 
			ВложенныеКоды = ДанныеПоГрупповомуКоду.ДанныеОбАгрегации[СтрШаблон("(%1)%2(%3)%4",
			Сред(КодАгрегатаСтрока, 1, 2), Сред(КодАгрегатаСтрока, 3,14), Сред(КодАгрегатаСтрока, 17,2), Сред(КодАгрегатаСтрока, 19))];
		КонецЕсли;
	КонецЕсли;
	
	Если Не ВложенныеКоды = Неопределено Тогда
		
		Если Не ВложенныеКоды.Количество() = 0 Тогда
			ДанныеПоАгрегированномуКоду(ВложенныеКоды, СтруктураКода, КодАгрегатаСтрока);
		Иначе
			КодДляСообщения = СтрЗаменить(КодАгрегатаСтрока, Символ(29), ""); 
			ТекстСообщения = НСтр("ru = 'Для кода %КодМаркировки% не удалось получить информацию о составе вложенностей со стороны сервера.'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%КодМаркировки%", КодДляСообщения);  
			ОбщегоНазначенияИСМПТККлиентСерверПереопределяемый.СообщитьПользователю(ТекстСообщения);
			
			ДанныеРазбора = ПолучитьКодыМаркировки(Новый Структура("Штрихкод, ФорматBase64, Количество", КодАгрегата, ФорматBase64, 1));
			Если Не ДанныеРазбора = Неопределено 
				И Не ТипЗнч(ДанныеРазбора)= Тип("Строка") Тогда
				ЗаполнитьЗначенияСвойств(СтруктураКода, ДанныеРазбора);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
		
	Возврат СтруктураКода;
	
КонецФункции
