
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ТекстыЗапросовШтрихкодов

// Добавляет к массиву текст запроса штрихкодов по основному регистру.
// Поля запроса: Штрихкод, Владелец, Характеристика, Упаковка, Количество, ШаблонШтрихкода.
// ШаблонШтрихкода - Перечисление, в запросе определяется по типу значения владельца штрихкода.
//
// Параметры:
//  ФильтрПоискаПоШтрихкоду - Структура - с ключами поиска
//  МассивЗапросов - Массив - текстов запросов
//
Процедура ДобавитьТекстЗапросаШтрихкоды(ФильтрПоискаПоШтрихкоду, МассивЗапросов) Экспорт
	РаботаСоШтрихкодамиРТ.ДобавитьТекстЗапросаШтрихкоды(ФильтрПоискаПоШтрихкоду, МассивЗапросов);
КонецПроцедуры

// Добавляет к массиву текст запроса серий номенклатуры.
// Текст входит в состав объединения запросов, поэтому псевдонимы полей не нужны.
// Поля запроса: Номер, Ссылка, Null, Null, 1, ШаблонШтрихкода.
// ШаблонШтрихкода - Неопределено.
//
// Параметры:
//  ФильтрПоискаПоШтрихкоду - Структура - с ключами поиска
//  МассивЗапросов - Массив - текстов запросов
//
Процедура ДобавитьТекстЗапросаСерии(ФильтрПоискаПоШтрихкоду, МассивЗапросов) Экспорт
	РаботаСоШтрихкодамиРТ.ДобавитьТекстЗапросаСерии(ФильтрПоискаПоШтрихкоду, МассивЗапросов);
КонецПроцедуры

// Добавляет к массиву текст запроса кодов SKU.
// Текст входит в состав объединения запросов, поэтому псевдонимы полей не нужны.
// Поля запроса: SKU, Номенклатура, Характеристика, Упаковка, Количество, ШаблонШтрихкода.
// ШаблонШтрихкода - Неопределено.
//
// Параметры:
//  ФильтрПоискаПоШтрихкоду - Структура - с ключами поиска
//  МассивЗапросов - Массив - текстов запросов
//
Процедура ДобавитьТекстЗапросаКодыSKU(ФильтрПоискаПоШтрихкоду, МассивЗапросов) Экспорт
	РаботаСоШтрихкодамиРТ.ДобавитьТекстЗапросаКодыSKU(ФильтрПоискаПоШтрихкоду, МассивЗапросов);
КонецПроцедуры

// Добавляет к массиву текст запроса штрихкодов упаковок товаров.
// Текст входит в состав объединения запросов, поэтому псевдонимы полей не нужны.
// Поля запроса: ЗначениеШтрихкода, Ссылка, Характеристика, Упаковка, Количество, ШаблонШтрихкода.
// ШаблонШтрихкода - Неопределено.
//
// Параметры:
//  ФильтрПоискаПоШтрихкоду - Структура - с ключами поиска
//  МассивЗапросов - Массив - текстов запросов
//
Процедура ДобавитьТекстЗапросаШтрихкодыУпаковокТоваров(ФильтрПоискаПоШтрихкоду, МассивЗапросов) Экспорт
	РаботаСоШтрихкодамиРТ.ДобавитьТекстЗапросаШтрихкодыУпаковокТоваров(ФильтрПоискаПоШтрихкоду, МассивЗапросов);
КонецПроцедуры

// Добавляет к массиву текст запроса номенклатуры по реквизиту КодВидаНоменклатурнойКлассификации.
// Текст входит в состав объединения запросов, поэтому псевдонимы полей не нужны.
// Поля запроса: ЗначениеШтрихкода, Ссылка, Характеристика, Упаковка, Количество, ШаблонШтрихкода.
// ШаблонШтрихкода - НоменклатураСИЗ.
//
// Параметры:
//  ФильтрПоискаПоШтрихкоду - Структура - с ключами поиска
//  МассивЗапросов - Массив - текстов запросов
//
Процедура ДобавитьТекстЗапросаНоменклатурнойКлассификации(ФильтрПоискаПоШтрихкоду, МассивЗапросов) Экспорт
	РаботаСоШтрихкодамиРТ.ДобавитьТекстЗапросаНоменклатурнойКлассификации(ФильтрПоискаПоШтрихкоду, МассивЗапросов);
КонецПроцедуры

// Добавляет к массиву текст запроса шаблонов регистрации новых карт.
// Текст входит в состав объединения запросов, поэтому псевдонимы полей не нужны.
// Поля запроса: &КодКарты, НЕОПРЕДЕЛЕНО, NULL, NULL, NULL, ШаблонШтрихкода.
// ШаблонШтрихкода - Перечисление - Карта.
//
// Параметры:
//  ФильтрПоискаПоШтрихкоду - Структура - с ключами поиска
//  МассивЗапросов - Массив - текстов запросов
//
Процедура ДобавитьТекстЗапросаШаблоныРегистрацииКарт(ФильтрПоискаПоШтрихкоду, МассивЗапросов) Экспорт
	РаботаСоШтрихкодамиРТ.ДобавитьТекстЗапросаШаблоныРегистрацииКарт(ФильтрПоискаПоШтрихкоду, МассивЗапросов);
КонецПроцедуры

// Добавляет к массиву текст запроса по номеру телефона.
// Текст входит в состав объединения запросов, поэтому псевдонимы полей не нужны.
// Поля запроса: &НомерТелефона, Ссылка, NULL, NULL, NULL, ШаблонШтрихкода.
// ШаблонШтрихкода - Перечисление - Телефон.
//
// Параметры:
//  ФильтрПоискаПоШтрихкоду - Структура - с ключами поиска
//  МассивЗапросов - Массив - текстов запросов
//
Процедура ДобавитьТекстЗапросаПоТелефону(ФильтрПоискаПоШтрихкоду, МассивЗапросов) Экспорт
	РаботаСоШтрихкодамиРТ.ДобавитьТекстЗапросаПоТелефону(ФильтрПоискаПоШтрихкоду, МассивЗапросов);
КонецПроцедуры

// Добавляет к массиву текст запроса по адресу ЭП.
// Текст входит в состав объединения запросов, поэтому псевдонимы полей не нужны.
// Поля запроса: &НомерТелефона, Ссылка, NULL, NULL, NULL, ШаблонШтрихкода.
// ШаблонШтрихкода - Перечисление - АдресЭП.
//
// Параметры:
//  ФильтрПоискаПоШтрихкоду - Структура - с ключами поиска
//  МассивЗапросов - Массив - текстов запросов
//
Процедура ДобавитьТекстЗапросаПоАдресуЭП(ФильтрПоискаПоШтрихкоду, МассивЗапросов) Экспорт
	РаботаСоШтрихкодамиРТ.ДобавитьТекстЗапросаПоАдресуЭП(ФильтрПоискаПоШтрихкоду, МассивЗапросов);
КонецПроцедуры

// Добавляет к массиву текст запроса штрихкодов по основному регистру.
// Поля запроса: Штрихкод, Владелец, Характеристика, Упаковка, Количество, ШаблонШтрихкода.
// ШаблонШтрихкода - Перечисление, в запросе определяется по типу значения владельца штрихкода.
//
// Параметры:
//  ФильтрПоискаПоШтрихкоду - Структура - с ключами поиска
//  МассивЗапросов - Массив - текстов запросов
//
Процедура ДобавитьТекстЗапросаДополнительныеОбъекты(ФильтрПоискаПоШтрихкоду, МассивЗапросов) Экспорт
	РаботаСоШтрихкодамиРТ.ДобавитьТекстЗапросаДополнительныеОбъекты(ФильтрПоискаПоШтрихкоду, МассивЗапросов);
КонецПроцедуры

// Добавляет к массиву текст запроса поиск по регистру "КассирыДляВхода"
// Поля запроса: Штрихкод, Владелец, Характеристика, Упаковка, Количество, ШаблонШтрихкода.
// ШаблонШтрихкода - Перечисление, в запросе определяется по типу значения владельца штрихкода.
//
// Параметры:
//  ФильтрПоискаПоШтрихкоду - Структура - с ключами поиска
//  МассивЗапросов - Массив - текстов запросов
//
Процедура ДобавитьТекстЗапросаКассирыДляВхода(ФильтрПоискаПоШтрихкоду, МассивЗапросов) Экспорт

КонецПроцедуры

#КонецОбласти

// Заполняет структуру префиксов номенклатуры.
//
// Параметры:
//  СтруктураПрефиксов          - Структура - с ключами:
//   * НоменклатураВесовой      - Строка - префикс весового товара.
//   * НоменклатураФасованный   - Строка - префикс фасованного товара.
//   * НоменклатураШтучный      - Строка - префикс штучного товара.
//   * СерийныйНомерСертификата - Строка - префикс подарочного сертификата.
//
Процедура ЗаполнитьПрефиксыШтрихкодовНоменклатуры(СтруктураПрефиксов) Экспорт
	
	РаботаСоШтрихкодамиРТ.ЗаполнитьПрефиксыШтрихкодовНоменклатуры(СтруктураПрефиксов);
	
КонецПроцедуры

// Заполняет таблицу шаблонов штрихкодов регистрации новых карт.
//
// Параметры:
//  Шаблоны - ТаблицаЗначений:
//   * ДополнительноеОписание - Строка - наименование шаблона.
//   * НачалоДиапазона        - Строка
//   * КонецДиапазона         - Строка
//   * ДлинаШтрихкода         - Число
//
Процедура ЗаполнитьТаблицуШаблоновРегистрацииНовыхКарт(Шаблоны) Экспорт
	
	РаботаСоШтрихкодамиРТ.ЗаполнитьТаблицуШаблоновРегистрацииНовыхКарт(Шаблоны);
	
КонецПроцедуры

// Заполняет признак в "Истина" если для вызывающей формы доступен ввод произвольных
// телефонных номеров и адресов ЭП
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма, из которой вызвана команда
//  ДобавлятьНеизвестнуюКИ - Булево - Признак использования неизвестной КИ
//
Процедура ЗаполнитьПризнакВводаНеизвестнойКИ(Форма, ДобавлятьНеизвестнуюКИ) Экспорт
	
	РаботаСоШтрихкодамиРТ.ЗаполнитьПризнакВводаНеизвестнойКИ(Форма, ДобавлятьНеизвестнуюКИ);
	
КонецПроцедуры

// Заполняет дополнительные данные строки выборки.
//
// Параметры:
//  ДополнительныеДанные - Структура - формируемая в этой процедуре для дополнительного анализа строки.
//  Выборка - ВыборкаИзРезультатаЗапроса - выборка запроса, для заполнения дополнительных данных.
//
Процедура ЗаполнитьДополнительныеДанныеОбъектовВыборки(ДополнительныеДанные, Выборка) Экспорт
	
	РаботаСоШтрихкодамиРТ.ЗаполнитьДополнительныеДанныеОбъектовВыборки(ДополнительныеДанные, Выборка);
	
КонецПроцедуры

// Заполняет таблицу остатков по складу
//
// Параметры:
//  ТаблицаНоменклатурыДляОстатков - ТаблицаЗначений - содержит строки для поиска остатков. Колонки:
//   * Номенклатура - ОпределяемыйТип.НоменклатураШтрихкода - номенклатура.
//   * Характеристика - ОпределяемыйТип.ХарактеристикаНоменклатурыШтрихкода - характеристика номенклатуры.
//   * Упаковка - ОпределяемыйТип.УпаковкаНоменклатурыШтрихкода - упаковки номенклатуры.
//  СкладОстатков - ОпределяемыйТип.СкладОстатков - склад для которого необходимо получить остатки.
//  ТаблицаОстатков - ТаблицаЗначений - содержит строки с остатками по складу. Колонки:
//   * Номенклатура - ОпределяемыйТип.НоменклатураШтрихкода - номенклатура.
//   * Характеристика - ОпределяемыйТип.ХарактеристикаНоменклатурыШтрихкода - характеристика номенклатуры.
//   * Упаковка - ОпределяемыйТип.УпаковкаНоменклатурыШтрихкода - упаковки номенклатуры.
//   * Остаток - Число - количество остатка на складе.
//   * Резерв - Число - количество зарезервировано на складе.
//
Процедура ЗаполнитьОстаткиПоСкладу(ТаблицаНоменклатурыДляОстатков, СкладОстатков, ТаблицаОстатков) Экспорт
	
	РаботаСоШтрихкодамиРТ.ЗаполнитьОстаткиПоСкладу(ТаблицаНоменклатурыДляОстатков, СкладОстатков, ТаблицаОстатков);
	
КонецПроцедуры

// Заполняет склад по умолчанию.
//
// Параметры:
//  ТекущийСклад - ОпределяемыйТип.СкладОстатковФормыВыбораПоискаПоШК.
//
Процедура ЗаполнитьТекущийСклад(ТекущийСклад) Экспорт
	
	РаботаСоШтрихкодамиРТ.ЗаполнитьТекущийСклад(ТекущийСклад);
	
КонецПроцедуры

// Заполняет структуру весового товара по штрихкоду.
//
// Параметры:
//  Штрихкод - Строка
//  СтруктураВесовогоТовара - Структура - с ключами:
//   * КодТовара        - Число - код SKU.
//   * КоличествоТовара - Число - количество весового (фасованного) товара.
//
Процедура ЗаполнитьКодИКоличествоВесовогоТовара(Штрихкод, СтруктураВесовогоТовара) Экспорт
	
	РаботаСоШтрихкодамиРТ.ЗаполнитьКодИКоличествоВесовогоТовара(Штрихкод, СтруктураВесовогоТовара);
	
КонецПроцедуры

// Заполняет массив именами справочников в которых необходим поиск по контактной информации.
//
// Параметры:
//  СправочникиСКИ - Массив из имен справочников
//  ФильтрПоискаПоШтрихкоду - Структура - с ключами поиска
//
Процедура ЗаполнитьМассивСправочниковСКИ(СправочникиСКИ, ФильтрПоискаПоШтрихкоду) Экспорт
	
	РаботаСоШтрихкодамиРТ.ЗаполнитьМассивСправочниковСКИ(СправочникиСКИ, ФильтрПоискаПоШтрихкоду);
	
КонецПроцедуры

// Дополняет строку таблицы формы ФормаВыбораДанныхПоискаПоШтрихкоду
//
// Параметры:
//  НоваяСтрока - ДанныеФормыЭлементДерева - строка дерева формы выбора
//  СтрокаВыбора - Структура - с ключами значений найденного объекта
//
Процедура ДополнитьСтрокуТаблицыВыбора(НоваяСтрока, СтрокаВыбора) Экспорт
	
	РаботаСоШтрихкодамиРТ.ДополнитьСтрокуТаблицыВыбора(НоваяСтрока, СтрокаВыбора);
	
КонецПроцедуры

// Корректирует результаты поиска по штрихкоду перед выводом на форму
//
Процедура СкорректироватьСтруктуруРезультата(
	СтруктураПараметров,
	Штрихкод,
	СтруктураДействий,
	НеизвестныеДанныеПО,
	ВозможнаРегистрацияНовойНоменклатуры) Экспорт
	
	РаботаСоШтрихкодамиРТ.СкорректироватьСтруктуруРезультата(
		СтруктураПараметров,
		Штрихкод,
		СтруктураДействий,
		НеизвестныеДанныеПО,
		ВозможнаРегистрацияНовойНоменклатуры);
	
КонецПроцедуры

// Дополняет запрос поиска по штрихкоду
//
// Параметры:
//  Запрос - Запрос - запрос выборки данных.
//  Форма - УправляемаяФорма - форма в которой будет происходить сканирование
//  ДополнительныеПараметры - Структура - содержащая параметры штрихкода.
//
Процедура ДополнитьПараметрыЗапросаПоиска(Запрос, Форма, ДополнительныеПараметры = Неопределено) Экспорт
	
	РаботаСоШтрихкодамиРТ.ДополнитьПараметрыЗапросаПоиска(Запрос, Форма, ДополнительныеПараметры);
	
КонецПроцедуры

// Заполняет структуру с ключами поиска по умолчанию
//
// Параметры:
//  ФильтрПоискаПоУмолчанию - Структура - ключей поиска по умолчанию.
//
Процедура ЗаполнитьФильтрПоискаПоУмолчанию(ФильтрПоискаПоУмолчанию) Экспорт
	
	РаботаСоШтрихкодамиРТ.ЗаполнитьФильтрПоискаПоУмолчанию(ФильтрПоискаПоУмолчанию);
	
КонецПроцедуры

// Формирует структуру с ключами определяющими построение запроса поиска
// устанавливает эту структуру в реквизит формы ФильтрПоискаПоШтрихкоду
//
// Параметры:
//  Форма - УправляемаяФорма - форма в которой будет происходить сканирование
//
Процедура ОпределитьФильтрПоискаШтрихкода(Форма) Экспорт
	
	РаботаСоШтрихкодамиРТ.ОпределитьФильтрПоискаШтрихкода(Форма);
	
КонецПроцедуры

// Обработка полученного штрихкода.
//
// Параметры:
//  Штрихкод - Строка - полученный штрихкод со сканера.
//  Форма - УправляемаяФорма - форма родитель в которой определен обработчик действия "ПолученыШтрихкоды".
//  ДанныеШтрихкода - Структура - данные штрихкода.
//
Процедура ЗаполнитьДанныеПоискаПоШтрихкоду(Штрихкод, Форма, ДанныеШтрихкода) Экспорт
	
	РаботаСоШтрихкодамиРТ.ЗаполнитьДанныеПоискаПоШтрихкоду(Штрихкод, Форма, ДанныеШтрихкода);
	
КонецПроцедуры

// Настраивает подключаемое оборудование в форме,
// устанавливает флаг ИспользоватьПодключаемоеОборудование в форме.
//
// Параметры:
//  Форма - УправляемаяФорма - форма в которой настраивается подключение оборудования.
//
Процедура НастроитьПодключаемоеОборудование(Форма) Экспорт
	
	РаботаСоШтрихкодамиРТ.НастроитьПодключаемоеОборудование(Форма);
	
КонецПроцедуры

// Настраивает форму анализа штрихкодов.
//
// Параметры:
//  Форма - УправляемаяФорма - форма анализа штрихкодов.
//
Процедура НастроитьФормуАнализаШтрихкодов(Форма) Экспорт
	
	РаботаСоШтрихкодамиРТ.НастроитьФормуАнализаШтрихкодов(Форма);
	
КонецПроцедуры

// Подготавливает номер телефона в формате, подходящем для поиска в контактной информации текущей информационной базы.
//
// Параметры:
//  ПараметрНомерТелефона - Строка - номер телефона в формате, подходящем для поиска,
//  НомерТелефона - Строка - исходный номер телефона
//
Процедура ПодготовитьНомерТелефонаДляПоиска(ПараметрНомерТелефона, НомерТелефона) Экспорт
	
КонецПроцедуры

// Переопределяет признак выполнения поиска по штрихкуду
//
// Параметры:
//  ВыполнитьПоиск - Булево - признак выполнения поиска.
//  ДополнительныеПараметры - Структура - параметры для определения признака.
//
Процедура ПереопределитьПризнакВыполненияПоиска(ВыполнитьПоиск, ДополнительныеПараметры) Экспорт
	
КонецПроцедуры

#КонецОбласти
