
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТекстВопроса = НСтр("ru = 'Повторная печать кодов не рекомендуется, т.к. противоречит правилам маркировки товаров!'")
				 + Символы.ПС
				 + НСтр("ru = 'Вы уверены, что хотите сбросить флаг печати по выбранному документу ""%НаименованиеДокумента%""?'");
	ТекстВопроса = СтрЗаменить(ТекстВопроса, "%НаименованиеДокумента%", ПолучитьПредставлениеЗаказа()); 
	
	Если Не ПараметрыВыполненияКоманды.Источник.Элементы.СписокЗакрытые.ТекущиеДанные = Неопределено Тогда
		ПараметрыВыполнения = Новый Структура();
		ПараметрыВыполнения.Вставить("ЗаказДляСброса", ПараметрыВыполненияКоманды.Источник.Элементы.СписокЗакрытые.ТекущиеДанные.ЗаказНаЭмиссию);
		ПараметрыВыполнения.Вставить("ФормаЗаказа",    ПараметрыВыполненияКоманды.Источник);
		СброситьФлагПечатиПоЗаказуЗавершение = Новый ОписаниеОповещения("СброситьФлагПечатиПоЗаказуЗавершение", ПечатьКодовМаркировкиИСМПТККлиент, ПараметрыВыполнения);
		ПоказатьВопрос(СброситьФлагПечатиПоЗаказуЗавершение, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	Иначе
		ТекстСообщения = НСтр("ru = 'Не выбран Заказ!'");
		ОбщегоНазначенияИСМПТККлиентСерверПереопределяемый.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПредставлениеЗаказа()
	
	Возврат Метаданные.Документы.ЗаказКодовМаркировкиСУЗИСМПТК.Представление();
	
КонецФункции