// @strict-types


#Область ОписаниеПеременных

// Объявляю три новых массива, которые будут получать данные 	

Массив1 = Новый Массив;

Массив2 = Новый Массив;

Массив3 = Новый Массив; 

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
