#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Пользователи
	АвторизованныйПользователь = Пользователи.АвторизованныйПользователь();
	Если ПравоДоступа("Просмотр", Метаданные.НайтиПоТипу(ТипЗнч(АвторизованныйПользователь))) Тогда
		Элементы.СведенияОПользователе.Заголовок = АвторизованныйПользователь;
	Иначе
		Элементы.ГруппаПользователь.Видимость = Ложь;
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Пользователи
	
	// БазоваяФункциональность
	ЗапрашиватьПодтверждениеПриЗавершенииПрограммы = СтандартныеПодсистемыСервер.ЗапрашиватьПодтверждениеПриЗавершенииПрограммы();
	// Конец БазоваяФункциональность
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СведенияОПользователе(Команда)
	
	ПоказатьЗначение(, АвторизованныйПользователь);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеПароляПользователя(Команда)
    
    // &ЗамерПроизводительности
    ОценкаПроизводительностиРТКлиент.НачатьЗамер(
             Истина, "Обработка.ИзменениеПароляПользователяИБ.Форма.ФормаСменыПароля.Открытие");
             
	ОткрытьФорму("Обработка.ИзменениеПароляПользователяИБ.Форма");
	
КонецПроцедуры

&НаКлиенте
Процедура ПерсональныеНастройкиРаботыСФайлами(Команда)
    
    // &ЗамерПроизводительности
    ОценкаПроизводительностиРТКлиент.НачатьЗамер(
             Истина, "ОбщаяФорма.ПерсональныеНастройкиРаботыСФайлами.Открытие");
	
	ОткрытьФорму("ОбщаяФорма.ПерсональныеНастройкиРаботыСФайлами");
	
КонецПроцедуры

&НаКлиенте
Процедура ПерсональнаяНастройкаПроксиСервера(Команда)
	
	ОткрытьФорму("ОбщаяФорма.ПараметрыПроксиСервера",
	                  Новый Структура("НастройкаПроксиНаКлиенте", Истина));
	
 КонецПроцедуры

&НаКлиенте
Процедура ИзменениеТекущегоМагазина(Команда)
    
    // &ЗамерПроизводительности
    ОценкаПроизводительностиРТКлиент.НачатьЗамер(
             Истина, "Обработка.ИзменениеТекущегоМагазина.Форма.Форма.Открытие");

	ОткрытьФорму("Обработка.ИзменениеТекущегоМагазина.Форма");

КонецПроцедуры

&НаКлиенте
Процедура ЗадатьДействиеПриВыбореМакетаПечатнойФормы(Команда)
    
    // &ЗамерПроизводительности
    ОценкаПроизводительностиРТКлиент.НачатьЗамер(
             Истина, "РегистрСведений.ПользовательскиеМакетыПечати.Форма.ВыбораРежимаОткрытияМакета.Открытие");

	ОткрытьФорму("РегистрСведений.ПользовательскиеМакетыПечати.Форма.ВыбораРежимаОткрытияМакета");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗапрашиватьПодтверждениеПриЗавершенииПрограммыПриИзменении(Элемент)
	ЗапрашиватьПодтверждениеПриЗавершенииПрограммыПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗапрашиватьПодтверждениеПриЗавершенииПрограммыПриИзмененииНаСервере()
	
	// БазоваяФункциональность
	МассивСтруктур = Новый Массив;
	
	Элемент = Новый Структура;
	Элемент.Вставить("Объект", "ОбщиеНастройкиПользователя");
	Элемент.Вставить("Настройка", "ЗапрашиватьПодтверждениеПриЗавершенииПрограммы");
	Элемент.Вставить("Значение", ЗапрашиватьПодтверждениеПриЗавершенииПрограммы);

	МассивСтруктур.Добавить(Элемент);
	// Конец БазоваяФункциональность
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранитьМассив(МассивСтруктур);
	
	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры

#КонецОбласти


