
Функция ПолучитьНаименование(ЗНАЧ НаименованиеОрганизацииПоиск)   Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Организации.ЧекККМ_НаименованиеДляЧека КАК ЧекККМ_НаименованиеДляЧека
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", НаименованиеОрганизацииПоиск);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НаименованиеПоиск = ВыборкаДетальныеЗаписи.ЧекККМ_НаименованиеДляЧека;
	КонецЦикла;                                                          
	
	Возврат НаименованиеПоиск;
	
	 
КонецФункции // ПолучитьНаименование()
