///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Процедура Base64ВШтрихкод(Base64ВШтрихкод, Штрихкод, СтандартнаяОбработка) Экспорт

КонецПроцедуры

Процедура ПараметрыЗапросКМ(ПараметрыЗапросКМ, СтандартнаяОбработка) Экспорт
КонецПроцедуры

Процедура ПараметрыПодтверждениеКМ(ПараметрыПодтвержденияКМ, СтандартнаяОбработка) Экспорт
КонецПроцедуры

Процедура ДополнительныеПараметрыОперации(СохранитьПодключениеККМ, ДополнительныеПараметрыОперации, СтандартнаяОбработка) Экспорт
КонецПроцедуры

Процедура ШтрихкодВBase64(Штрихкод, Base64Штрихкод, СтандартнаяОбработка) Экспорт

КонецПроцедуры

Процедура КодСистемыНалогообложенияККТ(СНО, КодСистемыНалогообложенияККТ, СтандартнаяОбработка) Экспорт

КонецПроцедуры

Процедура ПараметрыОткрытияЗакрытияСмены(ПараметрыОперации, СтандартнаяОбработка) Экспорт
КонецПроцедуры

Процедура ПараметрыВыполненияЭквайринговойОперации(ПараметрыОперации, СтандартнаяОбработка) Экспорт
КонецПроцедуры

Процедура СистемаНалогообложенияККТПоКоду(КодСНО, СНО, СтандартнаяОбработка) Экспорт
КонецПроцедуры

Процедура ТипыСистемНалогообложенияККТ(ТипыСистемНалогообложенияККТ, СтандартнаяОбработка) Экспорт

КонецПроцедуры

Процедура ЯвляетсяОСН(ЭтоОСН, СистемаНалогообложения, СтандартнаяОбработка) Экспорт

КонецПроцедуры

Процедура ОпределитьТипШтрихкода(Штрихкод, ТипШтрихкода, СтандартнаяОбработка) Экспорт

КонецПроцедуры

Процедура РазобратьШтриховойКодТовара(Штрихкод, ДанныеМаркировки, СтандартнаяОбработка) Экспорт

КонецПроцедуры

Процедура ПолучитьРазделительGS1(Разделитель, СтандартнаяОбработка) Экспорт
	
	Разделитель = Символ(29); // Dec 29 
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

Процедура ПолучитьЭкранированныйСимволGS1(Разделитель, СтандартнаяОбработка) Экспорт
	
	Разделитель = "\x1d";
	СтандартнаяОбработка = Ложь;

КонецПроцедуры

Процедура ПараметрыТипыОборудования(ПараметрыТипыОборудования, СтандартнаяОбработка) Экспорт
	
	ТипыОборудования = Новый Структура();
	ТипыОборудования.Вставить("СканерШтрихкода"         , Ложь);
	ТипыОборудования.Вставить("СчитывательМагнитныхКарт", Ложь);
	ТипыОборудования.Вставить("ККТ"                     , Ложь);
	ТипыОборудования.Вставить("ФискальныйРегистратор"   , Ложь);
	ТипыОборудования.Вставить("ПринтерЧеков"            , Ложь);
	ТипыОборудования.Вставить("ДисплейПокупателя"       , Ложь);
	ТипыОборудования.Вставить("ТерминалСбораДанных"     , Ложь);
	ТипыОборудования.Вставить("ЭквайринговыйТерминал"   , Ложь);
	ТипыОборудования.Вставить("ЭлектронныеВесы"         , Ложь);
	ТипыОборудования.Вставить("ВесыСПечатьюЭтикеток"    , Ложь);
	ТипыОборудования.Вставить("ПринтерЭтикеток"         , Ложь);
	ТипыОборудования.Вставить("СчитывательRFID"         , Ложь);
	ТипыОборудования.Вставить("УстройствоРаспознавания" , Ложь);
	ПараметрыТипыОборудования = ТипыОборудования;
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

// Возвращает структуру отбора для получения списка оборудования
//
// Параметры:
//  СписокОборудованияОтбор - Структура.
//  СтандартнаяОбработка - Булево
//
Процедура СписокОборудованияОтбор(СписокОборудованияОтбор, СтандартнаяОбработка) Экспорт
	
	Отбор = Новый Структура();
	ПараметрыТипыОборудования = Неопределено;
	ПараметрыТипыОборудования(ПараметрыТипыОборудования, Ложь);
	
	Отбор.Вставить("Идентификатор" , Неопределено);
	Отбор.Вставить("ТипыПО",        ПараметрыТипыОборудования);
	Отбор.Вставить("РабочееМесто",  Неопределено);
	Отбор.Вставить("Организация",   Неопределено);
	Отбор.Вставить("СетевоеОборудование"  , Истина);    
	Отбор.Вставить("СерверноеОборудование", Ложь);
	Отбор.Вставить("КодЯзыка",      Неопределено);        
	Отбор.Вставить("РазрешенаАвтоматическаяФискализация", Ложь);
	СписокОборудованияОтбор = Отбор;
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти
