
&Вместо("ПолучитьПараметрыВыбораПравилаОбмена")
Функция EF_00_00060826_ПолучитьПараметрыВыбораПравилаОбмена(ПодключаемоеОборудованиеОбъект)
	
	Если ПодключаемоеОборудованиеОбъект.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ВесыСПечатьюЭтикеток Тогда
		НовыйПараметр = Новый ПараметрВыбора("Отбор.ТипПодключаемогоОборудования", Перечисления.ТипыПодключаемогоОборудования.ВесыСПечатьюЭтикеток);
	ИначеЕсли ПодключаемоеОборудованиеОбъект.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККМОфлайн Тогда
		НовыйПараметр = Новый ПараметрВыбора("Отбор.ТипПодключаемогоОборудования", Перечисления.ТипыПодключаемогоОборудования.ККМОфлайн);
	ИначеЕсли ПодключаемоеОборудованиеОбъект.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.УдалитьWebСервисОборудование Тогда
		НовыйПараметр = Новый ПараметрВыбора("Отбор.ТипПодключаемогоОборудования", Перечисления.ТипыПодключаемогоОборудования.УдалитьWebСервисОборудование);
	КонецЕсли;
	
	ПараметрыВыбораЭлемента = Новый Массив;
	ПараметрыВыбораЭлемента.Добавить(НовыйПараметр);
	Возврат Новый ФиксированныйМассив(ПараметрыВыбораЭлемента);
	
КонецФункции

&Вместо("ЗаполнитьНастройкиККМ")
Процедура EF_00_00060826_ЗаполнитьНастройкиККМ(ОфлайнОборудование, НастройкиОборудования)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПравилоОбмена.Склад КАК Склад,
	|	ПравилоОбмена.Склад.Организация КАК Организация,
	|	ПравилоОбмена.Склад.Организация.Наименование КАК НаименованиеОрганизации,
	|	ПравилоОбмена.Склад.Магазин КАК Магазин,
	|	ПравилоОбмена.Склад.Магазин.Наименование КАК НаименованиеМагазина,
	|	ПравилоОбмена.Склад.Организация.ИНН КАК ИНН,
	|	ПравилоОбмена.Склад.Организация.КПП КАК КПП
	|ИЗ
	|	Справочник.ПравилаОбменаСПодключаемымОборудованием КАК ПравилоОбмена
	|ГДЕ
	|	ПравилоОбмена.Ссылка = &ПравилоОбмена";
	
	Запрос.УстановитьПараметр("ПравилоОбмена",
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОфлайнОборудование, "ПравилоОбмена"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		НастройкиОборудования.НаименованиеОрганизации = Выборка.НаименованиеОрганизации;
		НастройкиОборудования.НаименованиеМагазина = Выборка.НаименованиеМагазина;
		НастройкиОборудования.ИНН = Выборка.ИНН;
		НастройкиОборудования.КПП = Выборка.КПП;
		
		//МестоТочкиПродажи
		НастройкиОборудования.АдресТочкиПродажи = ОбщегоНазначенияРТ.АдресМагазина(Выборка.Магазин);
		
		//АдресТочкиПродажи
		
		//СистемыНалогообложения
		ДатаСеанса = ТекущаяДатаСеанса();
		
		СистемаНалогообложенияККТ = ПодключаемоеОборудованиеРТ.ПолучитьСистемуНалогообложения(ДатаСеанса, 
																							  Выборка.Организация,
																							  Выборка.Магазин,
																							  Выборка.Склад);
																							
		НастройкиОборудования.СистемыНалогообложения.Добавить(СистемаНалогообложенияККТ);
		
		//ЭлектроннаяПочтаОтправителяЧека
		СистемнаяУчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
		Если ЗначениеЗаполнено(СистемнаяУчетнаяЗапись) Тогда
			НастройкиОборудования.ЭлектроннаяПочтаОтправителяЧека = СистемнаяУчетнаяЗапись.АдресЭлектроннойПочты;
		КонецЕсли;
		
	КонецЕсли;
	
	
	
	
	// виды электронной оплаты
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КассыККМ.Ссылка КАК Ссылка,
	|	КассыККМ.СоответствиеВидовОплаты КАК СоответствиеВидовОплаты
	|ПОМЕСТИТЬ КассыККМ
	|ИЗ
	|	Справочник.КассыККМ КАК КассыККМ
	|ГДЕ
	|	КассыККМ.ПодключаемоеОборудование = &ОфлайнОборудование
	|	И НЕ КассыККМ.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СоответствиеВидов.КодВидаОплатыККМOffline КАК КодВидаОплаты,
	|	СоответствиеВидов.ВидОплаты КАК ВидОплаты,
	|	СоответствиеВидов.ВидОплаты.ТипОплаты КАК ТипОплаты,
	|	СоответствиеВидов.ВидОплаты.Наименование КАК ВидОплатыНаименование
	|ИЗ
	|	Справочник.СоответствиеВидовОплатыСККМOffline.СоответствиеВидовОплаты КАК СоответствиеВидов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КассыККМ КАК КассыККМ
	|		ПО СоответствиеВидов.Ссылка = КассыККМ.СоответствиеВидовОплаты";
	
	Запрос.УстановитьПараметр("ОфлайнОборудование", ОфлайнОборудование);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ТипОплаты = Перечисления.ТипыОплатЧекаККМ.Наличные Тогда
			Продолжить;
		КонецЕсли;
		
		ВидОплаты = Неопределено;
		ТипОплаты = Неопределено;
		
		Если Выборка.ТипОплаты = Перечисления.ТипыОплатЧекаККМ.ПлатежнаяКарта Тогда
			
			ВидОплаты = Выборка.ВидОплаты;
			ТипЭлектроннойОплаты = МенеджерОфлайнОборудования.ТипЭлектроннойОплатыПлатежнаяКарта();
			
		ИначеЕсли Выборка.ТипОплаты = Перечисления.ТипыОплатЧекаККМ.БанковскийКредит Тогда
			
			ВидОплаты = Выборка.ВидОплаты;
			ТипЭлектроннойОплаты = МенеджерОфлайнОборудования.ТипЭлектроннойОплатыБанковскийКредит();
			
		ИначеЕсли Выборка.ТипОплаты = Перечисления.ТипыОплатЧекаККМ.ПодарочныйСертификат Тогда
			
			ВидОплаты = Выборка.ВидОплаты;
			ТипЭлектроннойОплаты = МенеджерОфлайнОборудования.ТипЭлектроннойОплатыПодарочныйСертификат();
			
		ИначеЕсли Выборка.ТипОплаты = Перечисления.ТипыОплатЧекаККМ.Бонусы Тогда
			
			ВидОплаты = Выборка.ВидОплаты;
			ТипЭлектроннойОплаты = МенеджерОфлайнОборудования.ТипЭлектроннойОплатыБонусы();
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВидОплаты) Тогда
			
			ВидОплатыККМ = МенеджерОфлайнОборудования.ПолучитьЗаписьВидЭлектроннойОплаты();
			
			ВидОплатыККМ.Код 						= Выборка.КодВидаОплаты;
			ВидОплатыККМ.Наименование 				= Выборка.ВидОплатыНаименование;
			ВидОплатыККМ.ТипЭлектроннойОплаты 		= ТипЭлектроннойОплаты;
			ВидОплатыККМ.УникальныйИдентификатор 	= Выборка.ВидОплаты.УникальныйИдентификатор();
			
			НастройкиОборудования.ВидыЭлектроннойОплаты.Добавить(ВидОплатыККМ);
			
		КонецЕсли;
			
	КонецЦикла;
	
КонецПроцедуры
