
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(Перечисления.СтатусыДокументовИСЦЭДМ.Черновик); //промежуточный статус, документ успешно зарегистрирован и ожидает подписи ЭЦП
	ДанныеВыбора.Добавить(Перечисления.СтатусыДокументовИСЦЭДМ.Отклонен); //для Актов, отклонен получателем
	ДанныеВыбора.Добавить(Перечисления.СтатусыДокументовИСЦЭДМ.ОжидаетПодтверждение); //для Актов, успешно отправлен получателю, может быть отозван
	ДанныеВыбора.Добавить(Перечисления.СтатусыДокументовИСЦЭДМ.Принят); //для Актов, подтвержден получателем
	ДанныеВыбора.Добавить(Перечисления.СтатусыДокументовИСЦЭДМ.ОшибкаПриПроверке); //промежуточный статус, если в момент первичной регистрации на сервере обнаружены ошибки в данных кодов маркировки
	ДанныеВыбора.Добавить(Перечисления.СтатусыДокументовИСЦЭДМ.Отозван); //для Актов
	ДанныеВыбора.Добавить(Перечисления.СтатусыДокументовИСЦЭДМ.Аннулирован); //?
	ДанныеВыбора.Добавить(Перечисления.СтатусыДокументовИСЦЭДМ.РасчетИтогов); //промежуточный статус при отправке документов, нужно провести заполнение цен (в 1С выполняется автоматически).
	ДанныеВыбора.Добавить(Перечисления.СтатусыДокументовИСЦЭДМ.Сформирован); //для Уведомлений, документ успешно принят сервером
	ДанныеВыбора.Добавить(Перечисления.СтатусыДокументовИСЦЭДМ.НеОпределен); //наш внутренний статус, документ не отправлялся на сервер
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
