#Область ПрограммныйИнтерфейс

// Возвращает массив праздничных дней по номеру года.
//
// Параметры:
//  НомерГода - Число - номер текущего года.
//
// Возвращаемое значение:
//  Массив - массив праздничных дней.
//
Функция МассивПраздничныхДней(НомерГода) Экспорт
	
	ПраздничныеДни = Новый Массив;
	
	Если НомерГода = 2010 Тогда
		
		ПраздничныеДни.Добавить(Дата(2010, 1, 1));
		ПраздничныеДни.Добавить(Дата(2010, 1, 2));
		ПраздничныеДни.Добавить(Дата(2010, 1, 3));
		ПраздничныеДни.Добавить(Дата(2010, 1, 4));
		ПраздничныеДни.Добавить(Дата(2010, 1, 5));
		ПраздничныеДни.Добавить(Дата(2010, 1, 7));
		ПраздничныеДни.Добавить(Дата(2010, 2, 23));
		ПраздничныеДни.Добавить(Дата(2010, 3, 8));
		ПраздничныеДни.Добавить(Дата(2010, 5, 1));
		ПраздничныеДни.Добавить(Дата(2010, 5, 9));
		ПраздничныеДни.Добавить(Дата(2010, 6, 12));
		ПраздничныеДни.Добавить(Дата(2010, 11, 4));
		
		ПраздничныеДни.Добавить(Дата(2010, 1, 6));
		ПраздничныеДни.Добавить(Дата(2010, 1, 8));
		ПраздничныеДни.Добавить(Дата(2010, 2, 22));
		ПраздничныеДни.Добавить(Дата(2010, 5, 3));
		ПраздничныеДни.Добавить(Дата(2010, 5, 10));
		ПраздничныеДни.Добавить(Дата(2010, 6, 14));
		ПраздничныеДни.Добавить(Дата(2010, 11, 5));
		
	ИначеЕсли НомерГода = 2011 Тогда
		
		ПраздничныеДни.Добавить(Дата(2011, 1, 1));
		ПраздничныеДни.Добавить(Дата(2011, 1, 2));
		ПраздничныеДни.Добавить(Дата(2011, 1, 3));
		ПраздничныеДни.Добавить(Дата(2011, 1, 4));
		ПраздничныеДни.Добавить(Дата(2011, 1, 5));
		ПраздничныеДни.Добавить(Дата(2011, 1, 7));
		ПраздничныеДни.Добавить(Дата(2011, 2, 23));
		ПраздничныеДни.Добавить(Дата(2011, 3, 8));
		ПраздничныеДни.Добавить(Дата(2011, 5, 1));
		ПраздничныеДни.Добавить(Дата(2011, 5, 9));
		ПраздничныеДни.Добавить(Дата(2011, 6, 12));
		ПраздничныеДни.Добавить(Дата(2011, 11, 4));
		
		ПраздничныеДни.Добавить(Дата(2011, 1, 6));
		ПраздничныеДни.Добавить(Дата(2011, 1, 10));
		ПраздничныеДни.Добавить(Дата(2011, 5, 2));
		ПраздничныеДни.Добавить(Дата(2011, 6, 13));
		
	ИначеЕсли НомерГода = 2012 Тогда
		
		ПраздничныеДни.Добавить(Дата(2012, 1, 1));
		ПраздничныеДни.Добавить(Дата(2012, 1, 2));
		ПраздничныеДни.Добавить(Дата(2012, 1, 3));
		ПраздничныеДни.Добавить(Дата(2012, 1, 4));
		ПраздничныеДни.Добавить(Дата(2012, 1, 5));
		ПраздничныеДни.Добавить(Дата(2012, 1, 6));
		ПраздничныеДни.Добавить(Дата(2012, 1, 7));
		ПраздничныеДни.Добавить(Дата(2012, 2, 23));
		ПраздничныеДни.Добавить(Дата(2012, 3, 8));
		ПраздничныеДни.Добавить(Дата(2012, 5, 1));
		ПраздничныеДни.Добавить(Дата(2012, 5, 9));
		ПраздничныеДни.Добавить(Дата(2012, 6, 12));
		ПраздничныеДни.Добавить(Дата(2012, 11, 4));
		
		ПраздничныеДни.Добавить(Дата(2012, 3, 9));
		ПраздничныеДни.Добавить(Дата(2012, 4, 30));
		ПраздничныеДни.Добавить(Дата(2012, 6, 11));
		ПраздничныеДни.Добавить(Дата(2012, 12, 31));
		ПраздничныеДни.Добавить(Дата(2012, 5, 7));
		ПраздничныеДни.Добавить(Дата(2012, 5, 8));
		
	ИначеЕсли НомерГода = 2013 Тогда
		
		ПраздничныеДни.Добавить(Дата(2013, 1, 1));
		ПраздничныеДни.Добавить(Дата(2013, 1, 2));
		ПраздничныеДни.Добавить(Дата(2013, 1, 3));
		ПраздничныеДни.Добавить(Дата(2013, 1, 4));
		ПраздничныеДни.Добавить(Дата(2013, 1, 5));
		ПраздничныеДни.Добавить(Дата(2013, 1, 6));
		ПраздничныеДни.Добавить(Дата(2013, 1, 7));
		ПраздничныеДни.Добавить(Дата(2013, 1, 8));
		ПраздничныеДни.Добавить(Дата(2013, 2, 23));
		ПраздничныеДни.Добавить(Дата(2013, 3, 8));
		ПраздничныеДни.Добавить(Дата(2013, 5, 1));
		ПраздничныеДни.Добавить(Дата(2013, 5, 9));
		ПраздничныеДни.Добавить(Дата(2013, 6, 12));
		ПраздничныеДни.Добавить(Дата(2013, 11, 4));
		
		ПраздничныеДни.Добавить(Дата(2013, 5, 2));
		ПраздничныеДни.Добавить(Дата(2013, 5, 3));
		ПраздничныеДни.Добавить(Дата(2013, 5, 10));
		
	ИначеЕсли НомерГода = 2014 Тогда
		
		ПраздничныеДни.Добавить(Дата(2014, 1, 1));
		ПраздничныеДни.Добавить(Дата(2014, 1, 2));
		ПраздничныеДни.Добавить(Дата(2014, 1, 3));
		ПраздничныеДни.Добавить(Дата(2014, 1, 4));
		ПраздничныеДни.Добавить(Дата(2014, 1, 5));
		ПраздничныеДни.Добавить(Дата(2014, 1, 6));
		ПраздничныеДни.Добавить(Дата(2014, 1, 7));
		ПраздничныеДни.Добавить(Дата(2014, 1, 8));
		ПраздничныеДни.Добавить(Дата(2014, 2, 23));
		ПраздничныеДни.Добавить(Дата(2014, 3, 8));
		ПраздничныеДни.Добавить(Дата(2014, 5, 1));
		ПраздничныеДни.Добавить(Дата(2014, 5, 9));
		ПраздничныеДни.Добавить(Дата(2014, 6, 12));
		ПраздничныеДни.Добавить(Дата(2014, 11, 4));
		
		ПраздничныеДни.Добавить(Дата(2014, 5, 2));
		ПраздничныеДни.Добавить(Дата(2014, 6, 13));
		ПраздничныеДни.Добавить(Дата(2014, 11, 3));
		
	ИначеЕсли НомерГода = 2015 Тогда
		
		// Новогодние каникулы
		ПраздничныеДни.Добавить(Дата(2015, 1, 1));
		ПраздничныеДни.Добавить(Дата(2015, 1, 2));
		ПраздничныеДни.Добавить(Дата(2015, 1, 3));
		ПраздничныеДни.Добавить(Дата(2015, 1, 4));
		ПраздничныеДни.Добавить(Дата(2015, 1, 5));
		ПраздничныеДни.Добавить(Дата(2015, 1, 6));
		ПраздничныеДни.Добавить(Дата(2015, 1, 8));
		
		// Рождество Христово
		ПраздничныеДни.Добавить(Дата(2015, 1, 7));
		
		// День защитника Отечества
		ПраздничныеДни.Добавить(Дата(2015, 2, 23));
		
		// Международный женский день
		ПраздничныеДни.Добавить(Дата(2015, 3, 8));
		ПраздничныеДни.Добавить(Дата(2015, 3, 9));
		
		// Праздник Весны и Труда
		ПраздничныеДни.Добавить(Дата(2015, 5, 1));
		
		// День Победы.
		ПраздничныеДни.Добавить(Дата(2015, 5, 9));
		ПраздничныеДни.Добавить(Дата(2015, 5, 11));
		
		// День России
		ПраздничныеДни.Добавить(Дата(2015, 6, 12));
		
		// День народного единства
		ПраздничныеДни.Добавить(Дата(2015, 11, 4));
		
		// Перенос выходных дней
		// 3 января → 9 января
		// 4 января → 4 мая
		ПраздничныеДни.Добавить(Дата(2015, 1, 9));
		ПраздничныеДни.Добавить(Дата(2015, 5, 4));
		
	ИначеЕсли НомерГода = 2016 Тогда
		
		// Новогодние каникулы
		ПраздничныеДни.Добавить(Дата(2016, 1, 1));
		ПраздничныеДни.Добавить(Дата(2016, 1, 2));
		ПраздничныеДни.Добавить(Дата(2016, 1, 4));
		
		// Рождество Христово
		ПраздничныеДни.Добавить(Дата(2016, 1, 7));
		
		// Международный женский день
		ПраздничныеДни.Добавить(Дата(2016, 3, 7));
		ПраздничныеДни.Добавить(Дата(2016, 3, 8));
		
		ПраздничныеДни.Добавить(Дата(2016, 3, 21));
		ПраздничныеДни.Добавить(Дата(2016, 3, 22));
		ПраздничныеДни.Добавить(Дата(2016, 3, 23));
		
		ПраздничныеДни.Добавить(Дата(2016, 5, 1));
		ПраздничныеДни.Добавить(Дата(2016, 5, 2));
		ПраздничныеДни.Добавить(Дата(2016, 5, 7));

		// День Победы.
		ПраздничныеДни.Добавить(Дата(2016, 5, 9));
		ПраздничныеДни.Добавить(Дата(2016, 5, 10));
		
		ПраздничныеДни.Добавить(Дата(2016, 7, 6));
		
		ПраздничныеДни.Добавить(Дата(2016, 8, 30));
		
		ПраздничныеДни.Добавить(Дата(2016, 11, 12));
		ПраздничныеДни.Добавить(Дата(2016, 12, 1));
		ПраздничныеДни.Добавить(Дата(2016, 12, 16));
		ПраздничныеДни.Добавить(Дата(2016, 12, 17));
		ПраздничныеДни.Добавить(Дата(2016, 12, 19));
	
	ИначеЕсли НомерГода = 2017 Тогда
		
		// Новогодние каникулы
		ПраздничныеДни.Добавить(Дата(2017, 1, 1));
		ПраздничныеДни.Добавить(Дата(2017, 1, 2));
		ПраздничныеДни.Добавить(Дата(2017, 1, 3));
		
		// Рождество Христово
		ПраздничныеДни.Добавить(Дата(2017, 1, 7));

		// Международный женский день
		ПраздничныеДни.Добавить(Дата(2017, 3, 8));
		
		ПраздничныеДни.Добавить(Дата(2017, 3, 21));
		ПраздничныеДни.Добавить(Дата(2017, 3, 22));
		ПраздничныеДни.Добавить(Дата(2017, 3, 23));

		ПраздничныеДни.Добавить(Дата(2017, 5, 1));
		ПраздничныеДни.Добавить(Дата(2017, 5, 7));
		ПраздничныеДни.Добавить(Дата(2017, 5, 8));
		ПраздничныеДни.Добавить(Дата(2017, 5, 9));
		
		ПраздничныеДни.Добавить(Дата(2017, 7, 6));
		ПраздничныеДни.Добавить(Дата(2017, 8, 30));
		ПраздничныеДни.Добавить(Дата(2017, 9, 1));
		
		ПраздничныеДни.Добавить(Дата(2017, 12, 1));
		ПраздничныеДни.Добавить(Дата(2017, 12, 16));
		ПраздничныеДни.Добавить(Дата(2017, 12, 17));
		ПраздничныеДни.Добавить(Дата(2017, 12, 18));
		ПраздничныеДни.Добавить(Дата(2017, 12, 19));

	ИначеЕсли НомерГода = 2018 Тогда
		
		// Новый год
		ПраздничныеДни.Добавить(Дата(2018, 1, 1));
		ПраздничныеДни.Добавить(Дата(2018, 1, 2));
		
		// Православное Рождество
		ПраздничныеДни.Добавить(Дата(2018, 1, 7));
	
		// Международный женский день
		ПраздничныеДни.Добавить(Дата(2018, 3, 8));

		// Наурыз
		ПраздничныеДни.Добавить(Дата(2018, 3, 21));
		ПраздничныеДни.Добавить(Дата(2018, 3, 22));
		ПраздничныеДни.Добавить(Дата(2018, 3, 23));

		// Праздник Единства народа Казахстана
		ПраздничныеДни.Добавить(Дата(2018, 5, 1));

		// День защитника Отечества
		ПраздничныеДни.Добавить(Дата(2018, 5, 7));
		
		// День Победы
		ПраздничныеДни.Добавить(Дата(2018, 5, 9));
				
		// День Столицы
		ПраздничныеДни.Добавить(Дата(2018, 7, 6));
		
		// Первый день Курбан-айта
		ПраздничныеДни.Добавить(Дата(2018, 8, 21));
		
		// День Конституции Республики Казахстан
		ПраздничныеДни.Добавить(Дата(2018, 8, 30));
		
		// День Первого Президента Республики Казахстан
		ПраздничныеДни.Добавить(Дата(2018, 12, 1));
		ПраздничныеДни.Добавить(Дата(2018, 12, 3));
		
		// День независимости
		ПраздничныеДни.Добавить(Дата(2018, 12, 16));
		ПраздничныеДни.Добавить(Дата(2018, 12, 17));
		ПраздничныеДни.Добавить(Дата(2018, 12, 18));
		
	ИначеЕсли НомерГода = 2019 Тогда
		
		// Новый год
		ПраздничныеДни.Добавить(Дата(2019, 1, 1));
		ПраздничныеДни.Добавить(Дата(2019, 1, 2));
		
		// Православное Рождество
		ПраздничныеДни.Добавить(Дата(2019, 1, 7));
		
		// Международный женский день
		ПраздничныеДни.Добавить(Дата(2019, 3, 8));

		// Наурыз
		ПраздничныеДни.Добавить(Дата(2019, 3, 21));
		ПраздничныеДни.Добавить(Дата(2019, 3, 22));
		ПраздничныеДни.Добавить(Дата(2019, 3, 23));
		ПраздничныеДни.Добавить(Дата(2019, 3, 25));

		// Праздник Единства народа Казахстана
		ПраздничныеДни.Добавить(Дата(2019, 5, 1));

		// День защитника Отечества
		ПраздничныеДни.Добавить(Дата(2019, 5, 7));
		
		// День Победы
		ПраздничныеДни.Добавить(Дата(2019, 5, 9));
				
		// День Столицы
		ПраздничныеДни.Добавить(Дата(2019, 7, 6));
		ПраздничныеДни.Добавить(Дата(2019, 7, 8));
		
		// Первый день Курбан-айта
		ПраздничныеДни.Добавить(Дата(2019, 8, 11));
		
		// День Конституции Республики Казахстан
		ПраздничныеДни.Добавить(Дата(2019, 8, 30));
		
		// День Первого Президента Республики Казахстан
		ПраздничныеДни.Добавить(Дата(2019, 12, 1));
		ПраздничныеДни.Добавить(Дата(2019, 12, 2));
		
		// День независимости
		ПраздничныеДни.Добавить(Дата(2019, 12, 16));
		ПраздничныеДни.Добавить(Дата(2019, 12, 17));

	ИначеЕсли НомерГода = 2020 Тогда
		
		// Новый год
		ПраздничныеДни.Добавить(Дата(2020, 1, 1));
		ПраздничныеДни.Добавить(Дата(2020, 1, 2));
		
		// Православное Рождество
		ПраздничныеДни.Добавить(Дата(2020, 1, 7));
		
		// Международный женский день
		ПраздничныеДни.Добавить(Дата(2020, 3, 8));

		// Наурыз
		ПраздничныеДни.Добавить(Дата(2020, 3, 21));
		ПраздничныеДни.Добавить(Дата(2020, 3, 22));
		ПраздничныеДни.Добавить(Дата(2020, 3, 23));
		
		// Праздник Единства народа Казахстана
		ПраздничныеДни.Добавить(Дата(2020, 5, 1));

		// День защитника Отечества
		ПраздничныеДни.Добавить(Дата(2020, 5, 7));
		
		// День Победы
		ПраздничныеДни.Добавить(Дата(2020, 5, 9));
				
		// День Столицы
		ПраздничныеДни.Добавить(Дата(2020, 7, 6));
				
		// Первый день Курбан-айта
		ПраздничныеДни.Добавить(Дата(2020, 7, 31));
		
		// День Конституции Республики Казахстан
		ПраздничныеДни.Добавить(Дата(2020, 8, 30));
		
		// День Первого Президента Республики Казахстан
		ПраздничныеДни.Добавить(Дата(2020, 12, 1));
				
		// День независимости
		ПраздничныеДни.Добавить(Дата(2020, 12, 16));
		ПраздничныеДни.Добавить(Дата(2020, 12, 17));

	ИначеЕсли НомерГода = 2021 Тогда
		
		#Область Год_2021
		// Новый год
		ПраздничныеДни.Добавить(Дата(НомерГода, 1, 1));
		ПраздничныеДни.Добавить(Дата(НомерГода, 1, 2));
		
		// Православное Рождество
		ПраздничныеДни.Добавить(Дата(НомерГода, 1, 7));
		
		// Международный женский день
		ПраздничныеДни.Добавить(Дата(НомерГода, 3, 8));

		// Наурыз
		ПраздничныеДни.Добавить(Дата(НомерГода, 3, 21));
		ПраздничныеДни.Добавить(Дата(НомерГода, 3, 22));
		ПраздничныеДни.Добавить(Дата(НомерГода, 3, 23));
		
		// Праздник Единства народа Казахстана
		ПраздничныеДни.Добавить(Дата(НомерГода, 5, 1));

		// День защитника Отечества
		ПраздничныеДни.Добавить(Дата(НомерГода, 5, 7));
		
		// День Победы
		ПраздничныеДни.Добавить(Дата(НомерГода, 5, 9));
				
		// День Столицы
		ПраздничныеДни.Добавить(Дата(НомерГода, 7, 6));
				
		// Первый день Курбан-айта
		ПраздничныеДни.Добавить(Дата(НомерГода, 7, 20));
		
		// День Конституции Республики Казахстан
		ПраздничныеДни.Добавить(Дата(НомерГода, 8, 30));
		
		// День Первого Президента Республики Казахстан
		ПраздничныеДни.Добавить(Дата(НомерГода, 12, 1));
				
		// День независимости
		ПраздничныеДни.Добавить(Дата(НомерГода, 12, 16));
		ПраздничныеДни.Добавить(Дата(НомерГода, 12, 17));
		#КонецОбласти
		
	ИначеЕсли НомерГода = 2022 Тогда
		
		#Область Год_2022
		// Новый год
		ПраздничныеДни.Добавить(Дата(НомерГода, 1, 1));
		ПраздничныеДни.Добавить(Дата(НомерГода, 1, 2));
		
		// Православное Рождество
		ПраздничныеДни.Добавить(Дата(НомерГода, 1, 7));
		
		// Международный женский день
		ПраздничныеДни.Добавить(Дата(НомерГода, 3, 8));

		// Наурыз
		ПраздничныеДни.Добавить(Дата(НомерГода, 3, 21));
		ПраздничныеДни.Добавить(Дата(НомерГода, 3, 22));
		ПраздничныеДни.Добавить(Дата(НомерГода, 3, 23));
		
		// Праздник Единства народа Казахстана
		ПраздничныеДни.Добавить(Дата(НомерГода, 5, 1));

		// День защитника Отечества
		ПраздничныеДни.Добавить(Дата(НомерГода, 5, 7));
		
		// День Победы
		ПраздничныеДни.Добавить(Дата(НомерГода, 5, 9));
				
		// День Столицы
		ПраздничныеДни.Добавить(Дата(НомерГода, 7, 6));
				
		// Первый день Курбан-айта
		ПраздничныеДни.Добавить(Дата(НомерГода, 7, 9));
		
		// День Конституции Республики Казахстан
		ПраздничныеДни.Добавить(Дата(НомерГода, 8, 30));
		
		// День Первого Президента Республики Казахстан
		ПраздничныеДни.Добавить(Дата(НомерГода, 12, 1));
				
		// День независимости
		ПраздничныеДни.Добавить(Дата(НомерГода, 12, 16));
		ПраздничныеДни.Добавить(Дата(НомерГода, 12, 17));
		#КонецОбласти
		
	ИначеЕсли НомерГода = 2023 Тогда
		
		#Область Год_2023
		// Новый год
		ПраздничныеДни.Добавить(Дата(НомерГода, 1, 1));
		ПраздничныеДни.Добавить(Дата(НомерГода, 1, 2));
		
		// Православное Рождество
		ПраздничныеДни.Добавить(Дата(НомерГода, 1, 7));
		
		// Международный женский день
		ПраздничныеДни.Добавить(Дата(НомерГода, 3, 8));

		// Наурыз
		ПраздничныеДни.Добавить(Дата(НомерГода, 3, 21));
		ПраздничныеДни.Добавить(Дата(НомерГода, 3, 22));
		ПраздничныеДни.Добавить(Дата(НомерГода, 3, 23));
		
		// Праздник Единства народа Казахстана
		ПраздничныеДни.Добавить(Дата(НомерГода, 5, 1));

		// День защитника Отечества
		ПраздничныеДни.Добавить(Дата(НомерГода, 5, 7));
		
		// День Победы
		ПраздничныеДни.Добавить(Дата(НомерГода, 5, 9));
		
		// Первый день Курбан-айта
		ПраздничныеДни.Добавить(Дата(НомерГода, 6, 28));
		
		// День Столицы
		ПраздничныеДни.Добавить(Дата(НомерГода, 7, 6));
		
		// День Конституции Республики Казахстан
		ПраздничныеДни.Добавить(Дата(НомерГода, 8, 30));
		
		// День Республики
		ПраздничныеДни.Добавить(Дата(НомерГода, 10, 25));
				
		// День независимости
		ПраздничныеДни.Добавить(Дата(НомерГода, 12, 16));
		#КонецОбласти
		
	ИначеЕсли НомерГода = 2024 Тогда
		
		#Область Год_2024
		// Новый год
		ПраздничныеДни.Добавить(Дата(НомерГода, 1, 1));
		ПраздничныеДни.Добавить(Дата(НомерГода, 1, 2));
		
		// Православное Рождество
		ПраздничныеДни.Добавить(Дата(НомерГода, 1, 7));
		
		// Международный женский день
		ПраздничныеДни.Добавить(Дата(НомерГода, 3, 8));

		// Наурыз
		ПраздничныеДни.Добавить(Дата(НомерГода, 3, 21));
		ПраздничныеДни.Добавить(Дата(НомерГода, 3, 22));
		ПраздничныеДни.Добавить(Дата(НомерГода, 3, 23));
		
		// Праздник Единства народа Казахстана
		ПраздничныеДни.Добавить(Дата(НомерГода, 5, 1));

		// День защитника Отечества
		ПраздничныеДни.Добавить(Дата(НомерГода, 5, 7));
		
		// День Победы
		ПраздничныеДни.Добавить(Дата(НомерГода, 5, 9));
		
		// Первый день Курбан-айта
		ПраздничныеДни.Добавить(Дата(НомерГода, 6, 16));
		
		// День Столицы
		ПраздничныеДни.Добавить(Дата(НомерГода, 7, 6));
				
		// День Конституции Республики Казахстан
		ПраздничныеДни.Добавить(Дата(НомерГода, 8, 30));
		
		// День Республики
		ПраздничныеДни.Добавить(Дата(НомерГода, 10, 25));
				
		// День независимости
		ПраздничныеДни.Добавить(Дата(НомерГода, 12, 16));
		#КонецОбласти
		
	ИначеЕсли НомерГода = 2025 Тогда
		
		#Область Год_2025
		// Новый год
		ПраздничныеДни.Добавить(Дата(НомерГода, 1, 1));
		ПраздничныеДни.Добавить(Дата(НомерГода, 1, 2));
		
		// Православное Рождество
		ПраздничныеДни.Добавить(Дата(НомерГода, 1, 7));
		
		// Международный женский день
		ПраздничныеДни.Добавить(Дата(НомерГода, 3, 8));

		// Наурыз
		ПраздничныеДни.Добавить(Дата(НомерГода, 3, 21));
		ПраздничныеДни.Добавить(Дата(НомерГода, 3, 22));
		ПраздничныеДни.Добавить(Дата(НомерГода, 3, 23));
		
		// Праздник Единства народа Казахстана
		ПраздничныеДни.Добавить(Дата(НомерГода, 5, 1));

		// День защитника Отечества
		ПраздничныеДни.Добавить(Дата(НомерГода, 5, 7));
		
		// День Победы
		ПраздничныеДни.Добавить(Дата(НомерГода, 5, 9));
		
		// Первый день Курбан-айта
		ПраздничныеДни.Добавить(Дата(НомерГода, 6, 6));
		
		// День Столицы
		ПраздничныеДни.Добавить(Дата(НомерГода, 7, 6));
				
		// День Конституции Республики Казахстан
		ПраздничныеДни.Добавить(Дата(НомерГода, 8, 30));
		
		// День Республики
		ПраздничныеДни.Добавить(Дата(НомерГода, 10, 25));
				
		// День независимости
		ПраздничныеДни.Добавить(Дата(НомерГода, 12, 16));
		#КонецОбласти
		
	КонецЕсли;

	Возврат ПраздничныеДни;
	
КонецФункции

#КонецОбласти